/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const ngx_rename_file_n: &[u8; 9] = b"rename()\0";
pub const ngx_change_file_access_n: &[u8; 8] = b"chmod()\0";
pub const ngx_set_file_time_n: &[u8; 9] = b"utimes()\0";
pub const ngx_file_info_n: &[u8; 7] = b"stat()\0";
pub const ngx_fd_info_n: &[u8; 8] = b"fstat()\0";
pub const ngx_link_info_n: &[u8; 8] = b"lstat()\0";
pub const ngx_realpath_n: &[u8; 11] = b"realpath()\0";
pub const ngx_getcwd_n: &[u8; 9] = b"getcwd()\0";
pub const ngx_open_dir_n: &[u8; 10] = b"opendir()\0";
pub const ngx_close_dir_n: &[u8; 11] = b"closedir()\0";
pub const ngx_read_dir_n: &[u8; 10] = b"readdir()\0";
pub const ngx_create_dir_n: &[u8; 8] = b"mkdir()\0";
pub const ngx_delete_dir_n: &[u8; 8] = b"rmdir()\0";
pub const ngx_de_info_n: &[u8; 7] = b"stat()\0";
pub const ngx_de_link_info_n: &[u8; 8] = b"lstat()\0";
pub const ngx_open_glob_n: &[u8; 7] = b"glob()\0";
pub const ngx_trylock_fd_n: &[u8; 24] = b"fcntl(F_SETLK, F_WRLCK)\0";
pub const ngx_lock_fd_n: &[u8; 25] = b"fcntl(F_SETLKW, F_WRLCK)\0";
pub const ngx_unlock_fd_n: &[u8; 24] = b"fcntl(F_SETLK, F_UNLCK)\0";
pub const ngx_read_ahead_n: &[u8; 37] = b"posix_fadvise(POSIX_FADV_SEQUENTIAL)\0";
pub const ngx_directio_on_n: &[u8; 16] = b"fcntl(O_DIRECT)\0";
pub const ngx_directio_off_n: &[u8; 17] = b"fcntl(!O_DIRECT)\0";
pub const ngx_openat_file_n: &[u8; 9] = b"openat()\0";
pub const ngx_file_at_info_n: &[u8; 10] = b"fstatat()\0";
pub const ngx_stdout: u32 = 1;
pub const ngx_stderr: u32 = 2;
pub const ngx_set_stderr_n: &[u8; 20] = b"dup2(STDERR_FILENO)\0";
pub const ngx_dlopen_n: &[u8; 9] = b"dlopen()\0";
pub const ngx_dlsym_n: &[u8; 8] = b"dlsym()\0";
pub const ngx_dlclose_n: &[u8; 10] = b"dlclose()\0";
pub const ngx_regex_exec_n: &[u8; 12] = b"pcre_exec()\0";
pub const ngx_next_time_n: &[u8; 9] = b"mktime()\0";
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
pub type __time_t = ::std::os::raw::c_long;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type ino_t = __ino64_t;
pub type gid_t = __gid_t;
pub type uid_t = __uid_t;
pub type off_t = __off64_t;
pub type pid_t = __pid_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type socklen_t = __socklen_t;
pub type va_list = __builtin_va_list;
pub type sig_atomic_t = __sig_atomic_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dirent {
    pub d_ino: __ino64_t,
    pub d_off: __off64_t,
    pub d_reclen: ::std::os::raw::c_ushort,
    pub d_type: ::std::os::raw::c_uchar,
    pub d_name: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dirent"][::std::mem::size_of::<dirent>() - 280usize];
    ["Alignment of dirent"][::std::mem::align_of::<dirent>() - 8usize];
    ["Offset of field: dirent::d_ino"][::std::mem::offset_of!(dirent, d_ino) - 0usize];
    ["Offset of field: dirent::d_off"][::std::mem::offset_of!(dirent, d_off) - 8usize];
    ["Offset of field: dirent::d_reclen"][::std::mem::offset_of!(dirent, d_reclen) - 16usize];
    ["Offset of field: dirent::d_type"][::std::mem::offset_of!(dirent, d_type) - 18usize];
    ["Offset of field: dirent::d_name"][::std::mem::offset_of!(dirent, d_name) - 19usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __dirstream {
    _unused: [u8; 0],
}
pub type DIR = __dirstream;
pub type __size_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct glob_t {
    pub gl_pathc: __size_t,
    pub gl_pathv: *mut *mut ::std::os::raw::c_char,
    pub gl_offs: __size_t,
    pub gl_flags: ::std::os::raw::c_int,
    pub gl_closedir: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub gl_readdir: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut dirent,
    >,
    pub gl_opendir: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void,
    >,
    pub gl_lstat: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_char,
            arg2: *mut stat,
        ) -> ::std::os::raw::c_int,
    >,
    pub gl_stat: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_char,
            arg2: *mut stat,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of glob_t"][::std::mem::size_of::<glob_t>() - 72usize];
    ["Alignment of glob_t"][::std::mem::align_of::<glob_t>() - 8usize];
    ["Offset of field: glob_t::gl_pathc"][::std::mem::offset_of!(glob_t, gl_pathc) - 0usize];
    ["Offset of field: glob_t::gl_pathv"][::std::mem::offset_of!(glob_t, gl_pathv) - 8usize];
    ["Offset of field: glob_t::gl_offs"][::std::mem::offset_of!(glob_t, gl_offs) - 16usize];
    ["Offset of field: glob_t::gl_flags"][::std::mem::offset_of!(glob_t, gl_flags) - 24usize];
    ["Offset of field: glob_t::gl_closedir"][::std::mem::offset_of!(glob_t, gl_closedir) - 32usize];
    ["Offset of field: glob_t::gl_readdir"][::std::mem::offset_of!(glob_t, gl_readdir) - 40usize];
    ["Offset of field: glob_t::gl_opendir"][::std::mem::offset_of!(glob_t, gl_opendir) - 48usize];
    ["Offset of field: glob_t::gl_lstat"][::std::mem::offset_of!(glob_t, gl_lstat) - 56usize];
    ["Offset of field: glob_t::gl_stat"][::std::mem::offset_of!(glob_t, gl_stat) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"][::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"][::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: __dev_t,
    pub st_ino: __ino_t,
    pub st_nlink: __nlink_t,
    pub st_mode: __mode_t,
    pub st_uid: __uid_t,
    pub st_gid: __gid_t,
    pub __pad0: ::std::os::raw::c_int,
    pub st_rdev: __dev_t,
    pub st_size: __off_t,
    pub st_blksize: __blksize_t,
    pub st_blocks: __blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __glibc_reserved: [__syscall_slong_t; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stat"][::std::mem::size_of::<stat>() - 144usize];
    ["Alignment of stat"][::std::mem::align_of::<stat>() - 8usize];
    ["Offset of field: stat::st_dev"][::std::mem::offset_of!(stat, st_dev) - 0usize];
    ["Offset of field: stat::st_ino"][::std::mem::offset_of!(stat, st_ino) - 8usize];
    ["Offset of field: stat::st_nlink"][::std::mem::offset_of!(stat, st_nlink) - 16usize];
    ["Offset of field: stat::st_mode"][::std::mem::offset_of!(stat, st_mode) - 24usize];
    ["Offset of field: stat::st_uid"][::std::mem::offset_of!(stat, st_uid) - 28usize];
    ["Offset of field: stat::st_gid"][::std::mem::offset_of!(stat, st_gid) - 32usize];
    ["Offset of field: stat::__pad0"][::std::mem::offset_of!(stat, __pad0) - 36usize];
    ["Offset of field: stat::st_rdev"][::std::mem::offset_of!(stat, st_rdev) - 40usize];
    ["Offset of field: stat::st_size"][::std::mem::offset_of!(stat, st_size) - 48usize];
    ["Offset of field: stat::st_blksize"][::std::mem::offset_of!(stat, st_blksize) - 56usize];
    ["Offset of field: stat::st_blocks"][::std::mem::offset_of!(stat, st_blocks) - 64usize];
    ["Offset of field: stat::st_atim"][::std::mem::offset_of!(stat, st_atim) - 72usize];
    ["Offset of field: stat::st_mtim"][::std::mem::offset_of!(stat, st_mtim) - 88usize];
    ["Offset of field: stat::st_ctim"][::std::mem::offset_of!(stat, st_ctim) - 104usize];
    ["Offset of field: stat::__glibc_reserved"]
        [::std::mem::offset_of!(stat, __glibc_reserved) - 120usize];
};
pub type __cpu_mask = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_set_t"][::std::mem::size_of::<cpu_set_t>() - 128usize];
    ["Alignment of cpu_set_t"][::std::mem::align_of::<cpu_set_t>() - 8usize];
    ["Offset of field: cpu_set_t::__bits"][::std::mem::offset_of!(cpu_set_t, __bits) - 0usize];
};
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr"][::std::mem::size_of::<sockaddr>() - 16usize];
    ["Alignment of sockaddr"][::std::mem::align_of::<sockaddr>() - 2usize];
    ["Offset of field: sockaddr::sa_family"][::std::mem::offset_of!(sockaddr, sa_family) - 0usize];
    ["Offset of field: sockaddr::sa_data"][::std::mem::offset_of!(sockaddr, sa_data) - 2usize];
};
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_addr"][::std::mem::size_of::<in_addr>() - 4usize];
    ["Alignment of in_addr"][::std::mem::align_of::<in_addr>() - 4usize];
    ["Offset of field: in_addr::s_addr"][::std::mem::offset_of!(in_addr, s_addr) - 0usize];
};
pub type in_port_t = u16;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr__bindgen_ty_1"][::std::mem::size_of::<in6_addr__bindgen_ty_1>() - 16usize];
    ["Alignment of in6_addr__bindgen_ty_1"]
        [::std::mem::align_of::<in6_addr__bindgen_ty_1>() - 4usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr8"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr8) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr16"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr16) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr32"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr32) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr"][::std::mem::size_of::<in6_addr>() - 16usize];
    ["Alignment of in6_addr"][::std::mem::align_of::<in6_addr>() - 4usize];
    ["Offset of field: in6_addr::__in6_u"][::std::mem::offset_of!(in6_addr, __in6_u) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in"][::std::mem::size_of::<sockaddr_in>() - 16usize];
    ["Alignment of sockaddr_in"][::std::mem::align_of::<sockaddr_in>() - 4usize];
    ["Offset of field: sockaddr_in::sin_family"]
        [::std::mem::offset_of!(sockaddr_in, sin_family) - 0usize];
    ["Offset of field: sockaddr_in::sin_port"]
        [::std::mem::offset_of!(sockaddr_in, sin_port) - 2usize];
    ["Offset of field: sockaddr_in::sin_addr"]
        [::std::mem::offset_of!(sockaddr_in, sin_addr) - 4usize];
    ["Offset of field: sockaddr_in::sin_zero"]
        [::std::mem::offset_of!(sockaddr_in, sin_zero) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in6"][::std::mem::size_of::<sockaddr_in6>() - 28usize];
    ["Alignment of sockaddr_in6"][::std::mem::align_of::<sockaddr_in6>() - 4usize];
    ["Offset of field: sockaddr_in6::sin6_family"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_family) - 0usize];
    ["Offset of field: sockaddr_in6::sin6_port"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_port) - 2usize];
    ["Offset of field: sockaddr_in6::sin6_flowinfo"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_flowinfo) - 4usize];
    ["Offset of field: sockaddr_in6::sin6_addr"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_addr) - 8usize];
    ["Offset of field: sockaddr_in6::sin6_scope_id"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_scope_id) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_un {
    pub sun_family: sa_family_t,
    pub sun_path: [::std::os::raw::c_char; 108usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_un"][::std::mem::size_of::<sockaddr_un>() - 110usize];
    ["Alignment of sockaddr_un"][::std::mem::align_of::<sockaddr_un>() - 2usize];
    ["Offset of field: sockaddr_un::sun_family"]
        [::std::mem::offset_of!(sockaddr_un, sun_family) - 0usize];
    ["Offset of field: sockaddr_un::sun_path"]
        [::std::mem::offset_of!(sockaddr_un, sun_path) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::std::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::std::mem::offset_of!(tm, tm_zone) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union sem_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sem_t"][::std::mem::size_of::<sem_t>() - 32usize];
    ["Alignment of sem_t"][::std::mem::align_of::<sem_t>() - 8usize];
    ["Offset of field: sem_t::__size"][::std::mem::offset_of!(sem_t, __size) - 0usize];
    ["Offset of field: sem_t::__align"][::std::mem::offset_of!(sem_t, __align) - 0usize];
};
pub type ngx_int_t = isize;
pub type ngx_uint_t = usize;
pub type ngx_flag_t = isize;
pub type ngx_module_t = ngx_module_s;
pub type ngx_conf_t = ngx_conf_s;
pub type ngx_cycle_t = ngx_cycle_s;
pub type ngx_pool_t = ngx_pool_s;
pub type ngx_chain_t = ngx_chain_s;
pub type ngx_log_t = ngx_log_s;
pub type ngx_open_file_t = ngx_open_file_s;
pub type ngx_command_t = ngx_command_s;
pub type ngx_file_t = ngx_file_s;
pub type ngx_event_t = ngx_event_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_event_aio_s {
    _unused: [u8; 0],
}
pub type ngx_event_aio_t = ngx_event_aio_s;
pub type ngx_connection_t = ngx_connection_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_thread_task_s {
    _unused: [u8; 0],
}
pub type ngx_thread_task_t = ngx_thread_task_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_ssl_s {
    _unused: [u8; 0],
}
pub type ngx_ssl_t = ngx_ssl_s;
pub type ngx_proxy_protocol_t = ngx_proxy_protocol_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_ssl_connection_s {
    _unused: [u8; 0],
}
pub type ngx_ssl_connection_t = ngx_ssl_connection_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_udp_connection_s {
    _unused: [u8; 0],
}
pub type ngx_udp_connection_t = ngx_udp_connection_s;
pub type ngx_event_handler_pt = ::std::option::Option<unsafe extern "C" fn(ev: *mut ngx_event_t)>;
pub type ngx_connection_handler_pt =
    ::std::option::Option<unsafe extern "C" fn(c: *mut ngx_connection_t)>;
pub type ngx_err_t = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn ngx_strerror(err: ngx_err_t, errstr: *mut u_char, size: usize) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_strerror_init() -> ngx_int_t;
}
pub type ngx_atomic_int_t = ::std::os::raw::c_long;
pub type ngx_atomic_uint_t = ::std::os::raw::c_ulong;
pub type ngx_atomic_t = ngx_atomic_uint_t;
unsafe extern "C" {
    pub fn ngx_spinlock(lock: *mut ngx_atomic_t, value: ngx_atomic_int_t, spin: ngx_uint_t);
}
pub type ngx_rbtree_key_t = ngx_uint_t;
pub type ngx_rbtree_key_int_t = ngx_int_t;
pub type ngx_rbtree_node_t = ngx_rbtree_node_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_rbtree_node_s {
    pub key: ngx_rbtree_key_t,
    pub left: *mut ngx_rbtree_node_t,
    pub right: *mut ngx_rbtree_node_t,
    pub parent: *mut ngx_rbtree_node_t,
    pub color: u_char,
    pub data: u_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_rbtree_node_s"][::std::mem::size_of::<ngx_rbtree_node_s>() - 40usize];
    ["Alignment of ngx_rbtree_node_s"][::std::mem::align_of::<ngx_rbtree_node_s>() - 8usize];
    ["Offset of field: ngx_rbtree_node_s::key"]
        [::std::mem::offset_of!(ngx_rbtree_node_s, key) - 0usize];
    ["Offset of field: ngx_rbtree_node_s::left"]
        [::std::mem::offset_of!(ngx_rbtree_node_s, left) - 8usize];
    ["Offset of field: ngx_rbtree_node_s::right"]
        [::std::mem::offset_of!(ngx_rbtree_node_s, right) - 16usize];
    ["Offset of field: ngx_rbtree_node_s::parent"]
        [::std::mem::offset_of!(ngx_rbtree_node_s, parent) - 24usize];
    ["Offset of field: ngx_rbtree_node_s::color"]
        [::std::mem::offset_of!(ngx_rbtree_node_s, color) - 32usize];
    ["Offset of field: ngx_rbtree_node_s::data"]
        [::std::mem::offset_of!(ngx_rbtree_node_s, data) - 33usize];
};
pub type ngx_rbtree_t = ngx_rbtree_s;
pub type ngx_rbtree_insert_pt = ::std::option::Option<
    unsafe extern "C" fn(
        root: *mut ngx_rbtree_node_t,
        node: *mut ngx_rbtree_node_t,
        sentinel: *mut ngx_rbtree_node_t,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_rbtree_s {
    pub root: *mut ngx_rbtree_node_t,
    pub sentinel: *mut ngx_rbtree_node_t,
    pub insert: ngx_rbtree_insert_pt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_rbtree_s"][::std::mem::size_of::<ngx_rbtree_s>() - 24usize];
    ["Alignment of ngx_rbtree_s"][::std::mem::align_of::<ngx_rbtree_s>() - 8usize];
    ["Offset of field: ngx_rbtree_s::root"][::std::mem::offset_of!(ngx_rbtree_s, root) - 0usize];
    ["Offset of field: ngx_rbtree_s::sentinel"]
        [::std::mem::offset_of!(ngx_rbtree_s, sentinel) - 8usize];
    ["Offset of field: ngx_rbtree_s::insert"]
        [::std::mem::offset_of!(ngx_rbtree_s, insert) - 16usize];
};
unsafe extern "C" {
    pub fn ngx_rbtree_insert(tree: *mut ngx_rbtree_t, node: *mut ngx_rbtree_node_t);
}
unsafe extern "C" {
    pub fn ngx_rbtree_delete(tree: *mut ngx_rbtree_t, node: *mut ngx_rbtree_node_t);
}
unsafe extern "C" {
    pub fn ngx_rbtree_insert_value(
        root: *mut ngx_rbtree_node_t,
        node: *mut ngx_rbtree_node_t,
        sentinel: *mut ngx_rbtree_node_t,
    );
}
unsafe extern "C" {
    pub fn ngx_rbtree_insert_timer_value(
        root: *mut ngx_rbtree_node_t,
        node: *mut ngx_rbtree_node_t,
        sentinel: *mut ngx_rbtree_node_t,
    );
}
unsafe extern "C" {
    pub fn ngx_rbtree_next(
        tree: *mut ngx_rbtree_t,
        node: *mut ngx_rbtree_node_t,
    ) -> *mut ngx_rbtree_node_t;
}
pub type ngx_msec_t = ngx_rbtree_key_t;
pub type ngx_msec_int_t = ngx_rbtree_key_int_t;
pub type ngx_tm_t = tm;
unsafe extern "C" {
    pub fn ngx_timezone_update();
}
unsafe extern "C" {
    pub fn ngx_localtime(s: time_t, tm: *mut ngx_tm_t);
}
unsafe extern "C" {
    pub fn ngx_libc_localtime(s: time_t, tm: *mut tm);
}
unsafe extern "C" {
    pub fn ngx_libc_gmtime(s: time_t, tm: *mut tm);
}
pub type ngx_socket_t = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn ngx_nonblocking(s: ngx_socket_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ngx_blocking(s: ngx_socket_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ngx_tcp_nopush(s: ngx_socket_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ngx_tcp_push(s: ngx_socket_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_str_t {
    pub len: usize,
    pub data: *mut u_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_str_t"][::std::mem::size_of::<ngx_str_t>() - 16usize];
    ["Alignment of ngx_str_t"][::std::mem::align_of::<ngx_str_t>() - 8usize];
    ["Offset of field: ngx_str_t::len"][::std::mem::offset_of!(ngx_str_t, len) - 0usize];
    ["Offset of field: ngx_str_t::data"][::std::mem::offset_of!(ngx_str_t, data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_keyval_t {
    pub key: ngx_str_t,
    pub value: ngx_str_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_keyval_t"][::std::mem::size_of::<ngx_keyval_t>() - 32usize];
    ["Alignment of ngx_keyval_t"][::std::mem::align_of::<ngx_keyval_t>() - 8usize];
    ["Offset of field: ngx_keyval_t::key"][::std::mem::offset_of!(ngx_keyval_t, key) - 0usize];
    ["Offset of field: ngx_keyval_t::value"][::std::mem::offset_of!(ngx_keyval_t, value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_variable_value_t {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub data: *mut u_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_variable_value_t"][::std::mem::size_of::<ngx_variable_value_t>() - 16usize];
    ["Alignment of ngx_variable_value_t"][::std::mem::align_of::<ngx_variable_value_t>() - 8usize];
    ["Offset of field: ngx_variable_value_t::data"]
        [::std::mem::offset_of!(ngx_variable_value_t, data) - 8usize];
};
impl ngx_variable_value_t {
    #[inline]
    pub fn len(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 28u8) as u32) }
    }
    #[inline]
    pub fn set_len(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 28u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn len_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                28u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_len_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                28u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn valid(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_valid(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn valid_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                28usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_valid_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn no_cacheable(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_no_cacheable(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn no_cacheable_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                29usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_no_cacheable_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                29usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn not_found(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_not_found(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn not_found_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                30usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_not_found_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn escape(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_escape(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn escape_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                31usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_escape_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        len: ::std::os::raw::c_uint,
        valid: ::std::os::raw::c_uint,
        no_cacheable: ::std::os::raw::c_uint,
        not_found: ::std::os::raw::c_uint,
        escape: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 28u8, {
            let len: u32 = unsafe { ::std::mem::transmute(len) };
            len as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let valid: u32 = unsafe { ::std::mem::transmute(valid) };
            valid as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let no_cacheable: u32 = unsafe { ::std::mem::transmute(no_cacheable) };
            no_cacheable as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let not_found: u32 = unsafe { ::std::mem::transmute(not_found) };
            not_found as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let escape: u32 = unsafe { ::std::mem::transmute(escape) };
            escape as u64
        });
        __bindgen_bitfield_unit
    }
}
unsafe extern "C" {
    pub fn ngx_strlow(dst: *mut u_char, src: *mut u_char, n: usize);
}
unsafe extern "C" {
    pub fn ngx_strnlen(p: *mut u_char, n: usize) -> usize;
}
unsafe extern "C" {
    pub fn ngx_explicit_memzero(buf: *mut ::std::os::raw::c_void, n: usize);
}
unsafe extern "C" {
    pub fn ngx_cpystrn(dst: *mut u_char, src: *mut u_char, n: usize) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_pstrdup(pool: *mut ngx_pool_t, src: *mut ngx_str_t) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_sprintf(buf: *mut u_char, fmt: *const ::std::os::raw::c_char, ...) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_snprintf(
        buf: *mut u_char,
        max: usize,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_slprintf(
        buf: *mut u_char,
        last: *mut u_char,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_vslprintf(
        buf: *mut u_char,
        last: *mut u_char,
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_strcasecmp(s1: *mut u_char, s2: *mut u_char) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_strncasecmp(s1: *mut u_char, s2: *mut u_char, n: usize) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_strnstr(s1: *mut u_char, s2: *mut ::std::os::raw::c_char, n: usize) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_strstrn(s1: *mut u_char, s2: *mut ::std::os::raw::c_char, n: usize) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_strcasestrn(
        s1: *mut u_char,
        s2: *mut ::std::os::raw::c_char,
        n: usize,
    ) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_strlcasestrn(
        s1: *mut u_char,
        last: *mut u_char,
        s2: *mut u_char,
        n: usize,
    ) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_rstrncmp(s1: *mut u_char, s2: *mut u_char, n: usize) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_rstrncasecmp(s1: *mut u_char, s2: *mut u_char, n: usize) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_memn2cmp(s1: *mut u_char, s2: *mut u_char, n1: usize, n2: usize) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_dns_strcmp(s1: *mut u_char, s2: *mut u_char) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_filename_cmp(s1: *mut u_char, s2: *mut u_char, n: usize) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_atoi(line: *mut u_char, n: usize) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_atofp(line: *mut u_char, n: usize, point: usize) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_atosz(line: *mut u_char, n: usize) -> isize;
}
unsafe extern "C" {
    pub fn ngx_atoof(line: *mut u_char, n: usize) -> off_t;
}
unsafe extern "C" {
    pub fn ngx_atotm(line: *mut u_char, n: usize) -> time_t;
}
unsafe extern "C" {
    pub fn ngx_hextoi(line: *mut u_char, n: usize) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_hex_dump(dst: *mut u_char, src: *mut u_char, len: usize) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_encode_base64(dst: *mut ngx_str_t, src: *mut ngx_str_t);
}
unsafe extern "C" {
    pub fn ngx_encode_base64url(dst: *mut ngx_str_t, src: *mut ngx_str_t);
}
unsafe extern "C" {
    pub fn ngx_decode_base64(dst: *mut ngx_str_t, src: *mut ngx_str_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_decode_base64url(dst: *mut ngx_str_t, src: *mut ngx_str_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_utf8_decode(p: *mut *mut u_char, n: usize) -> u32;
}
unsafe extern "C" {
    pub fn ngx_utf8_length(p: *mut u_char, n: usize) -> usize;
}
unsafe extern "C" {
    pub fn ngx_utf8_cpystrn(
        dst: *mut u_char,
        src: *mut u_char,
        n: usize,
        len: usize,
    ) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_escape_uri(
        dst: *mut u_char,
        src: *mut u_char,
        size: usize,
        type_: ngx_uint_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn ngx_unescape_uri(
        dst: *mut *mut u_char,
        src: *mut *mut u_char,
        size: usize,
        type_: ngx_uint_t,
    );
}
unsafe extern "C" {
    pub fn ngx_escape_html(dst: *mut u_char, src: *mut u_char, size: usize) -> usize;
}
unsafe extern "C" {
    pub fn ngx_escape_json(dst: *mut u_char, src: *mut u_char, size: usize) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_str_node_t {
    pub node: ngx_rbtree_node_t,
    pub str_: ngx_str_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_str_node_t"][::std::mem::size_of::<ngx_str_node_t>() - 56usize];
    ["Alignment of ngx_str_node_t"][::std::mem::align_of::<ngx_str_node_t>() - 8usize];
    ["Offset of field: ngx_str_node_t::node"]
        [::std::mem::offset_of!(ngx_str_node_t, node) - 0usize];
    ["Offset of field: ngx_str_node_t::str_"]
        [::std::mem::offset_of!(ngx_str_node_t, str_) - 40usize];
};
unsafe extern "C" {
    pub fn ngx_str_rbtree_insert_value(
        temp: *mut ngx_rbtree_node_t,
        node: *mut ngx_rbtree_node_t,
        sentinel: *mut ngx_rbtree_node_t,
    );
}
unsafe extern "C" {
    pub fn ngx_str_rbtree_lookup(
        rbtree: *mut ngx_rbtree_t,
        name: *mut ngx_str_t,
        hash: u32,
    ) -> *mut ngx_str_node_t;
}
unsafe extern "C" {
    pub fn ngx_sort(
        base: *mut ::std::os::raw::c_void,
        n: usize,
        size: usize,
        cmp: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ngx_int_t,
        >,
    );
}
pub type ngx_fd_t = ::std::os::raw::c_int;
pub type ngx_file_info_t = stat;
pub type ngx_file_uniq_t = ino_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_file_mapping_t {
    pub name: *mut u_char,
    pub size: usize,
    pub addr: *mut ::std::os::raw::c_void,
    pub fd: ngx_fd_t,
    pub log: *mut ngx_log_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_file_mapping_t"][::std::mem::size_of::<ngx_file_mapping_t>() - 40usize];
    ["Alignment of ngx_file_mapping_t"][::std::mem::align_of::<ngx_file_mapping_t>() - 8usize];
    ["Offset of field: ngx_file_mapping_t::name"]
        [::std::mem::offset_of!(ngx_file_mapping_t, name) - 0usize];
    ["Offset of field: ngx_file_mapping_t::size"]
        [::std::mem::offset_of!(ngx_file_mapping_t, size) - 8usize];
    ["Offset of field: ngx_file_mapping_t::addr"]
        [::std::mem::offset_of!(ngx_file_mapping_t, addr) - 16usize];
    ["Offset of field: ngx_file_mapping_t::fd"]
        [::std::mem::offset_of!(ngx_file_mapping_t, fd) - 24usize];
    ["Offset of field: ngx_file_mapping_t::log"]
        [::std::mem::offset_of!(ngx_file_mapping_t, log) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_dir_t {
    pub dir: *mut DIR,
    pub de: *mut dirent,
    pub info: stat,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: [u16; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_dir_t"][::std::mem::size_of::<ngx_dir_t>() - 168usize];
    ["Alignment of ngx_dir_t"][::std::mem::align_of::<ngx_dir_t>() - 8usize];
    ["Offset of field: ngx_dir_t::dir"][::std::mem::offset_of!(ngx_dir_t, dir) - 0usize];
    ["Offset of field: ngx_dir_t::de"][::std::mem::offset_of!(ngx_dir_t, de) - 8usize];
    ["Offset of field: ngx_dir_t::info"][::std::mem::offset_of!(ngx_dir_t, info) - 16usize];
};
impl ngx_dir_t {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn type__raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_type_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn valid_info(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_valid_info(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn valid_info_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_valid_info_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        valid_info: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let valid_info: u32 = unsafe { ::std::mem::transmute(valid_info) };
            valid_info as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_glob_t {
    pub n: usize,
    pub pglob: glob_t,
    pub pattern: *mut u_char,
    pub log: *mut ngx_log_t,
    pub test: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_glob_t"][::std::mem::size_of::<ngx_glob_t>() - 104usize];
    ["Alignment of ngx_glob_t"][::std::mem::align_of::<ngx_glob_t>() - 8usize];
    ["Offset of field: ngx_glob_t::n"][::std::mem::offset_of!(ngx_glob_t, n) - 0usize];
    ["Offset of field: ngx_glob_t::pglob"][::std::mem::offset_of!(ngx_glob_t, pglob) - 8usize];
    ["Offset of field: ngx_glob_t::pattern"][::std::mem::offset_of!(ngx_glob_t, pattern) - 80usize];
    ["Offset of field: ngx_glob_t::log"][::std::mem::offset_of!(ngx_glob_t, log) - 88usize];
    ["Offset of field: ngx_glob_t::test"][::std::mem::offset_of!(ngx_glob_t, test) - 96usize];
};
unsafe extern "C" {
    pub fn ngx_open_tempfile(
        name: *mut u_char,
        persistent: ngx_uint_t,
        access: ngx_uint_t,
    ) -> ngx_fd_t;
}
unsafe extern "C" {
    pub fn ngx_read_file(
        file: *mut ngx_file_t,
        buf: *mut u_char,
        size: usize,
        offset: off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn ngx_write_file(
        file: *mut ngx_file_t,
        buf: *mut u_char,
        size: usize,
        offset: off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn ngx_write_chain_to_file(
        file: *mut ngx_file_t,
        ce: *mut ngx_chain_t,
        offset: off_t,
        pool: *mut ngx_pool_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn ngx_set_file_time(name: *mut u_char, fd: ngx_fd_t, s: time_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_create_file_mapping(fm: *mut ngx_file_mapping_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_close_file_mapping(fm: *mut ngx_file_mapping_t);
}
unsafe extern "C" {
    pub fn ngx_open_dir(name: *mut ngx_str_t, dir: *mut ngx_dir_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_read_dir(dir: *mut ngx_dir_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_open_glob(gl: *mut ngx_glob_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_read_glob(gl: *mut ngx_glob_t, name: *mut ngx_str_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_close_glob(gl: *mut ngx_glob_t);
}
unsafe extern "C" {
    pub fn ngx_trylock_fd(fd: ngx_fd_t) -> ngx_err_t;
}
unsafe extern "C" {
    pub fn ngx_lock_fd(fd: ngx_fd_t) -> ngx_err_t;
}
unsafe extern "C" {
    pub fn ngx_unlock_fd(fd: ngx_fd_t) -> ngx_err_t;
}
unsafe extern "C" {
    pub fn ngx_read_ahead(fd: ngx_fd_t, n: usize) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_directio_on(fd: ngx_fd_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_directio_off(fd: ngx_fd_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_fs_bsize(name: *mut u_char) -> usize;
}
unsafe extern "C" {
    pub fn ngx_fs_available(name: *mut u_char) -> off_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_shm_t {
    pub addr: *mut u_char,
    pub size: usize,
    pub name: ngx_str_t,
    pub log: *mut ngx_log_t,
    pub exists: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_shm_t"][::std::mem::size_of::<ngx_shm_t>() - 48usize];
    ["Alignment of ngx_shm_t"][::std::mem::align_of::<ngx_shm_t>() - 8usize];
    ["Offset of field: ngx_shm_t::addr"][::std::mem::offset_of!(ngx_shm_t, addr) - 0usize];
    ["Offset of field: ngx_shm_t::size"][::std::mem::offset_of!(ngx_shm_t, size) - 8usize];
    ["Offset of field: ngx_shm_t::name"][::std::mem::offset_of!(ngx_shm_t, name) - 16usize];
    ["Offset of field: ngx_shm_t::log"][::std::mem::offset_of!(ngx_shm_t, log) - 32usize];
    ["Offset of field: ngx_shm_t::exists"][::std::mem::offset_of!(ngx_shm_t, exists) - 40usize];
};
unsafe extern "C" {
    pub fn ngx_shm_alloc(shm: *mut ngx_shm_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_shm_free(shm: *mut ngx_shm_t);
}
pub type ngx_cpuset_t = cpu_set_t;
unsafe extern "C" {
    pub fn ngx_setaffinity(cpu_affinity: *mut ngx_cpuset_t, log: *mut ngx_log_t);
}
unsafe extern "C" {
    pub fn ngx_init_setproctitle(log: *mut ngx_log_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_setproctitle(title: *mut ::std::os::raw::c_char);
}
pub type ngx_pid_t = pid_t;
pub type ngx_spawn_proc_pt = ::std::option::Option<
    unsafe extern "C" fn(cycle: *mut ngx_cycle_t, data: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_process_t {
    pub pid: ngx_pid_t,
    pub status: ::std::os::raw::c_int,
    pub channel: [ngx_socket_t; 2usize],
    pub proc_: ngx_spawn_proc_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub name: *mut ::std::os::raw::c_char,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_process_t"][::std::mem::size_of::<ngx_process_t>() - 48usize];
    ["Alignment of ngx_process_t"][::std::mem::align_of::<ngx_process_t>() - 8usize];
    ["Offset of field: ngx_process_t::pid"][::std::mem::offset_of!(ngx_process_t, pid) - 0usize];
    ["Offset of field: ngx_process_t::status"]
        [::std::mem::offset_of!(ngx_process_t, status) - 4usize];
    ["Offset of field: ngx_process_t::channel"]
        [::std::mem::offset_of!(ngx_process_t, channel) - 8usize];
    ["Offset of field: ngx_process_t::proc_"]
        [::std::mem::offset_of!(ngx_process_t, proc_) - 16usize];
    ["Offset of field: ngx_process_t::data"][::std::mem::offset_of!(ngx_process_t, data) - 24usize];
    ["Offset of field: ngx_process_t::name"][::std::mem::offset_of!(ngx_process_t, name) - 32usize];
};
impl ngx_process_t {
    #[inline]
    pub fn respawn(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_respawn(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn respawn_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_respawn_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn just_spawn(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_just_spawn(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn just_spawn_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_just_spawn_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn detached(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_detached(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn detached_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_detached_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn exiting(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_exiting(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn exiting_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_exiting_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn exited(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_exited(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn exited_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_exited_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        respawn: ::std::os::raw::c_uint,
        just_spawn: ::std::os::raw::c_uint,
        detached: ::std::os::raw::c_uint,
        exiting: ::std::os::raw::c_uint,
        exited: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let respawn: u32 = unsafe { ::std::mem::transmute(respawn) };
            respawn as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let just_spawn: u32 = unsafe { ::std::mem::transmute(just_spawn) };
            just_spawn as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let detached: u32 = unsafe { ::std::mem::transmute(detached) };
            detached as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let exiting: u32 = unsafe { ::std::mem::transmute(exiting) };
            exiting as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let exited: u32 = unsafe { ::std::mem::transmute(exited) };
            exited as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_exec_ctx_t {
    pub path: *mut ::std::os::raw::c_char,
    pub name: *mut ::std::os::raw::c_char,
    pub argv: *const *mut ::std::os::raw::c_char,
    pub envp: *const *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_exec_ctx_t"][::std::mem::size_of::<ngx_exec_ctx_t>() - 32usize];
    ["Alignment of ngx_exec_ctx_t"][::std::mem::align_of::<ngx_exec_ctx_t>() - 8usize];
    ["Offset of field: ngx_exec_ctx_t::path"]
        [::std::mem::offset_of!(ngx_exec_ctx_t, path) - 0usize];
    ["Offset of field: ngx_exec_ctx_t::name"]
        [::std::mem::offset_of!(ngx_exec_ctx_t, name) - 8usize];
    ["Offset of field: ngx_exec_ctx_t::argv"]
        [::std::mem::offset_of!(ngx_exec_ctx_t, argv) - 16usize];
    ["Offset of field: ngx_exec_ctx_t::envp"]
        [::std::mem::offset_of!(ngx_exec_ctx_t, envp) - 24usize];
};
unsafe extern "C" {
    pub fn ngx_spawn_process(
        cycle: *mut ngx_cycle_t,
        proc_: ngx_spawn_proc_pt,
        data: *mut ::std::os::raw::c_void,
        name: *mut ::std::os::raw::c_char,
        respawn: ngx_int_t,
    ) -> ngx_pid_t;
}
unsafe extern "C" {
    pub fn ngx_execute(cycle: *mut ngx_cycle_t, ctx: *mut ngx_exec_ctx_t) -> ngx_pid_t;
}
unsafe extern "C" {
    pub fn ngx_init_signals(log: *mut ngx_log_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_debug_point();
}
unsafe extern "C" {
    pub static mut ngx_argc: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut ngx_argv: *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut ngx_os_argv: *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut ngx_pid: ngx_pid_t;
}
unsafe extern "C" {
    pub static mut ngx_parent: ngx_pid_t;
}
unsafe extern "C" {
    pub static mut ngx_channel: ngx_socket_t;
}
unsafe extern "C" {
    pub static mut ngx_process_slot: ngx_int_t;
}
unsafe extern "C" {
    pub static mut ngx_last_process: ngx_int_t;
}
unsafe extern "C" {
    pub static mut ngx_processes: [ngx_process_t; 1024usize];
}
pub type ngx_uid_t = uid_t;
pub type ngx_gid_t = gid_t;
unsafe extern "C" {
    pub fn ngx_libc_crypt(
        pool: *mut ngx_pool_t,
        key: *mut u_char,
        salt: *mut u_char,
        encrypted: *mut *mut u_char,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_dlerror() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_parse_size(line: *mut ngx_str_t) -> isize;
}
unsafe extern "C" {
    pub fn ngx_parse_offset(line: *mut ngx_str_t) -> off_t;
}
unsafe extern "C" {
    pub fn ngx_parse_time(line: *mut ngx_str_t, is_sec: ngx_uint_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_parse_http_time(value: *mut u_char, len: usize) -> time_t;
}
pub type ngx_log_handler_pt = ::std::option::Option<
    unsafe extern "C" fn(log: *mut ngx_log_t, buf: *mut u_char, len: usize) -> *mut u_char,
>;
pub type ngx_log_writer_pt = ::std::option::Option<
    unsafe extern "C" fn(log: *mut ngx_log_t, level: ngx_uint_t, buf: *mut u_char, len: usize),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_log_s {
    pub log_level: ngx_uint_t,
    pub file: *mut ngx_open_file_t,
    pub connection: ngx_atomic_uint_t,
    pub disk_full_time: time_t,
    pub handler: ngx_log_handler_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub writer: ngx_log_writer_pt,
    pub wdata: *mut ::std::os::raw::c_void,
    pub action: *mut ::std::os::raw::c_char,
    pub next: *mut ngx_log_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_log_s"][::std::mem::size_of::<ngx_log_s>() - 80usize];
    ["Alignment of ngx_log_s"][::std::mem::align_of::<ngx_log_s>() - 8usize];
    ["Offset of field: ngx_log_s::log_level"]
        [::std::mem::offset_of!(ngx_log_s, log_level) - 0usize];
    ["Offset of field: ngx_log_s::file"][::std::mem::offset_of!(ngx_log_s, file) - 8usize];
    ["Offset of field: ngx_log_s::connection"]
        [::std::mem::offset_of!(ngx_log_s, connection) - 16usize];
    ["Offset of field: ngx_log_s::disk_full_time"]
        [::std::mem::offset_of!(ngx_log_s, disk_full_time) - 24usize];
    ["Offset of field: ngx_log_s::handler"][::std::mem::offset_of!(ngx_log_s, handler) - 32usize];
    ["Offset of field: ngx_log_s::data"][::std::mem::offset_of!(ngx_log_s, data) - 40usize];
    ["Offset of field: ngx_log_s::writer"][::std::mem::offset_of!(ngx_log_s, writer) - 48usize];
    ["Offset of field: ngx_log_s::wdata"][::std::mem::offset_of!(ngx_log_s, wdata) - 56usize];
    ["Offset of field: ngx_log_s::action"][::std::mem::offset_of!(ngx_log_s, action) - 64usize];
    ["Offset of field: ngx_log_s::next"][::std::mem::offset_of!(ngx_log_s, next) - 72usize];
};
unsafe extern "C" {
    pub fn ngx_log_error_core(
        level: ngx_uint_t,
        log: *mut ngx_log_t,
        err: ngx_err_t,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn ngx_log_init(prefix: *mut u_char) -> *mut ngx_log_t;
}
unsafe extern "C" {
    pub fn ngx_log_abort(err: ngx_err_t, fmt: *const ::std::os::raw::c_char, ...);
}
unsafe extern "C" {
    pub fn ngx_log_stderr(err: ngx_err_t, fmt: *const ::std::os::raw::c_char, ...);
}
unsafe extern "C" {
    pub fn ngx_log_errno(buf: *mut u_char, last: *mut u_char, err: ngx_err_t) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_log_open_default(cycle: *mut ngx_cycle_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_log_redirect_stderr(cycle: *mut ngx_cycle_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_log_get_file_log(head: *mut ngx_log_t) -> *mut ngx_log_t;
}
unsafe extern "C" {
    pub fn ngx_log_set_log(
        cf: *mut ngx_conf_t,
        head: *mut *mut ngx_log_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut ngx_errlog_module: ngx_module_t;
}
unsafe extern "C" {
    pub static mut ngx_use_stderr: ngx_uint_t;
}
unsafe extern "C" {
    pub fn ngx_alloc(size: usize, log: *mut ngx_log_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_calloc(size: usize, log: *mut ngx_log_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_memalign(
        alignment: usize,
        size: usize,
        log: *mut ngx_log_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub static mut ngx_pagesize: ngx_uint_t;
}
unsafe extern "C" {
    pub static mut ngx_pagesize_shift: ngx_uint_t;
}
unsafe extern "C" {
    pub static mut ngx_cacheline_size: ngx_uint_t;
}
pub type ngx_pool_cleanup_pt =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>;
pub type ngx_pool_cleanup_t = ngx_pool_cleanup_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_pool_cleanup_s {
    pub handler: ngx_pool_cleanup_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub next: *mut ngx_pool_cleanup_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_pool_cleanup_s"][::std::mem::size_of::<ngx_pool_cleanup_s>() - 24usize];
    ["Alignment of ngx_pool_cleanup_s"][::std::mem::align_of::<ngx_pool_cleanup_s>() - 8usize];
    ["Offset of field: ngx_pool_cleanup_s::handler"]
        [::std::mem::offset_of!(ngx_pool_cleanup_s, handler) - 0usize];
    ["Offset of field: ngx_pool_cleanup_s::data"]
        [::std::mem::offset_of!(ngx_pool_cleanup_s, data) - 8usize];
    ["Offset of field: ngx_pool_cleanup_s::next"]
        [::std::mem::offset_of!(ngx_pool_cleanup_s, next) - 16usize];
};
pub type ngx_pool_large_t = ngx_pool_large_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_pool_large_s {
    pub next: *mut ngx_pool_large_t,
    pub alloc: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_pool_large_s"][::std::mem::size_of::<ngx_pool_large_s>() - 16usize];
    ["Alignment of ngx_pool_large_s"][::std::mem::align_of::<ngx_pool_large_s>() - 8usize];
    ["Offset of field: ngx_pool_large_s::next"]
        [::std::mem::offset_of!(ngx_pool_large_s, next) - 0usize];
    ["Offset of field: ngx_pool_large_s::alloc"]
        [::std::mem::offset_of!(ngx_pool_large_s, alloc) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_pool_data_t {
    pub last: *mut u_char,
    pub end: *mut u_char,
    pub next: *mut ngx_pool_t,
    pub failed: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_pool_data_t"][::std::mem::size_of::<ngx_pool_data_t>() - 32usize];
    ["Alignment of ngx_pool_data_t"][::std::mem::align_of::<ngx_pool_data_t>() - 8usize];
    ["Offset of field: ngx_pool_data_t::last"]
        [::std::mem::offset_of!(ngx_pool_data_t, last) - 0usize];
    ["Offset of field: ngx_pool_data_t::end"]
        [::std::mem::offset_of!(ngx_pool_data_t, end) - 8usize];
    ["Offset of field: ngx_pool_data_t::next"]
        [::std::mem::offset_of!(ngx_pool_data_t, next) - 16usize];
    ["Offset of field: ngx_pool_data_t::failed"]
        [::std::mem::offset_of!(ngx_pool_data_t, failed) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_pool_s {
    pub d: ngx_pool_data_t,
    pub max: usize,
    pub current: *mut ngx_pool_t,
    pub chain: *mut ngx_chain_t,
    pub large: *mut ngx_pool_large_t,
    pub cleanup: *mut ngx_pool_cleanup_t,
    pub log: *mut ngx_log_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_pool_s"][::std::mem::size_of::<ngx_pool_s>() - 80usize];
    ["Alignment of ngx_pool_s"][::std::mem::align_of::<ngx_pool_s>() - 8usize];
    ["Offset of field: ngx_pool_s::d"][::std::mem::offset_of!(ngx_pool_s, d) - 0usize];
    ["Offset of field: ngx_pool_s::max"][::std::mem::offset_of!(ngx_pool_s, max) - 32usize];
    ["Offset of field: ngx_pool_s::current"][::std::mem::offset_of!(ngx_pool_s, current) - 40usize];
    ["Offset of field: ngx_pool_s::chain"][::std::mem::offset_of!(ngx_pool_s, chain) - 48usize];
    ["Offset of field: ngx_pool_s::large"][::std::mem::offset_of!(ngx_pool_s, large) - 56usize];
    ["Offset of field: ngx_pool_s::cleanup"][::std::mem::offset_of!(ngx_pool_s, cleanup) - 64usize];
    ["Offset of field: ngx_pool_s::log"][::std::mem::offset_of!(ngx_pool_s, log) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_pool_cleanup_file_t {
    pub fd: ngx_fd_t,
    pub name: *mut u_char,
    pub log: *mut ngx_log_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_pool_cleanup_file_t"][::std::mem::size_of::<ngx_pool_cleanup_file_t>() - 24usize];
    ["Alignment of ngx_pool_cleanup_file_t"]
        [::std::mem::align_of::<ngx_pool_cleanup_file_t>() - 8usize];
    ["Offset of field: ngx_pool_cleanup_file_t::fd"]
        [::std::mem::offset_of!(ngx_pool_cleanup_file_t, fd) - 0usize];
    ["Offset of field: ngx_pool_cleanup_file_t::name"]
        [::std::mem::offset_of!(ngx_pool_cleanup_file_t, name) - 8usize];
    ["Offset of field: ngx_pool_cleanup_file_t::log"]
        [::std::mem::offset_of!(ngx_pool_cleanup_file_t, log) - 16usize];
};
unsafe extern "C" {
    pub fn ngx_create_pool(size: usize, log: *mut ngx_log_t) -> *mut ngx_pool_t;
}
unsafe extern "C" {
    pub fn ngx_destroy_pool(pool: *mut ngx_pool_t);
}
unsafe extern "C" {
    pub fn ngx_reset_pool(pool: *mut ngx_pool_t);
}
unsafe extern "C" {
    pub fn ngx_palloc(pool: *mut ngx_pool_t, size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_pnalloc(pool: *mut ngx_pool_t, size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_pcalloc(pool: *mut ngx_pool_t, size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_pmemalign(
        pool: *mut ngx_pool_t,
        size: usize,
        alignment: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_pfree(pool: *mut ngx_pool_t, p: *mut ::std::os::raw::c_void) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_pool_cleanup_add(p: *mut ngx_pool_t, size: usize) -> *mut ngx_pool_cleanup_t;
}
unsafe extern "C" {
    pub fn ngx_pool_run_cleanup_file(p: *mut ngx_pool_t, fd: ngx_fd_t);
}
unsafe extern "C" {
    pub fn ngx_pool_cleanup_file(data: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn ngx_pool_delete_file(data: *mut ::std::os::raw::c_void);
}
pub type ngx_buf_tag_t = *mut ::std::os::raw::c_void;
pub type ngx_buf_t = ngx_buf_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_buf_s {
    pub pos: *mut u_char,
    pub last: *mut u_char,
    pub file_pos: off_t,
    pub file_last: off_t,
    pub start: *mut u_char,
    pub end: *mut u_char,
    pub tag: ngx_buf_tag_t,
    pub file: *mut ngx_file_t,
    pub shadow: *mut ngx_buf_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub num: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_buf_s"][::std::mem::size_of::<ngx_buf_s>() - 80usize];
    ["Alignment of ngx_buf_s"][::std::mem::align_of::<ngx_buf_s>() - 8usize];
    ["Offset of field: ngx_buf_s::pos"][::std::mem::offset_of!(ngx_buf_s, pos) - 0usize];
    ["Offset of field: ngx_buf_s::last"][::std::mem::offset_of!(ngx_buf_s, last) - 8usize];
    ["Offset of field: ngx_buf_s::file_pos"][::std::mem::offset_of!(ngx_buf_s, file_pos) - 16usize];
    ["Offset of field: ngx_buf_s::file_last"]
        [::std::mem::offset_of!(ngx_buf_s, file_last) - 24usize];
    ["Offset of field: ngx_buf_s::start"][::std::mem::offset_of!(ngx_buf_s, start) - 32usize];
    ["Offset of field: ngx_buf_s::end"][::std::mem::offset_of!(ngx_buf_s, end) - 40usize];
    ["Offset of field: ngx_buf_s::tag"][::std::mem::offset_of!(ngx_buf_s, tag) - 48usize];
    ["Offset of field: ngx_buf_s::file"][::std::mem::offset_of!(ngx_buf_s, file) - 56usize];
    ["Offset of field: ngx_buf_s::shadow"][::std::mem::offset_of!(ngx_buf_s, shadow) - 64usize];
    ["Offset of field: ngx_buf_s::num"][::std::mem::offset_of!(ngx_buf_s, num) - 76usize];
};
impl ngx_buf_s {
    #[inline]
    pub fn temporary(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_temporary(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn temporary_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_temporary_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn memory(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_memory(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn memory_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_memory_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mmap(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mmap(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mmap_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_mmap_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn recycled(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_recycled(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn recycled_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_recycled_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn in_file(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_in_file(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn in_file_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_in_file_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn flush(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_flush(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn flush_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_flush_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sync(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_sync(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sync_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_sync_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn last_buf(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_last_buf(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn last_buf_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_last_buf_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn last_in_chain(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_last_in_chain(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn last_in_chain_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_last_in_chain_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn last_shadow(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_last_shadow(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn last_shadow_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_last_shadow_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn temp_file(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_temp_file(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn temp_file_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_temp_file_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        temporary: ::std::os::raw::c_uint,
        memory: ::std::os::raw::c_uint,
        mmap: ::std::os::raw::c_uint,
        recycled: ::std::os::raw::c_uint,
        in_file: ::std::os::raw::c_uint,
        flush: ::std::os::raw::c_uint,
        sync: ::std::os::raw::c_uint,
        last_buf: ::std::os::raw::c_uint,
        last_in_chain: ::std::os::raw::c_uint,
        last_shadow: ::std::os::raw::c_uint,
        temp_file: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let temporary: u32 = unsafe { ::std::mem::transmute(temporary) };
            temporary as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let memory: u32 = unsafe { ::std::mem::transmute(memory) };
            memory as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let mmap: u32 = unsafe { ::std::mem::transmute(mmap) };
            mmap as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let recycled: u32 = unsafe { ::std::mem::transmute(recycled) };
            recycled as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let in_file: u32 = unsafe { ::std::mem::transmute(in_file) };
            in_file as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let flush: u32 = unsafe { ::std::mem::transmute(flush) };
            flush as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let sync: u32 = unsafe { ::std::mem::transmute(sync) };
            sync as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let last_buf: u32 = unsafe { ::std::mem::transmute(last_buf) };
            last_buf as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let last_in_chain: u32 = unsafe { ::std::mem::transmute(last_in_chain) };
            last_in_chain as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let last_shadow: u32 = unsafe { ::std::mem::transmute(last_shadow) };
            last_shadow as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let temp_file: u32 = unsafe { ::std::mem::transmute(temp_file) };
            temp_file as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_chain_s {
    pub buf: *mut ngx_buf_t,
    pub next: *mut ngx_chain_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_chain_s"][::std::mem::size_of::<ngx_chain_s>() - 16usize];
    ["Alignment of ngx_chain_s"][::std::mem::align_of::<ngx_chain_s>() - 8usize];
    ["Offset of field: ngx_chain_s::buf"][::std::mem::offset_of!(ngx_chain_s, buf) - 0usize];
    ["Offset of field: ngx_chain_s::next"][::std::mem::offset_of!(ngx_chain_s, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_bufs_t {
    pub num: ngx_int_t,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_bufs_t"][::std::mem::size_of::<ngx_bufs_t>() - 16usize];
    ["Alignment of ngx_bufs_t"][::std::mem::align_of::<ngx_bufs_t>() - 8usize];
    ["Offset of field: ngx_bufs_t::num"][::std::mem::offset_of!(ngx_bufs_t, num) - 0usize];
    ["Offset of field: ngx_bufs_t::size"][::std::mem::offset_of!(ngx_bufs_t, size) - 8usize];
};
pub type ngx_output_chain_ctx_t = ngx_output_chain_ctx_s;
pub type ngx_output_chain_filter_pt = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, in_: *mut ngx_chain_t) -> ngx_int_t,
>;
pub type ngx_output_chain_aio_pt = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut ngx_output_chain_ctx_t, file: *mut ngx_file_t),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_output_chain_ctx_s {
    pub buf: *mut ngx_buf_t,
    pub in_: *mut ngx_chain_t,
    pub free: *mut ngx_chain_t,
    pub busy: *mut ngx_chain_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub alignment: off_t,
    pub pool: *mut ngx_pool_t,
    pub allocated: ngx_int_t,
    pub bufs: ngx_bufs_t,
    pub tag: ngx_buf_tag_t,
    pub output_filter: ngx_output_chain_filter_pt,
    pub filter_ctx: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_output_chain_ctx_s"][::std::mem::size_of::<ngx_output_chain_ctx_s>() - 104usize];
    ["Alignment of ngx_output_chain_ctx_s"]
        [::std::mem::align_of::<ngx_output_chain_ctx_s>() - 8usize];
    ["Offset of field: ngx_output_chain_ctx_s::buf"]
        [::std::mem::offset_of!(ngx_output_chain_ctx_s, buf) - 0usize];
    ["Offset of field: ngx_output_chain_ctx_s::in_"]
        [::std::mem::offset_of!(ngx_output_chain_ctx_s, in_) - 8usize];
    ["Offset of field: ngx_output_chain_ctx_s::free"]
        [::std::mem::offset_of!(ngx_output_chain_ctx_s, free) - 16usize];
    ["Offset of field: ngx_output_chain_ctx_s::busy"]
        [::std::mem::offset_of!(ngx_output_chain_ctx_s, busy) - 24usize];
    ["Offset of field: ngx_output_chain_ctx_s::alignment"]
        [::std::mem::offset_of!(ngx_output_chain_ctx_s, alignment) - 40usize];
    ["Offset of field: ngx_output_chain_ctx_s::pool"]
        [::std::mem::offset_of!(ngx_output_chain_ctx_s, pool) - 48usize];
    ["Offset of field: ngx_output_chain_ctx_s::allocated"]
        [::std::mem::offset_of!(ngx_output_chain_ctx_s, allocated) - 56usize];
    ["Offset of field: ngx_output_chain_ctx_s::bufs"]
        [::std::mem::offset_of!(ngx_output_chain_ctx_s, bufs) - 64usize];
    ["Offset of field: ngx_output_chain_ctx_s::tag"]
        [::std::mem::offset_of!(ngx_output_chain_ctx_s, tag) - 80usize];
    ["Offset of field: ngx_output_chain_ctx_s::output_filter"]
        [::std::mem::offset_of!(ngx_output_chain_ctx_s, output_filter) - 88usize];
    ["Offset of field: ngx_output_chain_ctx_s::filter_ctx"]
        [::std::mem::offset_of!(ngx_output_chain_ctx_s, filter_ctx) - 96usize];
};
impl ngx_output_chain_ctx_s {
    #[inline]
    pub fn sendfile(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_sendfile(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sendfile_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_sendfile_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn directio(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_directio(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn directio_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_directio_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn unaligned(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_unaligned(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn unaligned_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_unaligned_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn need_in_memory(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_need_in_memory(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn need_in_memory_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_need_in_memory_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn need_in_temp(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_need_in_temp(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn need_in_temp_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_need_in_temp_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn aio(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_aio(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn aio_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_aio_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        sendfile: ::std::os::raw::c_uint,
        directio: ::std::os::raw::c_uint,
        unaligned: ::std::os::raw::c_uint,
        need_in_memory: ::std::os::raw::c_uint,
        need_in_temp: ::std::os::raw::c_uint,
        aio: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let sendfile: u32 = unsafe { ::std::mem::transmute(sendfile) };
            sendfile as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let directio: u32 = unsafe { ::std::mem::transmute(directio) };
            directio as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let unaligned: u32 = unsafe { ::std::mem::transmute(unaligned) };
            unaligned as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let need_in_memory: u32 = unsafe { ::std::mem::transmute(need_in_memory) };
            need_in_memory as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let need_in_temp: u32 = unsafe { ::std::mem::transmute(need_in_temp) };
            need_in_temp as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let aio: u32 = unsafe { ::std::mem::transmute(aio) };
            aio as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_chain_writer_ctx_t {
    pub out: *mut ngx_chain_t,
    pub last: *mut *mut ngx_chain_t,
    pub connection: *mut ngx_connection_t,
    pub pool: *mut ngx_pool_t,
    pub limit: off_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_chain_writer_ctx_t"][::std::mem::size_of::<ngx_chain_writer_ctx_t>() - 40usize];
    ["Alignment of ngx_chain_writer_ctx_t"]
        [::std::mem::align_of::<ngx_chain_writer_ctx_t>() - 8usize];
    ["Offset of field: ngx_chain_writer_ctx_t::out"]
        [::std::mem::offset_of!(ngx_chain_writer_ctx_t, out) - 0usize];
    ["Offset of field: ngx_chain_writer_ctx_t::last"]
        [::std::mem::offset_of!(ngx_chain_writer_ctx_t, last) - 8usize];
    ["Offset of field: ngx_chain_writer_ctx_t::connection"]
        [::std::mem::offset_of!(ngx_chain_writer_ctx_t, connection) - 16usize];
    ["Offset of field: ngx_chain_writer_ctx_t::pool"]
        [::std::mem::offset_of!(ngx_chain_writer_ctx_t, pool) - 24usize];
    ["Offset of field: ngx_chain_writer_ctx_t::limit"]
        [::std::mem::offset_of!(ngx_chain_writer_ctx_t, limit) - 32usize];
};
unsafe extern "C" {
    pub fn ngx_create_temp_buf(pool: *mut ngx_pool_t, size: usize) -> *mut ngx_buf_t;
}
unsafe extern "C" {
    pub fn ngx_create_chain_of_bufs(
        pool: *mut ngx_pool_t,
        bufs: *mut ngx_bufs_t,
    ) -> *mut ngx_chain_t;
}
unsafe extern "C" {
    pub fn ngx_alloc_chain_link(pool: *mut ngx_pool_t) -> *mut ngx_chain_t;
}
unsafe extern "C" {
    pub fn ngx_output_chain(ctx: *mut ngx_output_chain_ctx_t, in_: *mut ngx_chain_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_chain_writer(ctx: *mut ::std::os::raw::c_void, in_: *mut ngx_chain_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_chain_add_copy(
        pool: *mut ngx_pool_t,
        chain: *mut *mut ngx_chain_t,
        in_: *mut ngx_chain_t,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_chain_get_free_buf(
        p: *mut ngx_pool_t,
        free: *mut *mut ngx_chain_t,
    ) -> *mut ngx_chain_t;
}
unsafe extern "C" {
    pub fn ngx_chain_update_chains(
        p: *mut ngx_pool_t,
        free: *mut *mut ngx_chain_t,
        busy: *mut *mut ngx_chain_t,
        out: *mut *mut ngx_chain_t,
        tag: ngx_buf_tag_t,
    );
}
unsafe extern "C" {
    pub fn ngx_chain_coalesce_file(in_: *mut *mut ngx_chain_t, limit: off_t) -> off_t;
}
unsafe extern "C" {
    pub fn ngx_chain_update_sent(in_: *mut ngx_chain_t, sent: off_t) -> *mut ngx_chain_t;
}
pub type ngx_queue_t = ngx_queue_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_queue_s {
    pub prev: *mut ngx_queue_t,
    pub next: *mut ngx_queue_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_queue_s"][::std::mem::size_of::<ngx_queue_s>() - 16usize];
    ["Alignment of ngx_queue_s"][::std::mem::align_of::<ngx_queue_s>() - 8usize];
    ["Offset of field: ngx_queue_s::prev"][::std::mem::offset_of!(ngx_queue_s, prev) - 0usize];
    ["Offset of field: ngx_queue_s::next"][::std::mem::offset_of!(ngx_queue_s, next) - 8usize];
};
unsafe extern "C" {
    pub fn ngx_queue_middle(queue: *mut ngx_queue_t) -> *mut ngx_queue_t;
}
unsafe extern "C" {
    pub fn ngx_queue_sort(
        queue: *mut ngx_queue_t,
        cmp: ::std::option::Option<
            unsafe extern "C" fn(arg1: *const ngx_queue_t, arg2: *const ngx_queue_t) -> ngx_int_t,
        >,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_array_t {
    pub elts: *mut ::std::os::raw::c_void,
    pub nelts: ngx_uint_t,
    pub size: usize,
    pub nalloc: ngx_uint_t,
    pub pool: *mut ngx_pool_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_array_t"][::std::mem::size_of::<ngx_array_t>() - 40usize];
    ["Alignment of ngx_array_t"][::std::mem::align_of::<ngx_array_t>() - 8usize];
    ["Offset of field: ngx_array_t::elts"][::std::mem::offset_of!(ngx_array_t, elts) - 0usize];
    ["Offset of field: ngx_array_t::nelts"][::std::mem::offset_of!(ngx_array_t, nelts) - 8usize];
    ["Offset of field: ngx_array_t::size"][::std::mem::offset_of!(ngx_array_t, size) - 16usize];
    ["Offset of field: ngx_array_t::nalloc"][::std::mem::offset_of!(ngx_array_t, nalloc) - 24usize];
    ["Offset of field: ngx_array_t::pool"][::std::mem::offset_of!(ngx_array_t, pool) - 32usize];
};
unsafe extern "C" {
    pub fn ngx_array_create(p: *mut ngx_pool_t, n: ngx_uint_t, size: usize) -> *mut ngx_array_t;
}
unsafe extern "C" {
    pub fn ngx_array_destroy(a: *mut ngx_array_t);
}
unsafe extern "C" {
    pub fn ngx_array_push(a: *mut ngx_array_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_array_push_n(a: *mut ngx_array_t, n: ngx_uint_t) -> *mut ::std::os::raw::c_void;
}
pub type ngx_list_part_t = ngx_list_part_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_list_part_s {
    pub elts: *mut ::std::os::raw::c_void,
    pub nelts: ngx_uint_t,
    pub next: *mut ngx_list_part_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_list_part_s"][::std::mem::size_of::<ngx_list_part_s>() - 24usize];
    ["Alignment of ngx_list_part_s"][::std::mem::align_of::<ngx_list_part_s>() - 8usize];
    ["Offset of field: ngx_list_part_s::elts"]
        [::std::mem::offset_of!(ngx_list_part_s, elts) - 0usize];
    ["Offset of field: ngx_list_part_s::nelts"]
        [::std::mem::offset_of!(ngx_list_part_s, nelts) - 8usize];
    ["Offset of field: ngx_list_part_s::next"]
        [::std::mem::offset_of!(ngx_list_part_s, next) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_list_t {
    pub last: *mut ngx_list_part_t,
    pub part: ngx_list_part_t,
    pub size: usize,
    pub nalloc: ngx_uint_t,
    pub pool: *mut ngx_pool_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_list_t"][::std::mem::size_of::<ngx_list_t>() - 56usize];
    ["Alignment of ngx_list_t"][::std::mem::align_of::<ngx_list_t>() - 8usize];
    ["Offset of field: ngx_list_t::last"][::std::mem::offset_of!(ngx_list_t, last) - 0usize];
    ["Offset of field: ngx_list_t::part"][::std::mem::offset_of!(ngx_list_t, part) - 8usize];
    ["Offset of field: ngx_list_t::size"][::std::mem::offset_of!(ngx_list_t, size) - 32usize];
    ["Offset of field: ngx_list_t::nalloc"][::std::mem::offset_of!(ngx_list_t, nalloc) - 40usize];
    ["Offset of field: ngx_list_t::pool"][::std::mem::offset_of!(ngx_list_t, pool) - 48usize];
};
unsafe extern "C" {
    pub fn ngx_list_create(pool: *mut ngx_pool_t, n: ngx_uint_t, size: usize) -> *mut ngx_list_t;
}
unsafe extern "C" {
    pub fn ngx_list_push(list: *mut ngx_list_t) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_elt_t {
    pub value: *mut ::std::os::raw::c_void,
    pub len: u_short,
    pub name: [u_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_hash_elt_t"][::std::mem::size_of::<ngx_hash_elt_t>() - 16usize];
    ["Alignment of ngx_hash_elt_t"][::std::mem::align_of::<ngx_hash_elt_t>() - 8usize];
    ["Offset of field: ngx_hash_elt_t::value"]
        [::std::mem::offset_of!(ngx_hash_elt_t, value) - 0usize];
    ["Offset of field: ngx_hash_elt_t::len"][::std::mem::offset_of!(ngx_hash_elt_t, len) - 8usize];
    ["Offset of field: ngx_hash_elt_t::name"]
        [::std::mem::offset_of!(ngx_hash_elt_t, name) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_t {
    pub buckets: *mut *mut ngx_hash_elt_t,
    pub size: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_hash_t"][::std::mem::size_of::<ngx_hash_t>() - 16usize];
    ["Alignment of ngx_hash_t"][::std::mem::align_of::<ngx_hash_t>() - 8usize];
    ["Offset of field: ngx_hash_t::buckets"][::std::mem::offset_of!(ngx_hash_t, buckets) - 0usize];
    ["Offset of field: ngx_hash_t::size"][::std::mem::offset_of!(ngx_hash_t, size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_wildcard_t {
    pub hash: ngx_hash_t,
    pub value: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_hash_wildcard_t"][::std::mem::size_of::<ngx_hash_wildcard_t>() - 24usize];
    ["Alignment of ngx_hash_wildcard_t"][::std::mem::align_of::<ngx_hash_wildcard_t>() - 8usize];
    ["Offset of field: ngx_hash_wildcard_t::hash"]
        [::std::mem::offset_of!(ngx_hash_wildcard_t, hash) - 0usize];
    ["Offset of field: ngx_hash_wildcard_t::value"]
        [::std::mem::offset_of!(ngx_hash_wildcard_t, value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_key_t {
    pub key: ngx_str_t,
    pub key_hash: ngx_uint_t,
    pub value: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_hash_key_t"][::std::mem::size_of::<ngx_hash_key_t>() - 32usize];
    ["Alignment of ngx_hash_key_t"][::std::mem::align_of::<ngx_hash_key_t>() - 8usize];
    ["Offset of field: ngx_hash_key_t::key"][::std::mem::offset_of!(ngx_hash_key_t, key) - 0usize];
    ["Offset of field: ngx_hash_key_t::key_hash"]
        [::std::mem::offset_of!(ngx_hash_key_t, key_hash) - 16usize];
    ["Offset of field: ngx_hash_key_t::value"]
        [::std::mem::offset_of!(ngx_hash_key_t, value) - 24usize];
};
pub type ngx_hash_key_pt =
    ::std::option::Option<unsafe extern "C" fn(data: *mut u_char, len: usize) -> ngx_uint_t>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_combined_t {
    pub hash: ngx_hash_t,
    pub wc_head: *mut ngx_hash_wildcard_t,
    pub wc_tail: *mut ngx_hash_wildcard_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_hash_combined_t"][::std::mem::size_of::<ngx_hash_combined_t>() - 32usize];
    ["Alignment of ngx_hash_combined_t"][::std::mem::align_of::<ngx_hash_combined_t>() - 8usize];
    ["Offset of field: ngx_hash_combined_t::hash"]
        [::std::mem::offset_of!(ngx_hash_combined_t, hash) - 0usize];
    ["Offset of field: ngx_hash_combined_t::wc_head"]
        [::std::mem::offset_of!(ngx_hash_combined_t, wc_head) - 16usize];
    ["Offset of field: ngx_hash_combined_t::wc_tail"]
        [::std::mem::offset_of!(ngx_hash_combined_t, wc_tail) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_init_t {
    pub hash: *mut ngx_hash_t,
    pub key: ngx_hash_key_pt,
    pub max_size: ngx_uint_t,
    pub bucket_size: ngx_uint_t,
    pub name: *mut ::std::os::raw::c_char,
    pub pool: *mut ngx_pool_t,
    pub temp_pool: *mut ngx_pool_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_hash_init_t"][::std::mem::size_of::<ngx_hash_init_t>() - 56usize];
    ["Alignment of ngx_hash_init_t"][::std::mem::align_of::<ngx_hash_init_t>() - 8usize];
    ["Offset of field: ngx_hash_init_t::hash"]
        [::std::mem::offset_of!(ngx_hash_init_t, hash) - 0usize];
    ["Offset of field: ngx_hash_init_t::key"]
        [::std::mem::offset_of!(ngx_hash_init_t, key) - 8usize];
    ["Offset of field: ngx_hash_init_t::max_size"]
        [::std::mem::offset_of!(ngx_hash_init_t, max_size) - 16usize];
    ["Offset of field: ngx_hash_init_t::bucket_size"]
        [::std::mem::offset_of!(ngx_hash_init_t, bucket_size) - 24usize];
    ["Offset of field: ngx_hash_init_t::name"]
        [::std::mem::offset_of!(ngx_hash_init_t, name) - 32usize];
    ["Offset of field: ngx_hash_init_t::pool"]
        [::std::mem::offset_of!(ngx_hash_init_t, pool) - 40usize];
    ["Offset of field: ngx_hash_init_t::temp_pool"]
        [::std::mem::offset_of!(ngx_hash_init_t, temp_pool) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_keys_arrays_t {
    pub hsize: ngx_uint_t,
    pub pool: *mut ngx_pool_t,
    pub temp_pool: *mut ngx_pool_t,
    pub keys: ngx_array_t,
    pub keys_hash: *mut ngx_array_t,
    pub dns_wc_head: ngx_array_t,
    pub dns_wc_head_hash: *mut ngx_array_t,
    pub dns_wc_tail: ngx_array_t,
    pub dns_wc_tail_hash: *mut ngx_array_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_hash_keys_arrays_t"][::std::mem::size_of::<ngx_hash_keys_arrays_t>() - 168usize];
    ["Alignment of ngx_hash_keys_arrays_t"]
        [::std::mem::align_of::<ngx_hash_keys_arrays_t>() - 8usize];
    ["Offset of field: ngx_hash_keys_arrays_t::hsize"]
        [::std::mem::offset_of!(ngx_hash_keys_arrays_t, hsize) - 0usize];
    ["Offset of field: ngx_hash_keys_arrays_t::pool"]
        [::std::mem::offset_of!(ngx_hash_keys_arrays_t, pool) - 8usize];
    ["Offset of field: ngx_hash_keys_arrays_t::temp_pool"]
        [::std::mem::offset_of!(ngx_hash_keys_arrays_t, temp_pool) - 16usize];
    ["Offset of field: ngx_hash_keys_arrays_t::keys"]
        [::std::mem::offset_of!(ngx_hash_keys_arrays_t, keys) - 24usize];
    ["Offset of field: ngx_hash_keys_arrays_t::keys_hash"]
        [::std::mem::offset_of!(ngx_hash_keys_arrays_t, keys_hash) - 64usize];
    ["Offset of field: ngx_hash_keys_arrays_t::dns_wc_head"]
        [::std::mem::offset_of!(ngx_hash_keys_arrays_t, dns_wc_head) - 72usize];
    ["Offset of field: ngx_hash_keys_arrays_t::dns_wc_head_hash"]
        [::std::mem::offset_of!(ngx_hash_keys_arrays_t, dns_wc_head_hash) - 112usize];
    ["Offset of field: ngx_hash_keys_arrays_t::dns_wc_tail"]
        [::std::mem::offset_of!(ngx_hash_keys_arrays_t, dns_wc_tail) - 120usize];
    ["Offset of field: ngx_hash_keys_arrays_t::dns_wc_tail_hash"]
        [::std::mem::offset_of!(ngx_hash_keys_arrays_t, dns_wc_tail_hash) - 160usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_table_elt_t {
    pub hash: ngx_uint_t,
    pub key: ngx_str_t,
    pub value: ngx_str_t,
    pub lowcase_key: *mut u_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_table_elt_t"][::std::mem::size_of::<ngx_table_elt_t>() - 48usize];
    ["Alignment of ngx_table_elt_t"][::std::mem::align_of::<ngx_table_elt_t>() - 8usize];
    ["Offset of field: ngx_table_elt_t::hash"]
        [::std::mem::offset_of!(ngx_table_elt_t, hash) - 0usize];
    ["Offset of field: ngx_table_elt_t::key"]
        [::std::mem::offset_of!(ngx_table_elt_t, key) - 8usize];
    ["Offset of field: ngx_table_elt_t::value"]
        [::std::mem::offset_of!(ngx_table_elt_t, value) - 24usize];
    ["Offset of field: ngx_table_elt_t::lowcase_key"]
        [::std::mem::offset_of!(ngx_table_elt_t, lowcase_key) - 40usize];
};
unsafe extern "C" {
    pub fn ngx_hash_find(
        hash: *mut ngx_hash_t,
        key: ngx_uint_t,
        name: *mut u_char,
        len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_hash_find_wc_head(
        hwc: *mut ngx_hash_wildcard_t,
        name: *mut u_char,
        len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_hash_find_wc_tail(
        hwc: *mut ngx_hash_wildcard_t,
        name: *mut u_char,
        len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_hash_find_combined(
        hash: *mut ngx_hash_combined_t,
        key: ngx_uint_t,
        name: *mut u_char,
        len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_hash_init(
        hinit: *mut ngx_hash_init_t,
        names: *mut ngx_hash_key_t,
        nelts: ngx_uint_t,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_hash_wildcard_init(
        hinit: *mut ngx_hash_init_t,
        names: *mut ngx_hash_key_t,
        nelts: ngx_uint_t,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_hash_key(data: *mut u_char, len: usize) -> ngx_uint_t;
}
unsafe extern "C" {
    pub fn ngx_hash_key_lc(data: *mut u_char, len: usize) -> ngx_uint_t;
}
unsafe extern "C" {
    pub fn ngx_hash_strlow(dst: *mut u_char, src: *mut u_char, n: usize) -> ngx_uint_t;
}
unsafe extern "C" {
    pub fn ngx_hash_keys_array_init(
        ha: *mut ngx_hash_keys_arrays_t,
        type_: ngx_uint_t,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_hash_add_key(
        ha: *mut ngx_hash_keys_arrays_t,
        key: *mut ngx_str_t,
        value: *mut ::std::os::raw::c_void,
        flags: ngx_uint_t,
    ) -> ngx_int_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_file_s {
    pub fd: ngx_fd_t,
    pub name: ngx_str_t,
    pub info: ngx_file_info_t,
    pub offset: off_t,
    pub sys_offset: off_t,
    pub log: *mut ngx_log_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_file_s"][::std::mem::size_of::<ngx_file_s>() - 200usize];
    ["Alignment of ngx_file_s"][::std::mem::align_of::<ngx_file_s>() - 8usize];
    ["Offset of field: ngx_file_s::fd"][::std::mem::offset_of!(ngx_file_s, fd) - 0usize];
    ["Offset of field: ngx_file_s::name"][::std::mem::offset_of!(ngx_file_s, name) - 8usize];
    ["Offset of field: ngx_file_s::info"][::std::mem::offset_of!(ngx_file_s, info) - 24usize];
    ["Offset of field: ngx_file_s::offset"][::std::mem::offset_of!(ngx_file_s, offset) - 168usize];
    ["Offset of field: ngx_file_s::sys_offset"]
        [::std::mem::offset_of!(ngx_file_s, sys_offset) - 176usize];
    ["Offset of field: ngx_file_s::log"][::std::mem::offset_of!(ngx_file_s, log) - 184usize];
};
impl ngx_file_s {
    #[inline]
    pub fn valid_info(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_valid_info(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn valid_info_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_valid_info_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn directio(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_directio(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn directio_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_directio_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        valid_info: ::std::os::raw::c_uint,
        directio: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let valid_info: u32 = unsafe { ::std::mem::transmute(valid_info) };
            valid_info as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let directio: u32 = unsafe { ::std::mem::transmute(directio) };
            directio as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type ngx_path_manager_pt =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> ngx_msec_t>;
pub type ngx_path_purger_pt =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> ngx_msec_t>;
pub type ngx_path_loader_pt =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_path_t {
    pub name: ngx_str_t,
    pub len: usize,
    pub level: [usize; 3usize],
    pub manager: ngx_path_manager_pt,
    pub purger: ngx_path_purger_pt,
    pub loader: ngx_path_loader_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub conf_file: *mut u_char,
    pub line: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_path_t"][::std::mem::size_of::<ngx_path_t>() - 96usize];
    ["Alignment of ngx_path_t"][::std::mem::align_of::<ngx_path_t>() - 8usize];
    ["Offset of field: ngx_path_t::name"][::std::mem::offset_of!(ngx_path_t, name) - 0usize];
    ["Offset of field: ngx_path_t::len"][::std::mem::offset_of!(ngx_path_t, len) - 16usize];
    ["Offset of field: ngx_path_t::level"][::std::mem::offset_of!(ngx_path_t, level) - 24usize];
    ["Offset of field: ngx_path_t::manager"][::std::mem::offset_of!(ngx_path_t, manager) - 48usize];
    ["Offset of field: ngx_path_t::purger"][::std::mem::offset_of!(ngx_path_t, purger) - 56usize];
    ["Offset of field: ngx_path_t::loader"][::std::mem::offset_of!(ngx_path_t, loader) - 64usize];
    ["Offset of field: ngx_path_t::data"][::std::mem::offset_of!(ngx_path_t, data) - 72usize];
    ["Offset of field: ngx_path_t::conf_file"]
        [::std::mem::offset_of!(ngx_path_t, conf_file) - 80usize];
    ["Offset of field: ngx_path_t::line"][::std::mem::offset_of!(ngx_path_t, line) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_path_init_t {
    pub name: ngx_str_t,
    pub level: [usize; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_path_init_t"][::std::mem::size_of::<ngx_path_init_t>() - 40usize];
    ["Alignment of ngx_path_init_t"][::std::mem::align_of::<ngx_path_init_t>() - 8usize];
    ["Offset of field: ngx_path_init_t::name"]
        [::std::mem::offset_of!(ngx_path_init_t, name) - 0usize];
    ["Offset of field: ngx_path_init_t::level"]
        [::std::mem::offset_of!(ngx_path_init_t, level) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_temp_file_t {
    pub file: ngx_file_t,
    pub offset: off_t,
    pub path: *mut ngx_path_t,
    pub pool: *mut ngx_pool_t,
    pub warn: *mut ::std::os::raw::c_char,
    pub access: ngx_uint_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: [u16; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_temp_file_t"][::std::mem::size_of::<ngx_temp_file_t>() - 248usize];
    ["Alignment of ngx_temp_file_t"][::std::mem::align_of::<ngx_temp_file_t>() - 8usize];
    ["Offset of field: ngx_temp_file_t::file"]
        [::std::mem::offset_of!(ngx_temp_file_t, file) - 0usize];
    ["Offset of field: ngx_temp_file_t::offset"]
        [::std::mem::offset_of!(ngx_temp_file_t, offset) - 200usize];
    ["Offset of field: ngx_temp_file_t::path"]
        [::std::mem::offset_of!(ngx_temp_file_t, path) - 208usize];
    ["Offset of field: ngx_temp_file_t::pool"]
        [::std::mem::offset_of!(ngx_temp_file_t, pool) - 216usize];
    ["Offset of field: ngx_temp_file_t::warn"]
        [::std::mem::offset_of!(ngx_temp_file_t, warn) - 224usize];
    ["Offset of field: ngx_temp_file_t::access"]
        [::std::mem::offset_of!(ngx_temp_file_t, access) - 232usize];
};
impl ngx_temp_file_t {
    #[inline]
    pub fn log_level(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_log_level(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn log_level_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_log_level_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn persistent(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_persistent(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn persistent_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_persistent_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn clean(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_clean(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn clean_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_clean_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn thread_write(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_thread_write(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn thread_write_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_thread_write_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        log_level: ::std::os::raw::c_uint,
        persistent: ::std::os::raw::c_uint,
        clean: ::std::os::raw::c_uint,
        thread_write: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let log_level: u32 = unsafe { ::std::mem::transmute(log_level) };
            log_level as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let persistent: u32 = unsafe { ::std::mem::transmute(persistent) };
            persistent as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let clean: u32 = unsafe { ::std::mem::transmute(clean) };
            clean as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let thread_write: u32 = unsafe { ::std::mem::transmute(thread_write) };
            thread_write as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_ext_rename_file_t {
    pub access: ngx_uint_t,
    pub path_access: ngx_uint_t,
    pub time: time_t,
    pub fd: ngx_fd_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub log: *mut ngx_log_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_ext_rename_file_t"][::std::mem::size_of::<ngx_ext_rename_file_t>() - 40usize];
    ["Alignment of ngx_ext_rename_file_t"]
        [::std::mem::align_of::<ngx_ext_rename_file_t>() - 8usize];
    ["Offset of field: ngx_ext_rename_file_t::access"]
        [::std::mem::offset_of!(ngx_ext_rename_file_t, access) - 0usize];
    ["Offset of field: ngx_ext_rename_file_t::path_access"]
        [::std::mem::offset_of!(ngx_ext_rename_file_t, path_access) - 8usize];
    ["Offset of field: ngx_ext_rename_file_t::time"]
        [::std::mem::offset_of!(ngx_ext_rename_file_t, time) - 16usize];
    ["Offset of field: ngx_ext_rename_file_t::fd"]
        [::std::mem::offset_of!(ngx_ext_rename_file_t, fd) - 24usize];
    ["Offset of field: ngx_ext_rename_file_t::log"]
        [::std::mem::offset_of!(ngx_ext_rename_file_t, log) - 32usize];
};
impl ngx_ext_rename_file_t {
    #[inline]
    pub fn create_path(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_create_path(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn create_path_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_create_path_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn delete_file(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_delete_file(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn delete_file_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_delete_file_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        create_path: ::std::os::raw::c_uint,
        delete_file: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let create_path: u32 = unsafe { ::std::mem::transmute(create_path) };
            create_path as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let delete_file: u32 = unsafe { ::std::mem::transmute(delete_file) };
            delete_file as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_copy_file_t {
    pub size: off_t,
    pub buf_size: usize,
    pub access: ngx_uint_t,
    pub time: time_t,
    pub log: *mut ngx_log_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_copy_file_t"][::std::mem::size_of::<ngx_copy_file_t>() - 40usize];
    ["Alignment of ngx_copy_file_t"][::std::mem::align_of::<ngx_copy_file_t>() - 8usize];
    ["Offset of field: ngx_copy_file_t::size"]
        [::std::mem::offset_of!(ngx_copy_file_t, size) - 0usize];
    ["Offset of field: ngx_copy_file_t::buf_size"]
        [::std::mem::offset_of!(ngx_copy_file_t, buf_size) - 8usize];
    ["Offset of field: ngx_copy_file_t::access"]
        [::std::mem::offset_of!(ngx_copy_file_t, access) - 16usize];
    ["Offset of field: ngx_copy_file_t::time"]
        [::std::mem::offset_of!(ngx_copy_file_t, time) - 24usize];
    ["Offset of field: ngx_copy_file_t::log"]
        [::std::mem::offset_of!(ngx_copy_file_t, log) - 32usize];
};
pub type ngx_tree_ctx_t = ngx_tree_ctx_s;
pub type ngx_tree_init_handler_pt = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        prev: *mut ::std::os::raw::c_void,
    ) -> ngx_int_t,
>;
pub type ngx_tree_handler_pt = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut ngx_tree_ctx_t, name: *mut ngx_str_t) -> ngx_int_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_tree_ctx_s {
    pub size: off_t,
    pub fs_size: off_t,
    pub access: ngx_uint_t,
    pub mtime: time_t,
    pub init_handler: ngx_tree_init_handler_pt,
    pub file_handler: ngx_tree_handler_pt,
    pub pre_tree_handler: ngx_tree_handler_pt,
    pub post_tree_handler: ngx_tree_handler_pt,
    pub spec_handler: ngx_tree_handler_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub alloc: usize,
    pub log: *mut ngx_log_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_tree_ctx_s"][::std::mem::size_of::<ngx_tree_ctx_s>() - 96usize];
    ["Alignment of ngx_tree_ctx_s"][::std::mem::align_of::<ngx_tree_ctx_s>() - 8usize];
    ["Offset of field: ngx_tree_ctx_s::size"]
        [::std::mem::offset_of!(ngx_tree_ctx_s, size) - 0usize];
    ["Offset of field: ngx_tree_ctx_s::fs_size"]
        [::std::mem::offset_of!(ngx_tree_ctx_s, fs_size) - 8usize];
    ["Offset of field: ngx_tree_ctx_s::access"]
        [::std::mem::offset_of!(ngx_tree_ctx_s, access) - 16usize];
    ["Offset of field: ngx_tree_ctx_s::mtime"]
        [::std::mem::offset_of!(ngx_tree_ctx_s, mtime) - 24usize];
    ["Offset of field: ngx_tree_ctx_s::init_handler"]
        [::std::mem::offset_of!(ngx_tree_ctx_s, init_handler) - 32usize];
    ["Offset of field: ngx_tree_ctx_s::file_handler"]
        [::std::mem::offset_of!(ngx_tree_ctx_s, file_handler) - 40usize];
    ["Offset of field: ngx_tree_ctx_s::pre_tree_handler"]
        [::std::mem::offset_of!(ngx_tree_ctx_s, pre_tree_handler) - 48usize];
    ["Offset of field: ngx_tree_ctx_s::post_tree_handler"]
        [::std::mem::offset_of!(ngx_tree_ctx_s, post_tree_handler) - 56usize];
    ["Offset of field: ngx_tree_ctx_s::spec_handler"]
        [::std::mem::offset_of!(ngx_tree_ctx_s, spec_handler) - 64usize];
    ["Offset of field: ngx_tree_ctx_s::data"]
        [::std::mem::offset_of!(ngx_tree_ctx_s, data) - 72usize];
    ["Offset of field: ngx_tree_ctx_s::alloc"]
        [::std::mem::offset_of!(ngx_tree_ctx_s, alloc) - 80usize];
    ["Offset of field: ngx_tree_ctx_s::log"][::std::mem::offset_of!(ngx_tree_ctx_s, log) - 88usize];
};
unsafe extern "C" {
    pub fn ngx_get_full_name(
        pool: *mut ngx_pool_t,
        prefix: *mut ngx_str_t,
        name: *mut ngx_str_t,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_write_chain_to_temp_file(tf: *mut ngx_temp_file_t, chain: *mut ngx_chain_t)
    -> isize;
}
unsafe extern "C" {
    pub fn ngx_create_temp_file(
        file: *mut ngx_file_t,
        path: *mut ngx_path_t,
        pool: *mut ngx_pool_t,
        persistent: ngx_uint_t,
        clean: ngx_uint_t,
        access: ngx_uint_t,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_create_hashed_filename(path: *mut ngx_path_t, file: *mut u_char, len: usize);
}
unsafe extern "C" {
    pub fn ngx_create_path(file: *mut ngx_file_t, path: *mut ngx_path_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_create_full_path(dir: *mut u_char, access: ngx_uint_t) -> ngx_err_t;
}
unsafe extern "C" {
    pub fn ngx_add_path(cf: *mut ngx_conf_t, slot: *mut *mut ngx_path_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_create_paths(cycle: *mut ngx_cycle_t, user: ngx_uid_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_ext_rename_file(
        src: *mut ngx_str_t,
        to: *mut ngx_str_t,
        ext: *mut ngx_ext_rename_file_t,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_copy_file(from: *mut u_char, to: *mut u_char, cf: *mut ngx_copy_file_t)
    -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_walk_tree(ctx: *mut ngx_tree_ctx_t, tree: *mut ngx_str_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_next_temp_number(collision: ngx_uint_t) -> ngx_atomic_uint_t;
}
unsafe extern "C" {
    pub fn ngx_conf_set_path_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_merge_path_value(
        cf: *mut ngx_conf_t,
        path: *mut *mut ngx_path_t,
        prev: *mut ngx_path_t,
        init: *mut ngx_path_init_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_access_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut ngx_temp_number: *mut ngx_atomic_t;
}
unsafe extern "C" {
    pub static mut ngx_random_number: ngx_atomic_int_t;
}
unsafe extern "C" {
    pub static mut ngx_crc32_table_short: *mut u32;
}
unsafe extern "C" {
    pub static mut ngx_crc32_table256: [u32; 0usize];
}
unsafe extern "C" {
    pub fn ngx_crc32_table_init() -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_murmur_hash2(data: *mut u_char, len: usize) -> u32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct real_pcre {
    _unused: [u8; 0],
}
pub type pcre = real_pcre;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre_extra {
    pub flags: ::std::os::raw::c_ulong,
    pub study_data: *mut ::std::os::raw::c_void,
    pub match_limit: ::std::os::raw::c_ulong,
    pub callout_data: *mut ::std::os::raw::c_void,
    pub tables: *const ::std::os::raw::c_uchar,
    pub match_limit_recursion: ::std::os::raw::c_ulong,
    pub mark: *mut *mut ::std::os::raw::c_uchar,
    pub executable_jit: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcre_extra"][::std::mem::size_of::<pcre_extra>() - 64usize];
    ["Alignment of pcre_extra"][::std::mem::align_of::<pcre_extra>() - 8usize];
    ["Offset of field: pcre_extra::flags"][::std::mem::offset_of!(pcre_extra, flags) - 0usize];
    ["Offset of field: pcre_extra::study_data"]
        [::std::mem::offset_of!(pcre_extra, study_data) - 8usize];
    ["Offset of field: pcre_extra::match_limit"]
        [::std::mem::offset_of!(pcre_extra, match_limit) - 16usize];
    ["Offset of field: pcre_extra::callout_data"]
        [::std::mem::offset_of!(pcre_extra, callout_data) - 24usize];
    ["Offset of field: pcre_extra::tables"][::std::mem::offset_of!(pcre_extra, tables) - 32usize];
    ["Offset of field: pcre_extra::match_limit_recursion"]
        [::std::mem::offset_of!(pcre_extra, match_limit_recursion) - 40usize];
    ["Offset of field: pcre_extra::mark"][::std::mem::offset_of!(pcre_extra, mark) - 48usize];
    ["Offset of field: pcre_extra::executable_jit"]
        [::std::mem::offset_of!(pcre_extra, executable_jit) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_regex_t {
    pub code: *mut pcre,
    pub extra: *mut pcre_extra,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_regex_t"][::std::mem::size_of::<ngx_regex_t>() - 16usize];
    ["Alignment of ngx_regex_t"][::std::mem::align_of::<ngx_regex_t>() - 8usize];
    ["Offset of field: ngx_regex_t::code"][::std::mem::offset_of!(ngx_regex_t, code) - 0usize];
    ["Offset of field: ngx_regex_t::extra"][::std::mem::offset_of!(ngx_regex_t, extra) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_regex_compile_t {
    pub pattern: ngx_str_t,
    pub pool: *mut ngx_pool_t,
    pub options: ngx_int_t,
    pub regex: *mut ngx_regex_t,
    pub captures: ::std::os::raw::c_int,
    pub named_captures: ::std::os::raw::c_int,
    pub name_size: ::std::os::raw::c_int,
    pub names: *mut u_char,
    pub err: ngx_str_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_regex_compile_t"][::std::mem::size_of::<ngx_regex_compile_t>() - 80usize];
    ["Alignment of ngx_regex_compile_t"][::std::mem::align_of::<ngx_regex_compile_t>() - 8usize];
    ["Offset of field: ngx_regex_compile_t::pattern"]
        [::std::mem::offset_of!(ngx_regex_compile_t, pattern) - 0usize];
    ["Offset of field: ngx_regex_compile_t::pool"]
        [::std::mem::offset_of!(ngx_regex_compile_t, pool) - 16usize];
    ["Offset of field: ngx_regex_compile_t::options"]
        [::std::mem::offset_of!(ngx_regex_compile_t, options) - 24usize];
    ["Offset of field: ngx_regex_compile_t::regex"]
        [::std::mem::offset_of!(ngx_regex_compile_t, regex) - 32usize];
    ["Offset of field: ngx_regex_compile_t::captures"]
        [::std::mem::offset_of!(ngx_regex_compile_t, captures) - 40usize];
    ["Offset of field: ngx_regex_compile_t::named_captures"]
        [::std::mem::offset_of!(ngx_regex_compile_t, named_captures) - 44usize];
    ["Offset of field: ngx_regex_compile_t::name_size"]
        [::std::mem::offset_of!(ngx_regex_compile_t, name_size) - 48usize];
    ["Offset of field: ngx_regex_compile_t::names"]
        [::std::mem::offset_of!(ngx_regex_compile_t, names) - 56usize];
    ["Offset of field: ngx_regex_compile_t::err"]
        [::std::mem::offset_of!(ngx_regex_compile_t, err) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_regex_elt_t {
    pub regex: *mut ngx_regex_t,
    pub name: *mut u_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_regex_elt_t"][::std::mem::size_of::<ngx_regex_elt_t>() - 16usize];
    ["Alignment of ngx_regex_elt_t"][::std::mem::align_of::<ngx_regex_elt_t>() - 8usize];
    ["Offset of field: ngx_regex_elt_t::regex"]
        [::std::mem::offset_of!(ngx_regex_elt_t, regex) - 0usize];
    ["Offset of field: ngx_regex_elt_t::name"]
        [::std::mem::offset_of!(ngx_regex_elt_t, name) - 8usize];
};
unsafe extern "C" {
    pub fn ngx_regex_init();
}
unsafe extern "C" {
    pub fn ngx_regex_compile(rc: *mut ngx_regex_compile_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_regex_exec_array(
        a: *mut ngx_array_t,
        s: *mut ngx_str_t,
        log: *mut ngx_log_t,
    ) -> ngx_int_t;
}
pub type ngx_radix_node_t = ngx_radix_node_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_radix_node_s {
    pub right: *mut ngx_radix_node_t,
    pub left: *mut ngx_radix_node_t,
    pub parent: *mut ngx_radix_node_t,
    pub value: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_radix_node_s"][::std::mem::size_of::<ngx_radix_node_s>() - 32usize];
    ["Alignment of ngx_radix_node_s"][::std::mem::align_of::<ngx_radix_node_s>() - 8usize];
    ["Offset of field: ngx_radix_node_s::right"]
        [::std::mem::offset_of!(ngx_radix_node_s, right) - 0usize];
    ["Offset of field: ngx_radix_node_s::left"]
        [::std::mem::offset_of!(ngx_radix_node_s, left) - 8usize];
    ["Offset of field: ngx_radix_node_s::parent"]
        [::std::mem::offset_of!(ngx_radix_node_s, parent) - 16usize];
    ["Offset of field: ngx_radix_node_s::value"]
        [::std::mem::offset_of!(ngx_radix_node_s, value) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_radix_tree_t {
    pub root: *mut ngx_radix_node_t,
    pub pool: *mut ngx_pool_t,
    pub free: *mut ngx_radix_node_t,
    pub start: *mut ::std::os::raw::c_char,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_radix_tree_t"][::std::mem::size_of::<ngx_radix_tree_t>() - 40usize];
    ["Alignment of ngx_radix_tree_t"][::std::mem::align_of::<ngx_radix_tree_t>() - 8usize];
    ["Offset of field: ngx_radix_tree_t::root"]
        [::std::mem::offset_of!(ngx_radix_tree_t, root) - 0usize];
    ["Offset of field: ngx_radix_tree_t::pool"]
        [::std::mem::offset_of!(ngx_radix_tree_t, pool) - 8usize];
    ["Offset of field: ngx_radix_tree_t::free"]
        [::std::mem::offset_of!(ngx_radix_tree_t, free) - 16usize];
    ["Offset of field: ngx_radix_tree_t::start"]
        [::std::mem::offset_of!(ngx_radix_tree_t, start) - 24usize];
    ["Offset of field: ngx_radix_tree_t::size"]
        [::std::mem::offset_of!(ngx_radix_tree_t, size) - 32usize];
};
unsafe extern "C" {
    pub fn ngx_radix_tree_create(
        pool: *mut ngx_pool_t,
        preallocate: ngx_int_t,
    ) -> *mut ngx_radix_tree_t;
}
unsafe extern "C" {
    pub fn ngx_radix32tree_insert(
        tree: *mut ngx_radix_tree_t,
        key: u32,
        mask: u32,
        value: usize,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_radix32tree_delete(tree: *mut ngx_radix_tree_t, key: u32, mask: u32) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_radix32tree_find(tree: *mut ngx_radix_tree_t, key: u32) -> usize;
}
unsafe extern "C" {
    pub fn ngx_radix128tree_insert(
        tree: *mut ngx_radix_tree_t,
        key: *mut u_char,
        mask: *mut u_char,
        value: usize,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_radix128tree_delete(
        tree: *mut ngx_radix_tree_t,
        key: *mut u_char,
        mask: *mut u_char,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_radix128tree_find(tree: *mut ngx_radix_tree_t, key: *mut u_char) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_time_t {
    pub sec: time_t,
    pub msec: ngx_uint_t,
    pub gmtoff: ngx_int_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_time_t"][::std::mem::size_of::<ngx_time_t>() - 24usize];
    ["Alignment of ngx_time_t"][::std::mem::align_of::<ngx_time_t>() - 8usize];
    ["Offset of field: ngx_time_t::sec"][::std::mem::offset_of!(ngx_time_t, sec) - 0usize];
    ["Offset of field: ngx_time_t::msec"][::std::mem::offset_of!(ngx_time_t, msec) - 8usize];
    ["Offset of field: ngx_time_t::gmtoff"][::std::mem::offset_of!(ngx_time_t, gmtoff) - 16usize];
};
unsafe extern "C" {
    pub fn ngx_time_init();
}
unsafe extern "C" {
    pub fn ngx_time_update();
}
unsafe extern "C" {
    pub fn ngx_time_sigsafe_update();
}
unsafe extern "C" {
    pub fn ngx_http_time(buf: *mut u_char, t: time_t) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_http_cookie_time(buf: *mut u_char, t: time_t) -> *mut u_char;
}
unsafe extern "C" {
    pub fn ngx_gmtime(t: time_t, tp: *mut ngx_tm_t);
}
unsafe extern "C" {
    pub fn ngx_next_time(when: time_t) -> time_t;
}
unsafe extern "C" {
    pub static mut ngx_cached_time: *mut ngx_time_t;
}
unsafe extern "C" {
    pub static mut ngx_cached_err_log_time: ngx_str_t;
}
unsafe extern "C" {
    pub static mut ngx_cached_http_time: ngx_str_t;
}
unsafe extern "C" {
    pub static mut ngx_cached_http_log_time: ngx_str_t;
}
unsafe extern "C" {
    pub static mut ngx_cached_http_log_iso8601: ngx_str_t;
}
unsafe extern "C" {
    pub static mut ngx_cached_syslog_time: ngx_str_t;
}
unsafe extern "C" {
    pub static mut ngx_current_msec: ngx_msec_t;
}
unsafe extern "C" {
    pub fn ngx_rwlock_wlock(lock: *mut ngx_atomic_t);
}
unsafe extern "C" {
    pub fn ngx_rwlock_rlock(lock: *mut ngx_atomic_t);
}
unsafe extern "C" {
    pub fn ngx_rwlock_unlock(lock: *mut ngx_atomic_t);
}
unsafe extern "C" {
    pub fn ngx_rwlock_downgrade(lock: *mut ngx_atomic_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_shmtx_sh_t {
    pub lock: ngx_atomic_t,
    pub wait: ngx_atomic_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_shmtx_sh_t"][::std::mem::size_of::<ngx_shmtx_sh_t>() - 16usize];
    ["Alignment of ngx_shmtx_sh_t"][::std::mem::align_of::<ngx_shmtx_sh_t>() - 8usize];
    ["Offset of field: ngx_shmtx_sh_t::lock"]
        [::std::mem::offset_of!(ngx_shmtx_sh_t, lock) - 0usize];
    ["Offset of field: ngx_shmtx_sh_t::wait"]
        [::std::mem::offset_of!(ngx_shmtx_sh_t, wait) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_shmtx_t {
    pub lock: *mut ngx_atomic_t,
    pub wait: *mut ngx_atomic_t,
    pub semaphore: ngx_uint_t,
    pub sem: sem_t,
    pub spin: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_shmtx_t"][::std::mem::size_of::<ngx_shmtx_t>() - 64usize];
    ["Alignment of ngx_shmtx_t"][::std::mem::align_of::<ngx_shmtx_t>() - 8usize];
    ["Offset of field: ngx_shmtx_t::lock"][::std::mem::offset_of!(ngx_shmtx_t, lock) - 0usize];
    ["Offset of field: ngx_shmtx_t::wait"][::std::mem::offset_of!(ngx_shmtx_t, wait) - 8usize];
    ["Offset of field: ngx_shmtx_t::semaphore"]
        [::std::mem::offset_of!(ngx_shmtx_t, semaphore) - 16usize];
    ["Offset of field: ngx_shmtx_t::sem"][::std::mem::offset_of!(ngx_shmtx_t, sem) - 24usize];
    ["Offset of field: ngx_shmtx_t::spin"][::std::mem::offset_of!(ngx_shmtx_t, spin) - 56usize];
};
unsafe extern "C" {
    pub fn ngx_shmtx_create(
        mtx: *mut ngx_shmtx_t,
        addr: *mut ngx_shmtx_sh_t,
        name: *mut u_char,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_shmtx_destroy(mtx: *mut ngx_shmtx_t);
}
unsafe extern "C" {
    pub fn ngx_shmtx_trylock(mtx: *mut ngx_shmtx_t) -> ngx_uint_t;
}
unsafe extern "C" {
    pub fn ngx_shmtx_lock(mtx: *mut ngx_shmtx_t);
}
unsafe extern "C" {
    pub fn ngx_shmtx_unlock(mtx: *mut ngx_shmtx_t);
}
unsafe extern "C" {
    pub fn ngx_shmtx_force_unlock(mtx: *mut ngx_shmtx_t, pid: ngx_pid_t) -> ngx_uint_t;
}
pub type ngx_slab_page_t = ngx_slab_page_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_slab_page_s {
    pub slab: usize,
    pub next: *mut ngx_slab_page_t,
    pub prev: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_slab_page_s"][::std::mem::size_of::<ngx_slab_page_s>() - 24usize];
    ["Alignment of ngx_slab_page_s"][::std::mem::align_of::<ngx_slab_page_s>() - 8usize];
    ["Offset of field: ngx_slab_page_s::slab"]
        [::std::mem::offset_of!(ngx_slab_page_s, slab) - 0usize];
    ["Offset of field: ngx_slab_page_s::next"]
        [::std::mem::offset_of!(ngx_slab_page_s, next) - 8usize];
    ["Offset of field: ngx_slab_page_s::prev"]
        [::std::mem::offset_of!(ngx_slab_page_s, prev) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_slab_stat_t {
    pub total: ngx_uint_t,
    pub used: ngx_uint_t,
    pub reqs: ngx_uint_t,
    pub fails: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_slab_stat_t"][::std::mem::size_of::<ngx_slab_stat_t>() - 32usize];
    ["Alignment of ngx_slab_stat_t"][::std::mem::align_of::<ngx_slab_stat_t>() - 8usize];
    ["Offset of field: ngx_slab_stat_t::total"]
        [::std::mem::offset_of!(ngx_slab_stat_t, total) - 0usize];
    ["Offset of field: ngx_slab_stat_t::used"]
        [::std::mem::offset_of!(ngx_slab_stat_t, used) - 8usize];
    ["Offset of field: ngx_slab_stat_t::reqs"]
        [::std::mem::offset_of!(ngx_slab_stat_t, reqs) - 16usize];
    ["Offset of field: ngx_slab_stat_t::fails"]
        [::std::mem::offset_of!(ngx_slab_stat_t, fails) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_slab_pool_t {
    pub lock: ngx_shmtx_sh_t,
    pub min_size: usize,
    pub min_shift: usize,
    pub pages: *mut ngx_slab_page_t,
    pub last: *mut ngx_slab_page_t,
    pub free: ngx_slab_page_t,
    pub stats: *mut ngx_slab_stat_t,
    pub pfree: ngx_uint_t,
    pub start: *mut u_char,
    pub end: *mut u_char,
    pub mutex: ngx_shmtx_t,
    pub log_ctx: *mut u_char,
    pub zero: u_char,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub data: *mut ::std::os::raw::c_void,
    pub addr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_slab_pool_t"][::std::mem::size_of::<ngx_slab_pool_t>() - 200usize];
    ["Alignment of ngx_slab_pool_t"][::std::mem::align_of::<ngx_slab_pool_t>() - 8usize];
    ["Offset of field: ngx_slab_pool_t::lock"]
        [::std::mem::offset_of!(ngx_slab_pool_t, lock) - 0usize];
    ["Offset of field: ngx_slab_pool_t::min_size"]
        [::std::mem::offset_of!(ngx_slab_pool_t, min_size) - 16usize];
    ["Offset of field: ngx_slab_pool_t::min_shift"]
        [::std::mem::offset_of!(ngx_slab_pool_t, min_shift) - 24usize];
    ["Offset of field: ngx_slab_pool_t::pages"]
        [::std::mem::offset_of!(ngx_slab_pool_t, pages) - 32usize];
    ["Offset of field: ngx_slab_pool_t::last"]
        [::std::mem::offset_of!(ngx_slab_pool_t, last) - 40usize];
    ["Offset of field: ngx_slab_pool_t::free"]
        [::std::mem::offset_of!(ngx_slab_pool_t, free) - 48usize];
    ["Offset of field: ngx_slab_pool_t::stats"]
        [::std::mem::offset_of!(ngx_slab_pool_t, stats) - 72usize];
    ["Offset of field: ngx_slab_pool_t::pfree"]
        [::std::mem::offset_of!(ngx_slab_pool_t, pfree) - 80usize];
    ["Offset of field: ngx_slab_pool_t::start"]
        [::std::mem::offset_of!(ngx_slab_pool_t, start) - 88usize];
    ["Offset of field: ngx_slab_pool_t::end"]
        [::std::mem::offset_of!(ngx_slab_pool_t, end) - 96usize];
    ["Offset of field: ngx_slab_pool_t::mutex"]
        [::std::mem::offset_of!(ngx_slab_pool_t, mutex) - 104usize];
    ["Offset of field: ngx_slab_pool_t::log_ctx"]
        [::std::mem::offset_of!(ngx_slab_pool_t, log_ctx) - 168usize];
    ["Offset of field: ngx_slab_pool_t::zero"]
        [::std::mem::offset_of!(ngx_slab_pool_t, zero) - 176usize];
    ["Offset of field: ngx_slab_pool_t::data"]
        [::std::mem::offset_of!(ngx_slab_pool_t, data) - 184usize];
    ["Offset of field: ngx_slab_pool_t::addr"]
        [::std::mem::offset_of!(ngx_slab_pool_t, addr) - 192usize];
};
impl ngx_slab_pool_t {
    #[inline]
    pub fn log_nomem(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_log_nomem(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn log_nomem_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_log_nomem_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        log_nomem: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let log_nomem: u32 = unsafe { ::std::mem::transmute(log_nomem) };
            log_nomem as u64
        });
        __bindgen_bitfield_unit
    }
}
unsafe extern "C" {
    pub fn ngx_slab_sizes_init();
}
unsafe extern "C" {
    pub fn ngx_slab_init(pool: *mut ngx_slab_pool_t);
}
unsafe extern "C" {
    pub fn ngx_slab_alloc(pool: *mut ngx_slab_pool_t, size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_slab_alloc_locked(
        pool: *mut ngx_slab_pool_t,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_slab_calloc(pool: *mut ngx_slab_pool_t, size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_slab_calloc_locked(
        pool: *mut ngx_slab_pool_t,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ngx_slab_free(pool: *mut ngx_slab_pool_t, p: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn ngx_slab_free_locked(pool: *mut ngx_slab_pool_t, p: *mut ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ngx_sockaddr_t {
    pub sockaddr: sockaddr,
    pub sockaddr_in: sockaddr_in,
    pub sockaddr_in6: sockaddr_in6,
    pub sockaddr_un: sockaddr_un,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_sockaddr_t"][::std::mem::size_of::<ngx_sockaddr_t>() - 112usize];
    ["Alignment of ngx_sockaddr_t"][::std::mem::align_of::<ngx_sockaddr_t>() - 4usize];
    ["Offset of field: ngx_sockaddr_t::sockaddr"]
        [::std::mem::offset_of!(ngx_sockaddr_t, sockaddr) - 0usize];
    ["Offset of field: ngx_sockaddr_t::sockaddr_in"]
        [::std::mem::offset_of!(ngx_sockaddr_t, sockaddr_in) - 0usize];
    ["Offset of field: ngx_sockaddr_t::sockaddr_in6"]
        [::std::mem::offset_of!(ngx_sockaddr_t, sockaddr_in6) - 0usize];
    ["Offset of field: ngx_sockaddr_t::sockaddr_un"]
        [::std::mem::offset_of!(ngx_sockaddr_t, sockaddr_un) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_in_cidr_t {
    pub addr: in_addr_t,
    pub mask: in_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_in_cidr_t"][::std::mem::size_of::<ngx_in_cidr_t>() - 8usize];
    ["Alignment of ngx_in_cidr_t"][::std::mem::align_of::<ngx_in_cidr_t>() - 4usize];
    ["Offset of field: ngx_in_cidr_t::addr"][::std::mem::offset_of!(ngx_in_cidr_t, addr) - 0usize];
    ["Offset of field: ngx_in_cidr_t::mask"][::std::mem::offset_of!(ngx_in_cidr_t, mask) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_in6_cidr_t {
    pub addr: in6_addr,
    pub mask: in6_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_in6_cidr_t"][::std::mem::size_of::<ngx_in6_cidr_t>() - 32usize];
    ["Alignment of ngx_in6_cidr_t"][::std::mem::align_of::<ngx_in6_cidr_t>() - 4usize];
    ["Offset of field: ngx_in6_cidr_t::addr"]
        [::std::mem::offset_of!(ngx_in6_cidr_t, addr) - 0usize];
    ["Offset of field: ngx_in6_cidr_t::mask"]
        [::std::mem::offset_of!(ngx_in6_cidr_t, mask) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_cidr_t {
    pub family: ngx_uint_t,
    pub u: ngx_cidr_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ngx_cidr_t__bindgen_ty_1 {
    pub in_: ngx_in_cidr_t,
    pub in6: ngx_in6_cidr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_cidr_t__bindgen_ty_1"]
        [::std::mem::size_of::<ngx_cidr_t__bindgen_ty_1>() - 32usize];
    ["Alignment of ngx_cidr_t__bindgen_ty_1"]
        [::std::mem::align_of::<ngx_cidr_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: ngx_cidr_t__bindgen_ty_1::in_"]
        [::std::mem::offset_of!(ngx_cidr_t__bindgen_ty_1, in_) - 0usize];
    ["Offset of field: ngx_cidr_t__bindgen_ty_1::in6"]
        [::std::mem::offset_of!(ngx_cidr_t__bindgen_ty_1, in6) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_cidr_t"][::std::mem::size_of::<ngx_cidr_t>() - 40usize];
    ["Alignment of ngx_cidr_t"][::std::mem::align_of::<ngx_cidr_t>() - 8usize];
    ["Offset of field: ngx_cidr_t::family"][::std::mem::offset_of!(ngx_cidr_t, family) - 0usize];
    ["Offset of field: ngx_cidr_t::u"][::std::mem::offset_of!(ngx_cidr_t, u) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_addr_t {
    pub sockaddr: *mut sockaddr,
    pub socklen: socklen_t,
    pub name: ngx_str_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_addr_t"][::std::mem::size_of::<ngx_addr_t>() - 32usize];
    ["Alignment of ngx_addr_t"][::std::mem::align_of::<ngx_addr_t>() - 8usize];
    ["Offset of field: ngx_addr_t::sockaddr"]
        [::std::mem::offset_of!(ngx_addr_t, sockaddr) - 0usize];
    ["Offset of field: ngx_addr_t::socklen"][::std::mem::offset_of!(ngx_addr_t, socklen) - 8usize];
    ["Offset of field: ngx_addr_t::name"][::std::mem::offset_of!(ngx_addr_t, name) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_url_t {
    pub url: ngx_str_t,
    pub host: ngx_str_t,
    pub port_text: ngx_str_t,
    pub uri: ngx_str_t,
    pub port: in_port_t,
    pub default_port: in_port_t,
    pub last_port: in_port_t,
    pub family: ::std::os::raw::c_int,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub socklen: socklen_t,
    pub sockaddr: ngx_sockaddr_t,
    pub addrs: *mut ngx_addr_t,
    pub naddrs: ngx_uint_t,
    pub err: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_url_t"][::std::mem::size_of::<ngx_url_t>() - 224usize];
    ["Alignment of ngx_url_t"][::std::mem::align_of::<ngx_url_t>() - 8usize];
    ["Offset of field: ngx_url_t::url"][::std::mem::offset_of!(ngx_url_t, url) - 0usize];
    ["Offset of field: ngx_url_t::host"][::std::mem::offset_of!(ngx_url_t, host) - 16usize];
    ["Offset of field: ngx_url_t::port_text"]
        [::std::mem::offset_of!(ngx_url_t, port_text) - 32usize];
    ["Offset of field: ngx_url_t::uri"][::std::mem::offset_of!(ngx_url_t, uri) - 48usize];
    ["Offset of field: ngx_url_t::port"][::std::mem::offset_of!(ngx_url_t, port) - 64usize];
    ["Offset of field: ngx_url_t::default_port"]
        [::std::mem::offset_of!(ngx_url_t, default_port) - 66usize];
    ["Offset of field: ngx_url_t::last_port"]
        [::std::mem::offset_of!(ngx_url_t, last_port) - 68usize];
    ["Offset of field: ngx_url_t::family"][::std::mem::offset_of!(ngx_url_t, family) - 72usize];
    ["Offset of field: ngx_url_t::socklen"][::std::mem::offset_of!(ngx_url_t, socklen) - 80usize];
    ["Offset of field: ngx_url_t::sockaddr"][::std::mem::offset_of!(ngx_url_t, sockaddr) - 84usize];
    ["Offset of field: ngx_url_t::addrs"][::std::mem::offset_of!(ngx_url_t, addrs) - 200usize];
    ["Offset of field: ngx_url_t::naddrs"][::std::mem::offset_of!(ngx_url_t, naddrs) - 208usize];
    ["Offset of field: ngx_url_t::err"][::std::mem::offset_of!(ngx_url_t, err) - 216usize];
};
impl ngx_url_t {
    #[inline]
    pub fn listen(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_listen(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn listen_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_listen_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn uri_part(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_uri_part(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn uri_part_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_uri_part_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn no_resolve(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_no_resolve(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn no_resolve_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_no_resolve_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn no_port(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_no_port(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn no_port_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_no_port_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn wildcard(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_wildcard(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn wildcard_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_wildcard_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        listen: ::std::os::raw::c_uint,
        uri_part: ::std::os::raw::c_uint,
        no_resolve: ::std::os::raw::c_uint,
        no_port: ::std::os::raw::c_uint,
        wildcard: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let listen: u32 = unsafe { ::std::mem::transmute(listen) };
            listen as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let uri_part: u32 = unsafe { ::std::mem::transmute(uri_part) };
            uri_part as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let no_resolve: u32 = unsafe { ::std::mem::transmute(no_resolve) };
            no_resolve as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let no_port: u32 = unsafe { ::std::mem::transmute(no_port) };
            no_port as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let wildcard: u32 = unsafe { ::std::mem::transmute(wildcard) };
            wildcard as u64
        });
        __bindgen_bitfield_unit
    }
}
unsafe extern "C" {
    pub fn ngx_inet_addr(text: *mut u_char, len: usize) -> in_addr_t;
}
unsafe extern "C" {
    pub fn ngx_inet6_addr(p: *mut u_char, len: usize, addr: *mut u_char) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_inet6_ntop(p: *mut u_char, text: *mut u_char, len: usize) -> usize;
}
unsafe extern "C" {
    pub fn ngx_sock_ntop(
        sa: *mut sockaddr,
        socklen: socklen_t,
        text: *mut u_char,
        len: usize,
        port: ngx_uint_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn ngx_inet_ntop(
        family: ::std::os::raw::c_int,
        addr: *mut ::std::os::raw::c_void,
        text: *mut u_char,
        len: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn ngx_ptocidr(text: *mut ngx_str_t, cidr: *mut ngx_cidr_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_cidr_match(sa: *mut sockaddr, cidrs: *mut ngx_array_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_parse_addr(
        pool: *mut ngx_pool_t,
        addr: *mut ngx_addr_t,
        text: *mut u_char,
        len: usize,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_parse_addr_port(
        pool: *mut ngx_pool_t,
        addr: *mut ngx_addr_t,
        text: *mut u_char,
        len: usize,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_parse_url(pool: *mut ngx_pool_t, u: *mut ngx_url_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_inet_resolve_host(pool: *mut ngx_pool_t, u: *mut ngx_url_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_cmp_sockaddr(
        sa1: *mut sockaddr,
        slen1: socklen_t,
        sa2: *mut sockaddr,
        slen2: socklen_t,
        cmp_port: ngx_uint_t,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_inet_get_port(sa: *mut sockaddr) -> in_port_t;
}
unsafe extern "C" {
    pub fn ngx_inet_set_port(sa: *mut sockaddr, port: in_port_t);
}
unsafe extern "C" {
    pub fn ngx_inet_wildcard(sa: *mut sockaddr) -> ngx_uint_t;
}
pub type ngx_shm_zone_t = ngx_shm_zone_s;
pub type ngx_shm_zone_init_pt = ::std::option::Option<
    unsafe extern "C" fn(zone: *mut ngx_shm_zone_t, data: *mut ::std::os::raw::c_void) -> ngx_int_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_shm_zone_s {
    pub data: *mut ::std::os::raw::c_void,
    pub shm: ngx_shm_t,
    pub init: ngx_shm_zone_init_pt,
    pub tag: *mut ::std::os::raw::c_void,
    pub sync: *mut ::std::os::raw::c_void,
    pub noreuse: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_shm_zone_s"][::std::mem::size_of::<ngx_shm_zone_s>() - 88usize];
    ["Alignment of ngx_shm_zone_s"][::std::mem::align_of::<ngx_shm_zone_s>() - 8usize];
    ["Offset of field: ngx_shm_zone_s::data"]
        [::std::mem::offset_of!(ngx_shm_zone_s, data) - 0usize];
    ["Offset of field: ngx_shm_zone_s::shm"][::std::mem::offset_of!(ngx_shm_zone_s, shm) - 8usize];
    ["Offset of field: ngx_shm_zone_s::init"]
        [::std::mem::offset_of!(ngx_shm_zone_s, init) - 56usize];
    ["Offset of field: ngx_shm_zone_s::tag"][::std::mem::offset_of!(ngx_shm_zone_s, tag) - 64usize];
    ["Offset of field: ngx_shm_zone_s::sync"]
        [::std::mem::offset_of!(ngx_shm_zone_s, sync) - 72usize];
    ["Offset of field: ngx_shm_zone_s::noreuse"]
        [::std::mem::offset_of!(ngx_shm_zone_s, noreuse) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_cycle_s {
    pub conf_ctx: *mut *mut *mut *mut ::std::os::raw::c_void,
    pub pool: *mut ngx_pool_t,
    pub log: *mut ngx_log_t,
    pub new_log: ngx_log_t,
    pub log_use_stderr: ngx_uint_t,
    pub files: *mut *mut ngx_connection_t,
    pub free_connections: *mut ngx_connection_t,
    pub free_connection_n: ngx_uint_t,
    pub modules: *mut *mut ngx_module_t,
    pub modules_n: ngx_uint_t,
    pub modules_used: ngx_uint_t,
    pub reusable_connections_queue: ngx_queue_t,
    pub reusable_connections_n: ngx_uint_t,
    pub connections_reuse_time: time_t,
    pub listening: ngx_array_t,
    pub paths: ngx_array_t,
    pub config_dump: ngx_array_t,
    pub config_dump_rbtree: ngx_rbtree_t,
    pub config_dump_sentinel: ngx_rbtree_node_t,
    pub open_files: ngx_list_t,
    pub shared_memory: ngx_list_t,
    pub connection_n: ngx_uint_t,
    pub files_n: ngx_uint_t,
    pub connections: *mut ngx_connection_t,
    pub read_events: *mut ngx_event_t,
    pub write_events: *mut ngx_event_t,
    pub old_cycle: *mut ngx_cycle_t,
    pub conf_file: ngx_str_t,
    pub conf_param: ngx_str_t,
    pub conf_prefix: ngx_str_t,
    pub prefix: ngx_str_t,
    pub lock_file: ngx_str_t,
    pub hostname: ngx_str_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_cycle_s"][::std::mem::size_of::<ngx_cycle_s>() - 632usize];
    ["Alignment of ngx_cycle_s"][::std::mem::align_of::<ngx_cycle_s>() - 8usize];
    ["Offset of field: ngx_cycle_s::conf_ctx"]
        [::std::mem::offset_of!(ngx_cycle_s, conf_ctx) - 0usize];
    ["Offset of field: ngx_cycle_s::pool"][::std::mem::offset_of!(ngx_cycle_s, pool) - 8usize];
    ["Offset of field: ngx_cycle_s::log"][::std::mem::offset_of!(ngx_cycle_s, log) - 16usize];
    ["Offset of field: ngx_cycle_s::new_log"]
        [::std::mem::offset_of!(ngx_cycle_s, new_log) - 24usize];
    ["Offset of field: ngx_cycle_s::log_use_stderr"]
        [::std::mem::offset_of!(ngx_cycle_s, log_use_stderr) - 104usize];
    ["Offset of field: ngx_cycle_s::files"][::std::mem::offset_of!(ngx_cycle_s, files) - 112usize];
    ["Offset of field: ngx_cycle_s::free_connections"]
        [::std::mem::offset_of!(ngx_cycle_s, free_connections) - 120usize];
    ["Offset of field: ngx_cycle_s::free_connection_n"]
        [::std::mem::offset_of!(ngx_cycle_s, free_connection_n) - 128usize];
    ["Offset of field: ngx_cycle_s::modules"]
        [::std::mem::offset_of!(ngx_cycle_s, modules) - 136usize];
    ["Offset of field: ngx_cycle_s::modules_n"]
        [::std::mem::offset_of!(ngx_cycle_s, modules_n) - 144usize];
    ["Offset of field: ngx_cycle_s::modules_used"]
        [::std::mem::offset_of!(ngx_cycle_s, modules_used) - 152usize];
    ["Offset of field: ngx_cycle_s::reusable_connections_queue"]
        [::std::mem::offset_of!(ngx_cycle_s, reusable_connections_queue) - 160usize];
    ["Offset of field: ngx_cycle_s::reusable_connections_n"]
        [::std::mem::offset_of!(ngx_cycle_s, reusable_connections_n) - 176usize];
    ["Offset of field: ngx_cycle_s::connections_reuse_time"]
        [::std::mem::offset_of!(ngx_cycle_s, connections_reuse_time) - 184usize];
    ["Offset of field: ngx_cycle_s::listening"]
        [::std::mem::offset_of!(ngx_cycle_s, listening) - 192usize];
    ["Offset of field: ngx_cycle_s::paths"][::std::mem::offset_of!(ngx_cycle_s, paths) - 232usize];
    ["Offset of field: ngx_cycle_s::config_dump"]
        [::std::mem::offset_of!(ngx_cycle_s, config_dump) - 272usize];
    ["Offset of field: ngx_cycle_s::config_dump_rbtree"]
        [::std::mem::offset_of!(ngx_cycle_s, config_dump_rbtree) - 312usize];
    ["Offset of field: ngx_cycle_s::config_dump_sentinel"]
        [::std::mem::offset_of!(ngx_cycle_s, config_dump_sentinel) - 336usize];
    ["Offset of field: ngx_cycle_s::open_files"]
        [::std::mem::offset_of!(ngx_cycle_s, open_files) - 376usize];
    ["Offset of field: ngx_cycle_s::shared_memory"]
        [::std::mem::offset_of!(ngx_cycle_s, shared_memory) - 432usize];
    ["Offset of field: ngx_cycle_s::connection_n"]
        [::std::mem::offset_of!(ngx_cycle_s, connection_n) - 488usize];
    ["Offset of field: ngx_cycle_s::files_n"]
        [::std::mem::offset_of!(ngx_cycle_s, files_n) - 496usize];
    ["Offset of field: ngx_cycle_s::connections"]
        [::std::mem::offset_of!(ngx_cycle_s, connections) - 504usize];
    ["Offset of field: ngx_cycle_s::read_events"]
        [::std::mem::offset_of!(ngx_cycle_s, read_events) - 512usize];
    ["Offset of field: ngx_cycle_s::write_events"]
        [::std::mem::offset_of!(ngx_cycle_s, write_events) - 520usize];
    ["Offset of field: ngx_cycle_s::old_cycle"]
        [::std::mem::offset_of!(ngx_cycle_s, old_cycle) - 528usize];
    ["Offset of field: ngx_cycle_s::conf_file"]
        [::std::mem::offset_of!(ngx_cycle_s, conf_file) - 536usize];
    ["Offset of field: ngx_cycle_s::conf_param"]
        [::std::mem::offset_of!(ngx_cycle_s, conf_param) - 552usize];
    ["Offset of field: ngx_cycle_s::conf_prefix"]
        [::std::mem::offset_of!(ngx_cycle_s, conf_prefix) - 568usize];
    ["Offset of field: ngx_cycle_s::prefix"]
        [::std::mem::offset_of!(ngx_cycle_s, prefix) - 584usize];
    ["Offset of field: ngx_cycle_s::lock_file"]
        [::std::mem::offset_of!(ngx_cycle_s, lock_file) - 600usize];
    ["Offset of field: ngx_cycle_s::hostname"]
        [::std::mem::offset_of!(ngx_cycle_s, hostname) - 616usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_core_conf_t {
    pub daemon: ngx_flag_t,
    pub master: ngx_flag_t,
    pub timer_resolution: ngx_msec_t,
    pub shutdown_timeout: ngx_msec_t,
    pub worker_processes: ngx_int_t,
    pub debug_points: ngx_int_t,
    pub rlimit_nofile: ngx_int_t,
    pub rlimit_core: off_t,
    pub priority: ::std::os::raw::c_int,
    pub cpu_affinity_auto: ngx_uint_t,
    pub cpu_affinity_n: ngx_uint_t,
    pub cpu_affinity: *mut ngx_cpuset_t,
    pub username: *mut ::std::os::raw::c_char,
    pub user: ngx_uid_t,
    pub group: ngx_gid_t,
    pub working_directory: ngx_str_t,
    pub lock_file: ngx_str_t,
    pub pid: ngx_str_t,
    pub oldpid: ngx_str_t,
    pub env: ngx_array_t,
    pub environment: *mut *mut ::std::os::raw::c_char,
    pub transparent: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_core_conf_t"][::std::mem::size_of::<ngx_core_conf_t>() - 232usize];
    ["Alignment of ngx_core_conf_t"][::std::mem::align_of::<ngx_core_conf_t>() - 8usize];
    ["Offset of field: ngx_core_conf_t::daemon"]
        [::std::mem::offset_of!(ngx_core_conf_t, daemon) - 0usize];
    ["Offset of field: ngx_core_conf_t::master"]
        [::std::mem::offset_of!(ngx_core_conf_t, master) - 8usize];
    ["Offset of field: ngx_core_conf_t::timer_resolution"]
        [::std::mem::offset_of!(ngx_core_conf_t, timer_resolution) - 16usize];
    ["Offset of field: ngx_core_conf_t::shutdown_timeout"]
        [::std::mem::offset_of!(ngx_core_conf_t, shutdown_timeout) - 24usize];
    ["Offset of field: ngx_core_conf_t::worker_processes"]
        [::std::mem::offset_of!(ngx_core_conf_t, worker_processes) - 32usize];
    ["Offset of field: ngx_core_conf_t::debug_points"]
        [::std::mem::offset_of!(ngx_core_conf_t, debug_points) - 40usize];
    ["Offset of field: ngx_core_conf_t::rlimit_nofile"]
        [::std::mem::offset_of!(ngx_core_conf_t, rlimit_nofile) - 48usize];
    ["Offset of field: ngx_core_conf_t::rlimit_core"]
        [::std::mem::offset_of!(ngx_core_conf_t, rlimit_core) - 56usize];
    ["Offset of field: ngx_core_conf_t::priority"]
        [::std::mem::offset_of!(ngx_core_conf_t, priority) - 64usize];
    ["Offset of field: ngx_core_conf_t::cpu_affinity_auto"]
        [::std::mem::offset_of!(ngx_core_conf_t, cpu_affinity_auto) - 72usize];
    ["Offset of field: ngx_core_conf_t::cpu_affinity_n"]
        [::std::mem::offset_of!(ngx_core_conf_t, cpu_affinity_n) - 80usize];
    ["Offset of field: ngx_core_conf_t::cpu_affinity"]
        [::std::mem::offset_of!(ngx_core_conf_t, cpu_affinity) - 88usize];
    ["Offset of field: ngx_core_conf_t::username"]
        [::std::mem::offset_of!(ngx_core_conf_t, username) - 96usize];
    ["Offset of field: ngx_core_conf_t::user"]
        [::std::mem::offset_of!(ngx_core_conf_t, user) - 104usize];
    ["Offset of field: ngx_core_conf_t::group"]
        [::std::mem::offset_of!(ngx_core_conf_t, group) - 108usize];
    ["Offset of field: ngx_core_conf_t::working_directory"]
        [::std::mem::offset_of!(ngx_core_conf_t, working_directory) - 112usize];
    ["Offset of field: ngx_core_conf_t::lock_file"]
        [::std::mem::offset_of!(ngx_core_conf_t, lock_file) - 128usize];
    ["Offset of field: ngx_core_conf_t::pid"]
        [::std::mem::offset_of!(ngx_core_conf_t, pid) - 144usize];
    ["Offset of field: ngx_core_conf_t::oldpid"]
        [::std::mem::offset_of!(ngx_core_conf_t, oldpid) - 160usize];
    ["Offset of field: ngx_core_conf_t::env"]
        [::std::mem::offset_of!(ngx_core_conf_t, env) - 176usize];
    ["Offset of field: ngx_core_conf_t::environment"]
        [::std::mem::offset_of!(ngx_core_conf_t, environment) - 216usize];
    ["Offset of field: ngx_core_conf_t::transparent"]
        [::std::mem::offset_of!(ngx_core_conf_t, transparent) - 224usize];
};
unsafe extern "C" {
    pub fn ngx_init_cycle(old_cycle: *mut ngx_cycle_t) -> *mut ngx_cycle_t;
}
unsafe extern "C" {
    pub fn ngx_create_pidfile(name: *mut ngx_str_t, log: *mut ngx_log_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_delete_pidfile(cycle: *mut ngx_cycle_t);
}
unsafe extern "C" {
    pub fn ngx_signal_process(
        cycle: *mut ngx_cycle_t,
        sig: *mut ::std::os::raw::c_char,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_reopen_files(cycle: *mut ngx_cycle_t, user: ngx_uid_t);
}
unsafe extern "C" {
    pub fn ngx_set_environment(
        cycle: *mut ngx_cycle_t,
        last: *mut ngx_uint_t,
    ) -> *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_exec_new_binary(
        cycle: *mut ngx_cycle_t,
        argv: *const *mut ::std::os::raw::c_char,
    ) -> ngx_pid_t;
}
unsafe extern "C" {
    pub fn ngx_get_cpu_affinity(n: ngx_uint_t) -> *mut ngx_cpuset_t;
}
unsafe extern "C" {
    pub fn ngx_shared_memory_add(
        cf: *mut ngx_conf_t,
        name: *mut ngx_str_t,
        size: usize,
        tag: *mut ::std::os::raw::c_void,
    ) -> *mut ngx_shm_zone_t;
}
unsafe extern "C" {
    pub fn ngx_set_shutdown_timer(cycle: *mut ngx_cycle_t);
}
unsafe extern "C" {
    pub static mut ngx_cycle: *mut ngx_cycle_t;
}
unsafe extern "C" {
    pub static mut ngx_old_cycles: ngx_array_t;
}
unsafe extern "C" {
    pub static mut ngx_core_module: ngx_module_t;
}
unsafe extern "C" {
    pub static mut ngx_test_config: ngx_uint_t;
}
unsafe extern "C" {
    pub static mut ngx_dump_config: ngx_uint_t;
}
unsafe extern "C" {
    pub static mut ngx_quiet_mode: ngx_uint_t;
}
pub type ngx_resolver_t = ngx_resolver_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_connection_t {
    pub udp: *mut ngx_connection_t,
    pub tcp: *mut ngx_connection_t,
    pub sockaddr: *mut sockaddr,
    pub socklen: socklen_t,
    pub server: ngx_str_t,
    pub log: ngx_log_t,
    pub read_buf: *mut ngx_buf_t,
    pub write_buf: *mut ngx_buf_t,
    pub resolver: *mut ngx_resolver_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_resolver_connection_t"]
        [::std::mem::size_of::<ngx_resolver_connection_t>() - 152usize];
    ["Alignment of ngx_resolver_connection_t"]
        [::std::mem::align_of::<ngx_resolver_connection_t>() - 8usize];
    ["Offset of field: ngx_resolver_connection_t::udp"]
        [::std::mem::offset_of!(ngx_resolver_connection_t, udp) - 0usize];
    ["Offset of field: ngx_resolver_connection_t::tcp"]
        [::std::mem::offset_of!(ngx_resolver_connection_t, tcp) - 8usize];
    ["Offset of field: ngx_resolver_connection_t::sockaddr"]
        [::std::mem::offset_of!(ngx_resolver_connection_t, sockaddr) - 16usize];
    ["Offset of field: ngx_resolver_connection_t::socklen"]
        [::std::mem::offset_of!(ngx_resolver_connection_t, socklen) - 24usize];
    ["Offset of field: ngx_resolver_connection_t::server"]
        [::std::mem::offset_of!(ngx_resolver_connection_t, server) - 32usize];
    ["Offset of field: ngx_resolver_connection_t::log"]
        [::std::mem::offset_of!(ngx_resolver_connection_t, log) - 48usize];
    ["Offset of field: ngx_resolver_connection_t::read_buf"]
        [::std::mem::offset_of!(ngx_resolver_connection_t, read_buf) - 128usize];
    ["Offset of field: ngx_resolver_connection_t::write_buf"]
        [::std::mem::offset_of!(ngx_resolver_connection_t, write_buf) - 136usize];
    ["Offset of field: ngx_resolver_connection_t::resolver"]
        [::std::mem::offset_of!(ngx_resolver_connection_t, resolver) - 144usize];
};
pub type ngx_resolver_ctx_t = ngx_resolver_ctx_s;
pub type ngx_resolver_handler_pt =
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut ngx_resolver_ctx_t)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_addr_t {
    pub sockaddr: *mut sockaddr,
    pub socklen: socklen_t,
    pub name: ngx_str_t,
    pub priority: u_short,
    pub weight: u_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_resolver_addr_t"][::std::mem::size_of::<ngx_resolver_addr_t>() - 40usize];
    ["Alignment of ngx_resolver_addr_t"][::std::mem::align_of::<ngx_resolver_addr_t>() - 8usize];
    ["Offset of field: ngx_resolver_addr_t::sockaddr"]
        [::std::mem::offset_of!(ngx_resolver_addr_t, sockaddr) - 0usize];
    ["Offset of field: ngx_resolver_addr_t::socklen"]
        [::std::mem::offset_of!(ngx_resolver_addr_t, socklen) - 8usize];
    ["Offset of field: ngx_resolver_addr_t::name"]
        [::std::mem::offset_of!(ngx_resolver_addr_t, name) - 16usize];
    ["Offset of field: ngx_resolver_addr_t::priority"]
        [::std::mem::offset_of!(ngx_resolver_addr_t, priority) - 32usize];
    ["Offset of field: ngx_resolver_addr_t::weight"]
        [::std::mem::offset_of!(ngx_resolver_addr_t, weight) - 34usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_srv_t {
    pub name: ngx_str_t,
    pub priority: u_short,
    pub weight: u_short,
    pub port: u_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_resolver_srv_t"][::std::mem::size_of::<ngx_resolver_srv_t>() - 24usize];
    ["Alignment of ngx_resolver_srv_t"][::std::mem::align_of::<ngx_resolver_srv_t>() - 8usize];
    ["Offset of field: ngx_resolver_srv_t::name"]
        [::std::mem::offset_of!(ngx_resolver_srv_t, name) - 0usize];
    ["Offset of field: ngx_resolver_srv_t::priority"]
        [::std::mem::offset_of!(ngx_resolver_srv_t, priority) - 16usize];
    ["Offset of field: ngx_resolver_srv_t::weight"]
        [::std::mem::offset_of!(ngx_resolver_srv_t, weight) - 18usize];
    ["Offset of field: ngx_resolver_srv_t::port"]
        [::std::mem::offset_of!(ngx_resolver_srv_t, port) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_srv_name_t {
    pub name: ngx_str_t,
    pub priority: u_short,
    pub weight: u_short,
    pub port: u_short,
    pub ctx: *mut ngx_resolver_ctx_t,
    pub state: ngx_int_t,
    pub naddrs: ngx_uint_t,
    pub addrs: *mut ngx_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_resolver_srv_name_t"][::std::mem::size_of::<ngx_resolver_srv_name_t>() - 56usize];
    ["Alignment of ngx_resolver_srv_name_t"]
        [::std::mem::align_of::<ngx_resolver_srv_name_t>() - 8usize];
    ["Offset of field: ngx_resolver_srv_name_t::name"]
        [::std::mem::offset_of!(ngx_resolver_srv_name_t, name) - 0usize];
    ["Offset of field: ngx_resolver_srv_name_t::priority"]
        [::std::mem::offset_of!(ngx_resolver_srv_name_t, priority) - 16usize];
    ["Offset of field: ngx_resolver_srv_name_t::weight"]
        [::std::mem::offset_of!(ngx_resolver_srv_name_t, weight) - 18usize];
    ["Offset of field: ngx_resolver_srv_name_t::port"]
        [::std::mem::offset_of!(ngx_resolver_srv_name_t, port) - 20usize];
    ["Offset of field: ngx_resolver_srv_name_t::ctx"]
        [::std::mem::offset_of!(ngx_resolver_srv_name_t, ctx) - 24usize];
    ["Offset of field: ngx_resolver_srv_name_t::state"]
        [::std::mem::offset_of!(ngx_resolver_srv_name_t, state) - 32usize];
    ["Offset of field: ngx_resolver_srv_name_t::naddrs"]
        [::std::mem::offset_of!(ngx_resolver_srv_name_t, naddrs) - 40usize];
    ["Offset of field: ngx_resolver_srv_name_t::addrs"]
        [::std::mem::offset_of!(ngx_resolver_srv_name_t, addrs) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_resolver_node_t {
    pub node: ngx_rbtree_node_t,
    pub queue: ngx_queue_t,
    pub name: *mut u_char,
    pub addr6: in6_addr,
    pub nlen: u_short,
    pub qlen: u_short,
    pub query: *mut u_char,
    pub query6: *mut u_char,
    pub u: ngx_resolver_node_t__bindgen_ty_1,
    pub code: u_char,
    pub naddrs: u_short,
    pub nsrvs: u_short,
    pub cnlen: u_short,
    pub u6: ngx_resolver_node_t__bindgen_ty_2,
    pub naddrs6: u_short,
    pub expire: time_t,
    pub valid: time_t,
    pub ttl: u32,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub last_connection: ngx_uint_t,
    pub waiting: *mut ngx_resolver_ctx_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ngx_resolver_node_t__bindgen_ty_1 {
    pub addr: in_addr_t,
    pub addrs: *mut in_addr_t,
    pub cname: *mut u_char,
    pub srvs: *mut ngx_resolver_srv_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_resolver_node_t__bindgen_ty_1"]
        [::std::mem::size_of::<ngx_resolver_node_t__bindgen_ty_1>() - 8usize];
    ["Alignment of ngx_resolver_node_t__bindgen_ty_1"]
        [::std::mem::align_of::<ngx_resolver_node_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: ngx_resolver_node_t__bindgen_ty_1::addr"]
        [::std::mem::offset_of!(ngx_resolver_node_t__bindgen_ty_1, addr) - 0usize];
    ["Offset of field: ngx_resolver_node_t__bindgen_ty_1::addrs"]
        [::std::mem::offset_of!(ngx_resolver_node_t__bindgen_ty_1, addrs) - 0usize];
    ["Offset of field: ngx_resolver_node_t__bindgen_ty_1::cname"]
        [::std::mem::offset_of!(ngx_resolver_node_t__bindgen_ty_1, cname) - 0usize];
    ["Offset of field: ngx_resolver_node_t__bindgen_ty_1::srvs"]
        [::std::mem::offset_of!(ngx_resolver_node_t__bindgen_ty_1, srvs) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union ngx_resolver_node_t__bindgen_ty_2 {
    pub addr6: in6_addr,
    pub addrs6: *mut in6_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_resolver_node_t__bindgen_ty_2"]
        [::std::mem::size_of::<ngx_resolver_node_t__bindgen_ty_2>() - 16usize];
    ["Alignment of ngx_resolver_node_t__bindgen_ty_2"]
        [::std::mem::align_of::<ngx_resolver_node_t__bindgen_ty_2>() - 8usize];
    ["Offset of field: ngx_resolver_node_t__bindgen_ty_2::addr6"]
        [::std::mem::offset_of!(ngx_resolver_node_t__bindgen_ty_2, addr6) - 0usize];
    ["Offset of field: ngx_resolver_node_t__bindgen_ty_2::addrs6"]
        [::std::mem::offset_of!(ngx_resolver_node_t__bindgen_ty_2, addrs6) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_resolver_node_t"][::std::mem::size_of::<ngx_resolver_node_t>() - 184usize];
    ["Alignment of ngx_resolver_node_t"][::std::mem::align_of::<ngx_resolver_node_t>() - 8usize];
    ["Offset of field: ngx_resolver_node_t::node"]
        [::std::mem::offset_of!(ngx_resolver_node_t, node) - 0usize];
    ["Offset of field: ngx_resolver_node_t::queue"]
        [::std::mem::offset_of!(ngx_resolver_node_t, queue) - 40usize];
    ["Offset of field: ngx_resolver_node_t::name"]
        [::std::mem::offset_of!(ngx_resolver_node_t, name) - 56usize];
    ["Offset of field: ngx_resolver_node_t::addr6"]
        [::std::mem::offset_of!(ngx_resolver_node_t, addr6) - 64usize];
    ["Offset of field: ngx_resolver_node_t::nlen"]
        [::std::mem::offset_of!(ngx_resolver_node_t, nlen) - 80usize];
    ["Offset of field: ngx_resolver_node_t::qlen"]
        [::std::mem::offset_of!(ngx_resolver_node_t, qlen) - 82usize];
    ["Offset of field: ngx_resolver_node_t::query"]
        [::std::mem::offset_of!(ngx_resolver_node_t, query) - 88usize];
    ["Offset of field: ngx_resolver_node_t::query6"]
        [::std::mem::offset_of!(ngx_resolver_node_t, query6) - 96usize];
    ["Offset of field: ngx_resolver_node_t::u"]
        [::std::mem::offset_of!(ngx_resolver_node_t, u) - 104usize];
    ["Offset of field: ngx_resolver_node_t::code"]
        [::std::mem::offset_of!(ngx_resolver_node_t, code) - 112usize];
    ["Offset of field: ngx_resolver_node_t::naddrs"]
        [::std::mem::offset_of!(ngx_resolver_node_t, naddrs) - 114usize];
    ["Offset of field: ngx_resolver_node_t::nsrvs"]
        [::std::mem::offset_of!(ngx_resolver_node_t, nsrvs) - 116usize];
    ["Offset of field: ngx_resolver_node_t::cnlen"]
        [::std::mem::offset_of!(ngx_resolver_node_t, cnlen) - 118usize];
    ["Offset of field: ngx_resolver_node_t::u6"]
        [::std::mem::offset_of!(ngx_resolver_node_t, u6) - 120usize];
    ["Offset of field: ngx_resolver_node_t::naddrs6"]
        [::std::mem::offset_of!(ngx_resolver_node_t, naddrs6) - 136usize];
    ["Offset of field: ngx_resolver_node_t::expire"]
        [::std::mem::offset_of!(ngx_resolver_node_t, expire) - 144usize];
    ["Offset of field: ngx_resolver_node_t::valid"]
        [::std::mem::offset_of!(ngx_resolver_node_t, valid) - 152usize];
    ["Offset of field: ngx_resolver_node_t::ttl"]
        [::std::mem::offset_of!(ngx_resolver_node_t, ttl) - 160usize];
    ["Offset of field: ngx_resolver_node_t::last_connection"]
        [::std::mem::offset_of!(ngx_resolver_node_t, last_connection) - 168usize];
    ["Offset of field: ngx_resolver_node_t::waiting"]
        [::std::mem::offset_of!(ngx_resolver_node_t, waiting) - 176usize];
};
impl ngx_resolver_node_t {
    #[inline]
    pub fn tcp(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_tcp(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn tcp_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_tcp_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn tcp6(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_tcp6(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn tcp6_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_tcp6_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        tcp: ::std::os::raw::c_uint,
        tcp6: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let tcp: u32 = unsafe { ::std::mem::transmute(tcp) };
            tcp as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let tcp6: u32 = unsafe { ::std::mem::transmute(tcp6) };
            tcp6 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_s {
    pub event: *mut ngx_event_t,
    pub dummy: *mut ::std::os::raw::c_void,
    pub log: *mut ngx_log_t,
    pub ident: ngx_int_t,
    pub connections: ngx_array_t,
    pub last_connection: ngx_uint_t,
    pub name_rbtree: ngx_rbtree_t,
    pub name_sentinel: ngx_rbtree_node_t,
    pub srv_rbtree: ngx_rbtree_t,
    pub srv_sentinel: ngx_rbtree_node_t,
    pub addr_rbtree: ngx_rbtree_t,
    pub addr_sentinel: ngx_rbtree_node_t,
    pub name_resend_queue: ngx_queue_t,
    pub srv_resend_queue: ngx_queue_t,
    pub addr_resend_queue: ngx_queue_t,
    pub name_expire_queue: ngx_queue_t,
    pub srv_expire_queue: ngx_queue_t,
    pub addr_expire_queue: ngx_queue_t,
    pub ipv6: ngx_uint_t,
    pub addr6_rbtree: ngx_rbtree_t,
    pub addr6_sentinel: ngx_rbtree_node_t,
    pub addr6_resend_queue: ngx_queue_t,
    pub addr6_expire_queue: ngx_queue_t,
    pub resend_timeout: time_t,
    pub tcp_timeout: time_t,
    pub expire: time_t,
    pub valid: time_t,
    pub log_level: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_resolver_s"][::std::mem::size_of::<ngx_resolver_s>() - 512usize];
    ["Alignment of ngx_resolver_s"][::std::mem::align_of::<ngx_resolver_s>() - 8usize];
    ["Offset of field: ngx_resolver_s::event"]
        [::std::mem::offset_of!(ngx_resolver_s, event) - 0usize];
    ["Offset of field: ngx_resolver_s::dummy"]
        [::std::mem::offset_of!(ngx_resolver_s, dummy) - 8usize];
    ["Offset of field: ngx_resolver_s::log"][::std::mem::offset_of!(ngx_resolver_s, log) - 16usize];
    ["Offset of field: ngx_resolver_s::ident"]
        [::std::mem::offset_of!(ngx_resolver_s, ident) - 24usize];
    ["Offset of field: ngx_resolver_s::connections"]
        [::std::mem::offset_of!(ngx_resolver_s, connections) - 32usize];
    ["Offset of field: ngx_resolver_s::last_connection"]
        [::std::mem::offset_of!(ngx_resolver_s, last_connection) - 72usize];
    ["Offset of field: ngx_resolver_s::name_rbtree"]
        [::std::mem::offset_of!(ngx_resolver_s, name_rbtree) - 80usize];
    ["Offset of field: ngx_resolver_s::name_sentinel"]
        [::std::mem::offset_of!(ngx_resolver_s, name_sentinel) - 104usize];
    ["Offset of field: ngx_resolver_s::srv_rbtree"]
        [::std::mem::offset_of!(ngx_resolver_s, srv_rbtree) - 144usize];
    ["Offset of field: ngx_resolver_s::srv_sentinel"]
        [::std::mem::offset_of!(ngx_resolver_s, srv_sentinel) - 168usize];
    ["Offset of field: ngx_resolver_s::addr_rbtree"]
        [::std::mem::offset_of!(ngx_resolver_s, addr_rbtree) - 208usize];
    ["Offset of field: ngx_resolver_s::addr_sentinel"]
        [::std::mem::offset_of!(ngx_resolver_s, addr_sentinel) - 232usize];
    ["Offset of field: ngx_resolver_s::name_resend_queue"]
        [::std::mem::offset_of!(ngx_resolver_s, name_resend_queue) - 272usize];
    ["Offset of field: ngx_resolver_s::srv_resend_queue"]
        [::std::mem::offset_of!(ngx_resolver_s, srv_resend_queue) - 288usize];
    ["Offset of field: ngx_resolver_s::addr_resend_queue"]
        [::std::mem::offset_of!(ngx_resolver_s, addr_resend_queue) - 304usize];
    ["Offset of field: ngx_resolver_s::name_expire_queue"]
        [::std::mem::offset_of!(ngx_resolver_s, name_expire_queue) - 320usize];
    ["Offset of field: ngx_resolver_s::srv_expire_queue"]
        [::std::mem::offset_of!(ngx_resolver_s, srv_expire_queue) - 336usize];
    ["Offset of field: ngx_resolver_s::addr_expire_queue"]
        [::std::mem::offset_of!(ngx_resolver_s, addr_expire_queue) - 352usize];
    ["Offset of field: ngx_resolver_s::ipv6"]
        [::std::mem::offset_of!(ngx_resolver_s, ipv6) - 368usize];
    ["Offset of field: ngx_resolver_s::addr6_rbtree"]
        [::std::mem::offset_of!(ngx_resolver_s, addr6_rbtree) - 376usize];
    ["Offset of field: ngx_resolver_s::addr6_sentinel"]
        [::std::mem::offset_of!(ngx_resolver_s, addr6_sentinel) - 400usize];
    ["Offset of field: ngx_resolver_s::addr6_resend_queue"]
        [::std::mem::offset_of!(ngx_resolver_s, addr6_resend_queue) - 440usize];
    ["Offset of field: ngx_resolver_s::addr6_expire_queue"]
        [::std::mem::offset_of!(ngx_resolver_s, addr6_expire_queue) - 456usize];
    ["Offset of field: ngx_resolver_s::resend_timeout"]
        [::std::mem::offset_of!(ngx_resolver_s, resend_timeout) - 472usize];
    ["Offset of field: ngx_resolver_s::tcp_timeout"]
        [::std::mem::offset_of!(ngx_resolver_s, tcp_timeout) - 480usize];
    ["Offset of field: ngx_resolver_s::expire"]
        [::std::mem::offset_of!(ngx_resolver_s, expire) - 488usize];
    ["Offset of field: ngx_resolver_s::valid"]
        [::std::mem::offset_of!(ngx_resolver_s, valid) - 496usize];
    ["Offset of field: ngx_resolver_s::log_level"]
        [::std::mem::offset_of!(ngx_resolver_s, log_level) - 504usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_ctx_s {
    pub next: *mut ngx_resolver_ctx_t,
    pub resolver: *mut ngx_resolver_t,
    pub node: *mut ngx_resolver_node_t,
    pub ident: ngx_int_t,
    pub state: ngx_int_t,
    pub name: ngx_str_t,
    pub service: ngx_str_t,
    pub valid: time_t,
    pub naddrs: ngx_uint_t,
    pub addrs: *mut ngx_resolver_addr_t,
    pub addr: ngx_resolver_addr_t,
    pub sin: sockaddr_in,
    pub count: ngx_uint_t,
    pub nsrvs: ngx_uint_t,
    pub srvs: *mut ngx_resolver_srv_name_t,
    pub handler: ngx_resolver_handler_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub timeout: ngx_msec_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub recursion: ngx_uint_t,
    pub event: *mut ngx_event_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_resolver_ctx_s"][::std::mem::size_of::<ngx_resolver_ctx_s>() - 224usize];
    ["Alignment of ngx_resolver_ctx_s"][::std::mem::align_of::<ngx_resolver_ctx_s>() - 8usize];
    ["Offset of field: ngx_resolver_ctx_s::next"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, next) - 0usize];
    ["Offset of field: ngx_resolver_ctx_s::resolver"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, resolver) - 8usize];
    ["Offset of field: ngx_resolver_ctx_s::node"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, node) - 16usize];
    ["Offset of field: ngx_resolver_ctx_s::ident"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, ident) - 24usize];
    ["Offset of field: ngx_resolver_ctx_s::state"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, state) - 32usize];
    ["Offset of field: ngx_resolver_ctx_s::name"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, name) - 40usize];
    ["Offset of field: ngx_resolver_ctx_s::service"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, service) - 56usize];
    ["Offset of field: ngx_resolver_ctx_s::valid"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, valid) - 72usize];
    ["Offset of field: ngx_resolver_ctx_s::naddrs"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, naddrs) - 80usize];
    ["Offset of field: ngx_resolver_ctx_s::addrs"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, addrs) - 88usize];
    ["Offset of field: ngx_resolver_ctx_s::addr"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, addr) - 96usize];
    ["Offset of field: ngx_resolver_ctx_s::sin"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, sin) - 136usize];
    ["Offset of field: ngx_resolver_ctx_s::count"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, count) - 152usize];
    ["Offset of field: ngx_resolver_ctx_s::nsrvs"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, nsrvs) - 160usize];
    ["Offset of field: ngx_resolver_ctx_s::srvs"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, srvs) - 168usize];
    ["Offset of field: ngx_resolver_ctx_s::handler"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, handler) - 176usize];
    ["Offset of field: ngx_resolver_ctx_s::data"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, data) - 184usize];
    ["Offset of field: ngx_resolver_ctx_s::timeout"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, timeout) - 192usize];
    ["Offset of field: ngx_resolver_ctx_s::recursion"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, recursion) - 208usize];
    ["Offset of field: ngx_resolver_ctx_s::event"]
        [::std::mem::offset_of!(ngx_resolver_ctx_s, event) - 216usize];
};
impl ngx_resolver_ctx_s {
    #[inline]
    pub fn quick(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_quick(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn quick_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_quick_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn async_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_async(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn async__raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_async_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn cancelable(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cancelable(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn cancelable_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_cancelable_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        quick: ::std::os::raw::c_uint,
        async_: ::std::os::raw::c_uint,
        cancelable: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let quick: u32 = unsafe { ::std::mem::transmute(quick) };
            quick as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let async_: u32 = unsafe { ::std::mem::transmute(async_) };
            async_ as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let cancelable: u32 = unsafe { ::std::mem::transmute(cancelable) };
            cancelable as u64
        });
        __bindgen_bitfield_unit
    }
}
unsafe extern "C" {
    pub fn ngx_resolver_create(
        cf: *mut ngx_conf_t,
        names: *mut ngx_str_t,
        n: ngx_uint_t,
    ) -> *mut ngx_resolver_t;
}
unsafe extern "C" {
    pub fn ngx_resolve_start(
        r: *mut ngx_resolver_t,
        temp: *mut ngx_resolver_ctx_t,
    ) -> *mut ngx_resolver_ctx_t;
}
unsafe extern "C" {
    pub fn ngx_resolve_name(ctx: *mut ngx_resolver_ctx_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_resolve_name_done(ctx: *mut ngx_resolver_ctx_t);
}
unsafe extern "C" {
    pub fn ngx_resolve_addr(ctx: *mut ngx_resolver_ctx_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_resolve_addr_done(ctx: *mut ngx_resolver_ctx_t);
}
unsafe extern "C" {
    pub fn ngx_resolver_strerror(err: ngx_int_t) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_cache_manager_ctx_t {
    pub handler: ngx_event_handler_pt,
    pub name: *mut ::std::os::raw::c_char,
    pub delay: ngx_msec_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_cache_manager_ctx_t"][::std::mem::size_of::<ngx_cache_manager_ctx_t>() - 24usize];
    ["Alignment of ngx_cache_manager_ctx_t"]
        [::std::mem::align_of::<ngx_cache_manager_ctx_t>() - 8usize];
    ["Offset of field: ngx_cache_manager_ctx_t::handler"]
        [::std::mem::offset_of!(ngx_cache_manager_ctx_t, handler) - 0usize];
    ["Offset of field: ngx_cache_manager_ctx_t::name"]
        [::std::mem::offset_of!(ngx_cache_manager_ctx_t, name) - 8usize];
    ["Offset of field: ngx_cache_manager_ctx_t::delay"]
        [::std::mem::offset_of!(ngx_cache_manager_ctx_t, delay) - 16usize];
};
unsafe extern "C" {
    pub fn ngx_master_process_cycle(cycle: *mut ngx_cycle_t);
}
unsafe extern "C" {
    pub fn ngx_single_process_cycle(cycle: *mut ngx_cycle_t);
}
unsafe extern "C" {
    pub static mut ngx_process: ngx_uint_t;
}
unsafe extern "C" {
    pub static mut ngx_worker: ngx_uint_t;
}
unsafe extern "C" {
    pub static mut ngx_new_binary: ngx_pid_t;
}
unsafe extern "C" {
    pub static mut ngx_inherited: ngx_uint_t;
}
unsafe extern "C" {
    pub static mut ngx_daemonized: ngx_uint_t;
}
unsafe extern "C" {
    pub static mut ngx_exiting: ngx_uint_t;
}
unsafe extern "C" {
    pub static mut ngx_reap: sig_atomic_t;
}
unsafe extern "C" {
    pub static mut ngx_sigio: sig_atomic_t;
}
unsafe extern "C" {
    pub static mut ngx_sigalrm: sig_atomic_t;
}
unsafe extern "C" {
    pub static mut ngx_quit: sig_atomic_t;
}
unsafe extern "C" {
    pub static mut ngx_debug_quit: sig_atomic_t;
}
unsafe extern "C" {
    pub static mut ngx_terminate: sig_atomic_t;
}
unsafe extern "C" {
    pub static mut ngx_noaccept: sig_atomic_t;
}
unsafe extern "C" {
    pub static mut ngx_reconfigure: sig_atomic_t;
}
unsafe extern "C" {
    pub static mut ngx_reopen: sig_atomic_t;
}
unsafe extern "C" {
    pub static mut ngx_change_binary: sig_atomic_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_command_s {
    pub name: ngx_str_t,
    pub type_: ngx_uint_t,
    pub set: ::std::option::Option<
        unsafe extern "C" fn(
            cf: *mut ngx_conf_t,
            cmd: *mut ngx_command_t,
            conf: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub conf: ngx_uint_t,
    pub offset: ngx_uint_t,
    pub post: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_command_s"][::std::mem::size_of::<ngx_command_s>() - 56usize];
    ["Alignment of ngx_command_s"][::std::mem::align_of::<ngx_command_s>() - 8usize];
    ["Offset of field: ngx_command_s::name"][::std::mem::offset_of!(ngx_command_s, name) - 0usize];
    ["Offset of field: ngx_command_s::type_"]
        [::std::mem::offset_of!(ngx_command_s, type_) - 16usize];
    ["Offset of field: ngx_command_s::set"][::std::mem::offset_of!(ngx_command_s, set) - 24usize];
    ["Offset of field: ngx_command_s::conf"][::std::mem::offset_of!(ngx_command_s, conf) - 32usize];
    ["Offset of field: ngx_command_s::offset"]
        [::std::mem::offset_of!(ngx_command_s, offset) - 40usize];
    ["Offset of field: ngx_command_s::post"][::std::mem::offset_of!(ngx_command_s, post) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_open_file_s {
    pub fd: ngx_fd_t,
    pub name: ngx_str_t,
    pub flush: ::std::option::Option<
        unsafe extern "C" fn(file: *mut ngx_open_file_t, log: *mut ngx_log_t),
    >,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_open_file_s"][::std::mem::size_of::<ngx_open_file_s>() - 40usize];
    ["Alignment of ngx_open_file_s"][::std::mem::align_of::<ngx_open_file_s>() - 8usize];
    ["Offset of field: ngx_open_file_s::fd"][::std::mem::offset_of!(ngx_open_file_s, fd) - 0usize];
    ["Offset of field: ngx_open_file_s::name"]
        [::std::mem::offset_of!(ngx_open_file_s, name) - 8usize];
    ["Offset of field: ngx_open_file_s::flush"]
        [::std::mem::offset_of!(ngx_open_file_s, flush) - 24usize];
    ["Offset of field: ngx_open_file_s::data"]
        [::std::mem::offset_of!(ngx_open_file_s, data) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_conf_file_t {
    pub file: ngx_file_t,
    pub buffer: *mut ngx_buf_t,
    pub dump: *mut ngx_buf_t,
    pub line: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_conf_file_t"][::std::mem::size_of::<ngx_conf_file_t>() - 224usize];
    ["Alignment of ngx_conf_file_t"][::std::mem::align_of::<ngx_conf_file_t>() - 8usize];
    ["Offset of field: ngx_conf_file_t::file"]
        [::std::mem::offset_of!(ngx_conf_file_t, file) - 0usize];
    ["Offset of field: ngx_conf_file_t::buffer"]
        [::std::mem::offset_of!(ngx_conf_file_t, buffer) - 200usize];
    ["Offset of field: ngx_conf_file_t::dump"]
        [::std::mem::offset_of!(ngx_conf_file_t, dump) - 208usize];
    ["Offset of field: ngx_conf_file_t::line"]
        [::std::mem::offset_of!(ngx_conf_file_t, line) - 216usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_conf_dump_t {
    pub name: ngx_str_t,
    pub buffer: *mut ngx_buf_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_conf_dump_t"][::std::mem::size_of::<ngx_conf_dump_t>() - 24usize];
    ["Alignment of ngx_conf_dump_t"][::std::mem::align_of::<ngx_conf_dump_t>() - 8usize];
    ["Offset of field: ngx_conf_dump_t::name"]
        [::std::mem::offset_of!(ngx_conf_dump_t, name) - 0usize];
    ["Offset of field: ngx_conf_dump_t::buffer"]
        [::std::mem::offset_of!(ngx_conf_dump_t, buffer) - 16usize];
};
pub type ngx_conf_handler_pt = ::std::option::Option<
    unsafe extern "C" fn(
        cf: *mut ngx_conf_t,
        dummy: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_conf_s {
    pub name: *mut ::std::os::raw::c_char,
    pub args: *mut ngx_array_t,
    pub cycle: *mut ngx_cycle_t,
    pub pool: *mut ngx_pool_t,
    pub temp_pool: *mut ngx_pool_t,
    pub conf_file: *mut ngx_conf_file_t,
    pub log: *mut ngx_log_t,
    pub ctx: *mut ::std::os::raw::c_void,
    pub module_type: ngx_uint_t,
    pub cmd_type: ngx_uint_t,
    pub handler: ngx_conf_handler_pt,
    pub handler_conf: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_conf_s"][::std::mem::size_of::<ngx_conf_s>() - 96usize];
    ["Alignment of ngx_conf_s"][::std::mem::align_of::<ngx_conf_s>() - 8usize];
    ["Offset of field: ngx_conf_s::name"][::std::mem::offset_of!(ngx_conf_s, name) - 0usize];
    ["Offset of field: ngx_conf_s::args"][::std::mem::offset_of!(ngx_conf_s, args) - 8usize];
    ["Offset of field: ngx_conf_s::cycle"][::std::mem::offset_of!(ngx_conf_s, cycle) - 16usize];
    ["Offset of field: ngx_conf_s::pool"][::std::mem::offset_of!(ngx_conf_s, pool) - 24usize];
    ["Offset of field: ngx_conf_s::temp_pool"]
        [::std::mem::offset_of!(ngx_conf_s, temp_pool) - 32usize];
    ["Offset of field: ngx_conf_s::conf_file"]
        [::std::mem::offset_of!(ngx_conf_s, conf_file) - 40usize];
    ["Offset of field: ngx_conf_s::log"][::std::mem::offset_of!(ngx_conf_s, log) - 48usize];
    ["Offset of field: ngx_conf_s::ctx"][::std::mem::offset_of!(ngx_conf_s, ctx) - 56usize];
    ["Offset of field: ngx_conf_s::module_type"]
        [::std::mem::offset_of!(ngx_conf_s, module_type) - 64usize];
    ["Offset of field: ngx_conf_s::cmd_type"]
        [::std::mem::offset_of!(ngx_conf_s, cmd_type) - 72usize];
    ["Offset of field: ngx_conf_s::handler"][::std::mem::offset_of!(ngx_conf_s, handler) - 80usize];
    ["Offset of field: ngx_conf_s::handler_conf"]
        [::std::mem::offset_of!(ngx_conf_s, handler_conf) - 88usize];
};
pub type ngx_conf_post_handler_pt = ::std::option::Option<
    unsafe extern "C" fn(
        cf: *mut ngx_conf_t,
        data: *mut ::std::os::raw::c_void,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_conf_post_t {
    pub post_handler: ngx_conf_post_handler_pt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_conf_post_t"][::std::mem::size_of::<ngx_conf_post_t>() - 8usize];
    ["Alignment of ngx_conf_post_t"][::std::mem::align_of::<ngx_conf_post_t>() - 8usize];
    ["Offset of field: ngx_conf_post_t::post_handler"]
        [::std::mem::offset_of!(ngx_conf_post_t, post_handler) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_conf_deprecated_t {
    pub post_handler: ngx_conf_post_handler_pt,
    pub old_name: *mut ::std::os::raw::c_char,
    pub new_name: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_conf_deprecated_t"][::std::mem::size_of::<ngx_conf_deprecated_t>() - 24usize];
    ["Alignment of ngx_conf_deprecated_t"]
        [::std::mem::align_of::<ngx_conf_deprecated_t>() - 8usize];
    ["Offset of field: ngx_conf_deprecated_t::post_handler"]
        [::std::mem::offset_of!(ngx_conf_deprecated_t, post_handler) - 0usize];
    ["Offset of field: ngx_conf_deprecated_t::old_name"]
        [::std::mem::offset_of!(ngx_conf_deprecated_t, old_name) - 8usize];
    ["Offset of field: ngx_conf_deprecated_t::new_name"]
        [::std::mem::offset_of!(ngx_conf_deprecated_t, new_name) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_conf_num_bounds_t {
    pub post_handler: ngx_conf_post_handler_pt,
    pub low: ngx_int_t,
    pub high: ngx_int_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_conf_num_bounds_t"][::std::mem::size_of::<ngx_conf_num_bounds_t>() - 24usize];
    ["Alignment of ngx_conf_num_bounds_t"]
        [::std::mem::align_of::<ngx_conf_num_bounds_t>() - 8usize];
    ["Offset of field: ngx_conf_num_bounds_t::post_handler"]
        [::std::mem::offset_of!(ngx_conf_num_bounds_t, post_handler) - 0usize];
    ["Offset of field: ngx_conf_num_bounds_t::low"]
        [::std::mem::offset_of!(ngx_conf_num_bounds_t, low) - 8usize];
    ["Offset of field: ngx_conf_num_bounds_t::high"]
        [::std::mem::offset_of!(ngx_conf_num_bounds_t, high) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_conf_enum_t {
    pub name: ngx_str_t,
    pub value: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_conf_enum_t"][::std::mem::size_of::<ngx_conf_enum_t>() - 24usize];
    ["Alignment of ngx_conf_enum_t"][::std::mem::align_of::<ngx_conf_enum_t>() - 8usize];
    ["Offset of field: ngx_conf_enum_t::name"]
        [::std::mem::offset_of!(ngx_conf_enum_t, name) - 0usize];
    ["Offset of field: ngx_conf_enum_t::value"]
        [::std::mem::offset_of!(ngx_conf_enum_t, value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_conf_bitmask_t {
    pub name: ngx_str_t,
    pub mask: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_conf_bitmask_t"][::std::mem::size_of::<ngx_conf_bitmask_t>() - 24usize];
    ["Alignment of ngx_conf_bitmask_t"][::std::mem::align_of::<ngx_conf_bitmask_t>() - 8usize];
    ["Offset of field: ngx_conf_bitmask_t::name"]
        [::std::mem::offset_of!(ngx_conf_bitmask_t, name) - 0usize];
    ["Offset of field: ngx_conf_bitmask_t::mask"]
        [::std::mem::offset_of!(ngx_conf_bitmask_t, mask) - 16usize];
};
unsafe extern "C" {
    pub fn ngx_conf_deprecated(
        cf: *mut ngx_conf_t,
        post: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_check_num_bounds(
        cf: *mut ngx_conf_t,
        post: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_param(cf: *mut ngx_conf_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_parse(
        cf: *mut ngx_conf_t,
        filename: *mut ngx_str_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_include(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_full_name(
        cycle: *mut ngx_cycle_t,
        name: *mut ngx_str_t,
        conf_prefix: ngx_uint_t,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_conf_open_file(
        cycle: *mut ngx_cycle_t,
        name: *mut ngx_str_t,
    ) -> *mut ngx_open_file_t;
}
unsafe extern "C" {
    pub fn ngx_conf_log_error(
        level: ngx_uint_t,
        cf: *mut ngx_conf_t,
        err: ngx_err_t,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn ngx_conf_set_flag_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_str_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_str_array_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_keyval_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_num_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_size_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_off_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_msec_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_sec_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_bufs_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_enum_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ngx_conf_set_bitmask_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_module_s {
    pub ctx_index: ngx_uint_t,
    pub index: ngx_uint_t,
    pub name: *mut ::std::os::raw::c_char,
    pub spare0: ngx_uint_t,
    pub spare1: ngx_uint_t,
    pub version: ngx_uint_t,
    pub signature: *const ::std::os::raw::c_char,
    pub ctx: *mut ::std::os::raw::c_void,
    pub commands: *mut ngx_command_t,
    pub type_: ngx_uint_t,
    pub init_master: ::std::option::Option<unsafe extern "C" fn(log: *mut ngx_log_t) -> ngx_int_t>,
    pub init_module:
        ::std::option::Option<unsafe extern "C" fn(cycle: *mut ngx_cycle_t) -> ngx_int_t>,
    pub init_process:
        ::std::option::Option<unsafe extern "C" fn(cycle: *mut ngx_cycle_t) -> ngx_int_t>,
    pub init_thread:
        ::std::option::Option<unsafe extern "C" fn(cycle: *mut ngx_cycle_t) -> ngx_int_t>,
    pub exit_thread: ::std::option::Option<unsafe extern "C" fn(cycle: *mut ngx_cycle_t)>,
    pub exit_process: ::std::option::Option<unsafe extern "C" fn(cycle: *mut ngx_cycle_t)>,
    pub exit_master: ::std::option::Option<unsafe extern "C" fn(cycle: *mut ngx_cycle_t)>,
    pub spare_hook0: usize,
    pub spare_hook1: usize,
    pub spare_hook2: usize,
    pub spare_hook3: usize,
    pub spare_hook4: usize,
    pub spare_hook5: usize,
    pub spare_hook6: usize,
    pub spare_hook7: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_module_s"][::std::mem::size_of::<ngx_module_s>() - 200usize];
    ["Alignment of ngx_module_s"][::std::mem::align_of::<ngx_module_s>() - 8usize];
    ["Offset of field: ngx_module_s::ctx_index"]
        [::std::mem::offset_of!(ngx_module_s, ctx_index) - 0usize];
    ["Offset of field: ngx_module_s::index"][::std::mem::offset_of!(ngx_module_s, index) - 8usize];
    ["Offset of field: ngx_module_s::name"][::std::mem::offset_of!(ngx_module_s, name) - 16usize];
    ["Offset of field: ngx_module_s::spare0"]
        [::std::mem::offset_of!(ngx_module_s, spare0) - 24usize];
    ["Offset of field: ngx_module_s::spare1"]
        [::std::mem::offset_of!(ngx_module_s, spare1) - 32usize];
    ["Offset of field: ngx_module_s::version"]
        [::std::mem::offset_of!(ngx_module_s, version) - 40usize];
    ["Offset of field: ngx_module_s::signature"]
        [::std::mem::offset_of!(ngx_module_s, signature) - 48usize];
    ["Offset of field: ngx_module_s::ctx"][::std::mem::offset_of!(ngx_module_s, ctx) - 56usize];
    ["Offset of field: ngx_module_s::commands"]
        [::std::mem::offset_of!(ngx_module_s, commands) - 64usize];
    ["Offset of field: ngx_module_s::type_"][::std::mem::offset_of!(ngx_module_s, type_) - 72usize];
    ["Offset of field: ngx_module_s::init_master"]
        [::std::mem::offset_of!(ngx_module_s, init_master) - 80usize];
    ["Offset of field: ngx_module_s::init_module"]
        [::std::mem::offset_of!(ngx_module_s, init_module) - 88usize];
    ["Offset of field: ngx_module_s::init_process"]
        [::std::mem::offset_of!(ngx_module_s, init_process) - 96usize];
    ["Offset of field: ngx_module_s::init_thread"]
        [::std::mem::offset_of!(ngx_module_s, init_thread) - 104usize];
    ["Offset of field: ngx_module_s::exit_thread"]
        [::std::mem::offset_of!(ngx_module_s, exit_thread) - 112usize];
    ["Offset of field: ngx_module_s::exit_process"]
        [::std::mem::offset_of!(ngx_module_s, exit_process) - 120usize];
    ["Offset of field: ngx_module_s::exit_master"]
        [::std::mem::offset_of!(ngx_module_s, exit_master) - 128usize];
    ["Offset of field: ngx_module_s::spare_hook0"]
        [::std::mem::offset_of!(ngx_module_s, spare_hook0) - 136usize];
    ["Offset of field: ngx_module_s::spare_hook1"]
        [::std::mem::offset_of!(ngx_module_s, spare_hook1) - 144usize];
    ["Offset of field: ngx_module_s::spare_hook2"]
        [::std::mem::offset_of!(ngx_module_s, spare_hook2) - 152usize];
    ["Offset of field: ngx_module_s::spare_hook3"]
        [::std::mem::offset_of!(ngx_module_s, spare_hook3) - 160usize];
    ["Offset of field: ngx_module_s::spare_hook4"]
        [::std::mem::offset_of!(ngx_module_s, spare_hook4) - 168usize];
    ["Offset of field: ngx_module_s::spare_hook5"]
        [::std::mem::offset_of!(ngx_module_s, spare_hook5) - 176usize];
    ["Offset of field: ngx_module_s::spare_hook6"]
        [::std::mem::offset_of!(ngx_module_s, spare_hook6) - 184usize];
    ["Offset of field: ngx_module_s::spare_hook7"]
        [::std::mem::offset_of!(ngx_module_s, spare_hook7) - 192usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_core_module_t {
    pub name: ngx_str_t,
    pub create_conf: ::std::option::Option<
        unsafe extern "C" fn(cycle: *mut ngx_cycle_t) -> *mut ::std::os::raw::c_void,
    >,
    pub init_conf: ::std::option::Option<
        unsafe extern "C" fn(
            cycle: *mut ngx_cycle_t,
            conf: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_char,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_core_module_t"][::std::mem::size_of::<ngx_core_module_t>() - 32usize];
    ["Alignment of ngx_core_module_t"][::std::mem::align_of::<ngx_core_module_t>() - 8usize];
    ["Offset of field: ngx_core_module_t::name"]
        [::std::mem::offset_of!(ngx_core_module_t, name) - 0usize];
    ["Offset of field: ngx_core_module_t::create_conf"]
        [::std::mem::offset_of!(ngx_core_module_t, create_conf) - 16usize];
    ["Offset of field: ngx_core_module_t::init_conf"]
        [::std::mem::offset_of!(ngx_core_module_t, init_conf) - 24usize];
};
unsafe extern "C" {
    pub fn ngx_preinit_modules() -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_cycle_modules(cycle: *mut ngx_cycle_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_init_modules(cycle: *mut ngx_cycle_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_count_modules(cycle: *mut ngx_cycle_t, type_: ngx_uint_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_add_module(
        cf: *mut ngx_conf_t,
        file: *mut ngx_str_t,
        module: *mut ngx_module_t,
        order: *mut *mut ::std::os::raw::c_char,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub static mut ngx_modules: [*mut ngx_module_t; 0usize];
}
unsafe extern "C" {
    pub static mut ngx_max_module: ngx_uint_t;
}
unsafe extern "C" {
    pub static mut ngx_module_names: [*mut ::std::os::raw::c_char; 0usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_open_file_info_t {
    pub fd: ngx_fd_t,
    pub uniq: ngx_file_uniq_t,
    pub mtime: time_t,
    pub size: off_t,
    pub fs_size: off_t,
    pub directio: off_t,
    pub read_ahead: usize,
    pub err: ngx_err_t,
    pub failed: *mut ::std::os::raw::c_char,
    pub valid: time_t,
    pub min_uses: ngx_uint_t,
    pub disable_symlinks_from: usize,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: [u16; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_open_file_info_t"][::std::mem::size_of::<ngx_open_file_info_t>() - 104usize];
    ["Alignment of ngx_open_file_info_t"][::std::mem::align_of::<ngx_open_file_info_t>() - 8usize];
    ["Offset of field: ngx_open_file_info_t::fd"]
        [::std::mem::offset_of!(ngx_open_file_info_t, fd) - 0usize];
    ["Offset of field: ngx_open_file_info_t::uniq"]
        [::std::mem::offset_of!(ngx_open_file_info_t, uniq) - 8usize];
    ["Offset of field: ngx_open_file_info_t::mtime"]
        [::std::mem::offset_of!(ngx_open_file_info_t, mtime) - 16usize];
    ["Offset of field: ngx_open_file_info_t::size"]
        [::std::mem::offset_of!(ngx_open_file_info_t, size) - 24usize];
    ["Offset of field: ngx_open_file_info_t::fs_size"]
        [::std::mem::offset_of!(ngx_open_file_info_t, fs_size) - 32usize];
    ["Offset of field: ngx_open_file_info_t::directio"]
        [::std::mem::offset_of!(ngx_open_file_info_t, directio) - 40usize];
    ["Offset of field: ngx_open_file_info_t::read_ahead"]
        [::std::mem::offset_of!(ngx_open_file_info_t, read_ahead) - 48usize];
    ["Offset of field: ngx_open_file_info_t::err"]
        [::std::mem::offset_of!(ngx_open_file_info_t, err) - 56usize];
    ["Offset of field: ngx_open_file_info_t::failed"]
        [::std::mem::offset_of!(ngx_open_file_info_t, failed) - 64usize];
    ["Offset of field: ngx_open_file_info_t::valid"]
        [::std::mem::offset_of!(ngx_open_file_info_t, valid) - 72usize];
    ["Offset of field: ngx_open_file_info_t::min_uses"]
        [::std::mem::offset_of!(ngx_open_file_info_t, min_uses) - 80usize];
    ["Offset of field: ngx_open_file_info_t::disable_symlinks_from"]
        [::std::mem::offset_of!(ngx_open_file_info_t, disable_symlinks_from) - 88usize];
};
impl ngx_open_file_info_t {
    #[inline]
    pub fn disable_symlinks(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_disable_symlinks(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn disable_symlinks_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_disable_symlinks_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn test_dir(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_test_dir(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn test_dir_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_test_dir_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn test_only(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_test_only(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn test_only_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_test_only_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn log(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_log(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn log_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_log_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn errors(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_errors(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn errors_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_errors_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn events(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_events(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn events_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_events_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_dir(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_dir(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_dir_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_dir_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_file(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_file(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_file_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_file_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_link(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_link(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_link_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_link_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_exec(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_exec(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_exec_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_exec_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_directio(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_directio(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_directio_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_directio_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        disable_symlinks: ::std::os::raw::c_uint,
        test_dir: ::std::os::raw::c_uint,
        test_only: ::std::os::raw::c_uint,
        log: ::std::os::raw::c_uint,
        errors: ::std::os::raw::c_uint,
        events: ::std::os::raw::c_uint,
        is_dir: ::std::os::raw::c_uint,
        is_file: ::std::os::raw::c_uint,
        is_link: ::std::os::raw::c_uint,
        is_exec: ::std::os::raw::c_uint,
        is_directio: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let disable_symlinks: u32 = unsafe { ::std::mem::transmute(disable_symlinks) };
            disable_symlinks as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let test_dir: u32 = unsafe { ::std::mem::transmute(test_dir) };
            test_dir as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let test_only: u32 = unsafe { ::std::mem::transmute(test_only) };
            test_only as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let log: u32 = unsafe { ::std::mem::transmute(log) };
            log as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let errors: u32 = unsafe { ::std::mem::transmute(errors) };
            errors as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let events: u32 = unsafe { ::std::mem::transmute(events) };
            events as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let is_dir: u32 = unsafe { ::std::mem::transmute(is_dir) };
            is_dir as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let is_file: u32 = unsafe { ::std::mem::transmute(is_file) };
            is_file as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let is_link: u32 = unsafe { ::std::mem::transmute(is_link) };
            is_link as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let is_exec: u32 = unsafe { ::std::mem::transmute(is_exec) };
            is_exec as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let is_directio: u32 = unsafe { ::std::mem::transmute(is_directio) };
            is_directio as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type ngx_cached_open_file_t = ngx_cached_open_file_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_cached_open_file_s {
    pub node: ngx_rbtree_node_t,
    pub queue: ngx_queue_t,
    pub name: *mut u_char,
    pub created: time_t,
    pub accessed: time_t,
    pub fd: ngx_fd_t,
    pub uniq: ngx_file_uniq_t,
    pub mtime: time_t,
    pub size: off_t,
    pub err: ngx_err_t,
    pub uses: u32,
    pub disable_symlinks_from: usize,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 5usize]>,
    pub event: *mut ngx_event_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_cached_open_file_s"][::std::mem::size_of::<ngx_cached_open_file_s>() - 144usize];
    ["Alignment of ngx_cached_open_file_s"]
        [::std::mem::align_of::<ngx_cached_open_file_s>() - 8usize];
    ["Offset of field: ngx_cached_open_file_s::node"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, node) - 0usize];
    ["Offset of field: ngx_cached_open_file_s::queue"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, queue) - 40usize];
    ["Offset of field: ngx_cached_open_file_s::name"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, name) - 56usize];
    ["Offset of field: ngx_cached_open_file_s::created"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, created) - 64usize];
    ["Offset of field: ngx_cached_open_file_s::accessed"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, accessed) - 72usize];
    ["Offset of field: ngx_cached_open_file_s::fd"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, fd) - 80usize];
    ["Offset of field: ngx_cached_open_file_s::uniq"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, uniq) - 88usize];
    ["Offset of field: ngx_cached_open_file_s::mtime"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, mtime) - 96usize];
    ["Offset of field: ngx_cached_open_file_s::size"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, size) - 104usize];
    ["Offset of field: ngx_cached_open_file_s::err"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, err) - 112usize];
    ["Offset of field: ngx_cached_open_file_s::uses"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, uses) - 116usize];
    ["Offset of field: ngx_cached_open_file_s::disable_symlinks_from"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, disable_symlinks_from) - 120usize];
    ["Offset of field: ngx_cached_open_file_s::event"]
        [::std::mem::offset_of!(ngx_cached_open_file_s, event) - 136usize];
};
impl ngx_cached_open_file_s {
    #[inline]
    pub fn disable_symlinks(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_disable_symlinks(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn disable_symlinks_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 5usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_disable_symlinks_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 5usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn count(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_count(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn count_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 5usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                24u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_count_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 5usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                24u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn close(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(26usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_close(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(26usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn close_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 5usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                26usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_close_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 5usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                26usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn use_event(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_use_event(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn use_event_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 5usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                27usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_use_event_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 5usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                27usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_dir(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_dir(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_dir_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 5usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                28usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_dir_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 5usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_file(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_file(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_file_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 5usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                29usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_file_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 5usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                29usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_link(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_link(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_link_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 5usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                30usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_link_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 5usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_exec(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_exec(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_exec_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 5usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                31usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_exec_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 5usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_directio(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_directio(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_directio_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 5usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                32usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_directio_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 5usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                32usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        disable_symlinks: ::std::os::raw::c_uint,
        count: ::std::os::raw::c_uint,
        close: ::std::os::raw::c_uint,
        use_event: ::std::os::raw::c_uint,
        is_dir: ::std::os::raw::c_uint,
        is_file: ::std::os::raw::c_uint,
        is_link: ::std::os::raw::c_uint,
        is_exec: ::std::os::raw::c_uint,
        is_directio: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 5usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 5usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let disable_symlinks: u32 = unsafe { ::std::mem::transmute(disable_symlinks) };
            disable_symlinks as u64
        });
        __bindgen_bitfield_unit.set(2usize, 24u8, {
            let count: u32 = unsafe { ::std::mem::transmute(count) };
            count as u64
        });
        __bindgen_bitfield_unit.set(26usize, 1u8, {
            let close: u32 = unsafe { ::std::mem::transmute(close) };
            close as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let use_event: u32 = unsafe { ::std::mem::transmute(use_event) };
            use_event as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let is_dir: u32 = unsafe { ::std::mem::transmute(is_dir) };
            is_dir as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let is_file: u32 = unsafe { ::std::mem::transmute(is_file) };
            is_file as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let is_link: u32 = unsafe { ::std::mem::transmute(is_link) };
            is_link as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let is_exec: u32 = unsafe { ::std::mem::transmute(is_exec) };
            is_exec as u64
        });
        __bindgen_bitfield_unit.set(32usize, 1u8, {
            let is_directio: u32 = unsafe { ::std::mem::transmute(is_directio) };
            is_directio as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_open_file_cache_t {
    pub rbtree: ngx_rbtree_t,
    pub sentinel: ngx_rbtree_node_t,
    pub expire_queue: ngx_queue_t,
    pub current: ngx_uint_t,
    pub max: ngx_uint_t,
    pub inactive: time_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_open_file_cache_t"][::std::mem::size_of::<ngx_open_file_cache_t>() - 104usize];
    ["Alignment of ngx_open_file_cache_t"]
        [::std::mem::align_of::<ngx_open_file_cache_t>() - 8usize];
    ["Offset of field: ngx_open_file_cache_t::rbtree"]
        [::std::mem::offset_of!(ngx_open_file_cache_t, rbtree) - 0usize];
    ["Offset of field: ngx_open_file_cache_t::sentinel"]
        [::std::mem::offset_of!(ngx_open_file_cache_t, sentinel) - 24usize];
    ["Offset of field: ngx_open_file_cache_t::expire_queue"]
        [::std::mem::offset_of!(ngx_open_file_cache_t, expire_queue) - 64usize];
    ["Offset of field: ngx_open_file_cache_t::current"]
        [::std::mem::offset_of!(ngx_open_file_cache_t, current) - 80usize];
    ["Offset of field: ngx_open_file_cache_t::max"]
        [::std::mem::offset_of!(ngx_open_file_cache_t, max) - 88usize];
    ["Offset of field: ngx_open_file_cache_t::inactive"]
        [::std::mem::offset_of!(ngx_open_file_cache_t, inactive) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_open_file_cache_cleanup_t {
    pub cache: *mut ngx_open_file_cache_t,
    pub file: *mut ngx_cached_open_file_t,
    pub min_uses: ngx_uint_t,
    pub log: *mut ngx_log_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_open_file_cache_cleanup_t"]
        [::std::mem::size_of::<ngx_open_file_cache_cleanup_t>() - 32usize];
    ["Alignment of ngx_open_file_cache_cleanup_t"]
        [::std::mem::align_of::<ngx_open_file_cache_cleanup_t>() - 8usize];
    ["Offset of field: ngx_open_file_cache_cleanup_t::cache"]
        [::std::mem::offset_of!(ngx_open_file_cache_cleanup_t, cache) - 0usize];
    ["Offset of field: ngx_open_file_cache_cleanup_t::file"]
        [::std::mem::offset_of!(ngx_open_file_cache_cleanup_t, file) - 8usize];
    ["Offset of field: ngx_open_file_cache_cleanup_t::min_uses"]
        [::std::mem::offset_of!(ngx_open_file_cache_cleanup_t, min_uses) - 16usize];
    ["Offset of field: ngx_open_file_cache_cleanup_t::log"]
        [::std::mem::offset_of!(ngx_open_file_cache_cleanup_t, log) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_open_file_cache_event_t {
    pub data: *mut ::std::os::raw::c_void,
    pub read: *mut ngx_event_t,
    pub write: *mut ngx_event_t,
    pub fd: ngx_fd_t,
    pub file: *mut ngx_cached_open_file_t,
    pub cache: *mut ngx_open_file_cache_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_open_file_cache_event_t"]
        [::std::mem::size_of::<ngx_open_file_cache_event_t>() - 48usize];
    ["Alignment of ngx_open_file_cache_event_t"]
        [::std::mem::align_of::<ngx_open_file_cache_event_t>() - 8usize];
    ["Offset of field: ngx_open_file_cache_event_t::data"]
        [::std::mem::offset_of!(ngx_open_file_cache_event_t, data) - 0usize];
    ["Offset of field: ngx_open_file_cache_event_t::read"]
        [::std::mem::offset_of!(ngx_open_file_cache_event_t, read) - 8usize];
    ["Offset of field: ngx_open_file_cache_event_t::write"]
        [::std::mem::offset_of!(ngx_open_file_cache_event_t, write) - 16usize];
    ["Offset of field: ngx_open_file_cache_event_t::fd"]
        [::std::mem::offset_of!(ngx_open_file_cache_event_t, fd) - 24usize];
    ["Offset of field: ngx_open_file_cache_event_t::file"]
        [::std::mem::offset_of!(ngx_open_file_cache_event_t, file) - 32usize];
    ["Offset of field: ngx_open_file_cache_event_t::cache"]
        [::std::mem::offset_of!(ngx_open_file_cache_event_t, cache) - 40usize];
};
unsafe extern "C" {
    pub fn ngx_open_file_cache_init(
        pool: *mut ngx_pool_t,
        max: ngx_uint_t,
        inactive: time_t,
    ) -> *mut ngx_open_file_cache_t;
}
unsafe extern "C" {
    pub fn ngx_open_cached_file(
        cache: *mut ngx_open_file_cache_t,
        name: *mut ngx_str_t,
        of: *mut ngx_open_file_info_t,
        pool: *mut ngx_pool_t,
    ) -> ngx_int_t;
}
pub type ngx_recv_pt = ::std::option::Option<
    unsafe extern "C" fn(c: *mut ngx_connection_t, buf: *mut u_char, size: usize) -> isize,
>;
pub type ngx_recv_chain_pt = ::std::option::Option<
    unsafe extern "C" fn(c: *mut ngx_connection_t, in_: *mut ngx_chain_t, limit: off_t) -> isize,
>;
pub type ngx_send_pt = ::std::option::Option<
    unsafe extern "C" fn(c: *mut ngx_connection_t, buf: *mut u_char, size: usize) -> isize,
>;
pub type ngx_send_chain_pt = ::std::option::Option<
    unsafe extern "C" fn(
        c: *mut ngx_connection_t,
        in_: *mut ngx_chain_t,
        limit: off_t,
    ) -> *mut ngx_chain_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_os_io_t {
    pub recv: ngx_recv_pt,
    pub recv_chain: ngx_recv_chain_pt,
    pub udp_recv: ngx_recv_pt,
    pub send: ngx_send_pt,
    pub udp_send: ngx_send_pt,
    pub udp_send_chain: ngx_send_chain_pt,
    pub send_chain: ngx_send_chain_pt,
    pub flags: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_os_io_t"][::std::mem::size_of::<ngx_os_io_t>() - 64usize];
    ["Alignment of ngx_os_io_t"][::std::mem::align_of::<ngx_os_io_t>() - 8usize];
    ["Offset of field: ngx_os_io_t::recv"][::std::mem::offset_of!(ngx_os_io_t, recv) - 0usize];
    ["Offset of field: ngx_os_io_t::recv_chain"]
        [::std::mem::offset_of!(ngx_os_io_t, recv_chain) - 8usize];
    ["Offset of field: ngx_os_io_t::udp_recv"]
        [::std::mem::offset_of!(ngx_os_io_t, udp_recv) - 16usize];
    ["Offset of field: ngx_os_io_t::send"][::std::mem::offset_of!(ngx_os_io_t, send) - 24usize];
    ["Offset of field: ngx_os_io_t::udp_send"]
        [::std::mem::offset_of!(ngx_os_io_t, udp_send) - 32usize];
    ["Offset of field: ngx_os_io_t::udp_send_chain"]
        [::std::mem::offset_of!(ngx_os_io_t, udp_send_chain) - 40usize];
    ["Offset of field: ngx_os_io_t::send_chain"]
        [::std::mem::offset_of!(ngx_os_io_t, send_chain) - 48usize];
    ["Offset of field: ngx_os_io_t::flags"][::std::mem::offset_of!(ngx_os_io_t, flags) - 56usize];
};
unsafe extern "C" {
    pub fn ngx_os_init(log: *mut ngx_log_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_os_status(log: *mut ngx_log_t);
}
unsafe extern "C" {
    pub fn ngx_os_specific_init(log: *mut ngx_log_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_os_specific_status(log: *mut ngx_log_t);
}
unsafe extern "C" {
    pub fn ngx_daemon(log: *mut ngx_log_t) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_os_signal_process(
        cycle: *mut ngx_cycle_t,
        sig: *mut ::std::os::raw::c_char,
        pid: ngx_pid_t,
    ) -> ngx_int_t;
}
unsafe extern "C" {
    pub fn ngx_unix_recv(c: *mut ngx_connection_t, buf: *mut u_char, size: usize) -> isize;
}
unsafe extern "C" {
    pub fn ngx_readv_chain(
        c: *mut ngx_connection_t,
        entry: *mut ngx_chain_t,
        limit: off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn ngx_udp_unix_recv(c: *mut ngx_connection_t, buf: *mut u_char, size: usize) -> isize;
}
unsafe extern "C" {
    pub fn ngx_unix_send(c: *mut ngx_connection_t, buf: *mut u_char, size: usize) -> isize;
}
unsafe extern "C" {
    pub fn ngx_writev_chain(
        c: *mut ngx_connection_t,
        in_: *mut ngx_chain_t,
        limit: off_t,
    ) -> *mut ngx_chain_t;
}
unsafe extern "C" {
    pub fn ngx_udp_unix_send(c: *mut ngx_connection_t, buf: *mut u_char, size: usize) -> isize;
}
unsafe extern "C" {
    pub fn ngx_udp_unix_sendmsg_chain(
        c: *mut ngx_connection_t,
        in_: *mut ngx_chain_t,
        limit: off_t,
    ) -> *mut ngx_chain_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_iovec_t {
    pub iovs: *mut iovec,
    pub count: ngx_uint_t,
    pub size: usize,
    pub nalloc: ngx_uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_iovec_t"][::std::mem::size_of::<ngx_iovec_t>() - 32usize];
    ["Alignment of ngx_iovec_t"][::std::mem::align_of::<ngx_iovec_t>() - 8usize];
    ["Offset of field: ngx_iovec_t::iovs"][::std::mem::offset_of!(ngx_iovec_t, iovs) - 0usize];
    ["Offset of field: ngx_iovec_t::count"][::std::mem::offset_of!(ngx_iovec_t, count) - 8usize];
    ["Offset of field: ngx_iovec_t::size"][::std::mem::offset_of!(ngx_iovec_t, size) - 16usize];
    ["Offset of field: ngx_iovec_t::nalloc"][::std::mem::offset_of!(ngx_iovec_t, nalloc) - 24usize];
};
unsafe extern "C" {
    pub fn ngx_output_chain_to_iovec(
        vec: *mut ngx_iovec_t,
        in_: *mut ngx_chain_t,
        limit: usize,
        log: *mut ngx_log_t,
    ) -> *mut ngx_chain_t;
}
unsafe extern "C" {
    pub fn ngx_writev(c: *mut ngx_connection_t, vec: *mut ngx_iovec_t) -> isize;
}
unsafe extern "C" {
    pub static mut ngx_os_io: ngx_os_io_t;
}
unsafe extern "C" {
    pub static mut ngx_ncpu: ngx_int_t;
}
unsafe extern "C" {
    pub static mut ngx_max_sockets: ngx_int_t;
}
unsafe extern "C" {
    pub static mut ngx_inherited_nonblocking: ngx_uint_t;
}
unsafe extern "C" {
    pub static mut ngx_tcp_nodelay_and_tcp_nopush: ngx_uint_t;
}
unsafe extern "C" {
    pub fn ngx_linux_sendfile_chain(
        c: *mut ngx_connection_t,
        in_: *mut ngx_chain_t,
        limit: off_t,
    ) -> *mut ngx_chain_t;
}
pub type ngx_listening_t = ngx_listening_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_listening_s {
    pub fd: ngx_socket_t,
    pub sockaddr: *mut sockaddr,
    pub socklen: socklen_t,
    pub addr_text_max_len: usize,
    pub addr_text: ngx_str_t,
    pub type_: ::std::os::raw::c_int,
    pub backlog: ::std::os::raw::c_int,
    pub rcvbuf: ::std::os::raw::c_int,
    pub sndbuf: ::std::os::raw::c_int,
    pub keepidle: ::std::os::raw::c_int,
    pub keepintvl: ::std::os::raw::c_int,
    pub keepcnt: ::std::os::raw::c_int,
    pub handler: ngx_connection_handler_pt,
    pub servers: *mut ::std::os::raw::c_void,
    pub log: ngx_log_t,
    pub logp: *mut ngx_log_t,
    pub pool_size: usize,
    pub post_accept_buffer_size: usize,
    pub post_accept_timeout: ngx_msec_t,
    pub previous: *mut ngx_listening_t,
    pub connection: *mut ngx_connection_t,
    pub rbtree: ngx_rbtree_t,
    pub sentinel: ngx_rbtree_node_t,
    pub worker: ngx_uint_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub fastopen: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngx_listening_s"][::std::mem::size_of::<ngx_listening_s>() - 304usize];
    ["Alignment of ngx_listening_s"][::std::mem::align_of::<ngx_listening_s>() - 8usize];
    ["Offset of field: ngx_listening_s::fd"][::std::mem::offset_of!(ngx_listening_s, fd) - 0usize];
    ["Offset of field: ngx_listening_s::sockaddr"]
        [::std::mem::offset_of!(ngx_listening_s, sockaddr) - 8usize];
    ["Offset of field: ngx_listening_s::socklen"]
        [::std::mem::offset_of!(ngx_listening_s, socklen) - 16usize];
    ["Offset of field: ngx_listening_s::addr_text_max_len"]
        [::std::mem::offset_of!(ngx_listening_s, addr_text_max_len) - 24usize];
    ["Offset of field: ngx_listening_s::addr_text"]
        [::std::mem::offset_of!(ngx_listening_s, addr_text) - 32usize];
    ["Offset of field: ngx_listening_s::type_"]
        [::std::mem::offset_of!(ngx_listening_s, type_) - 48usize];
    ["Offset of field: ngx_listening_s::backlog"]
        [::std::mem::offset_of!(ngx_listening_s, backlog) - 52usize];
    ["Offset of field: ngx_listening_s::rcvbuf"]
        [::std::mem::offset_of!(ngx_listening_s, rcvbuf) - 56usize];
    ["Offset of field: ngx_listening_s::sndbuf"]
        [::std::mem::offset_of!(ngx_listening_s, sndbuf) - 60usize];
    ["Offset of field: ngx_listening_s::keepidle"]
        [::std::mem::offset_of!(ngx_listening_s, keepidle) - 64usize];
    ["Offset of field: ngx_listening_s::keepintvl"]
        [::std::mem::offset_of!(ngx_listening_s, keepintvl) - 68usize];
    ["Offset of field: ngx_listening_s::keepcnt"]
        [::std::mem::offset_of!(ngx_listening_s, keepcnt) - 72usize];
    ["Offset of field: ngx_listening_s::handler"]
        [::std::mem::offset_of!(ngx_listening_s, handler) - 80usize];
    ["Offset of field: ngx_listening_s::servers"]
        [::std::mem::offset_of!(ngx_listening_s, servers) - 88usize];
    ["Offset of field: ngx_listening_s::log"]
        [::std::mem::offset_of!(ngx_listening_s, log) - 96usize];
    ["Offset of field: ngx_listening_s::logp"]
        [::std::mem::offset_of!(ngx_listening_s, logp) - 176usize];
    ["Offset of field: ngx_listening_s::pool_size"]
        [::std::mem::offset_of!(ngx_listening_s, pool_size) - 184usize];
    ["Offset of field: ngx_listening_s::post_accept_buffer_size"]
        [::std::mem::offset_of!(ngx_listening_s, post_accept_buffer_size) - 192usize];
    ["Offset of field: ngx_listening_s::post_accept_timeout"]
        [::std::mem::offset_of!(ngx_listening_s, post_accept_timeout) - 200usize];
    ["Offset of field: ngx_listening_s::previous"]
        [::std::mem::offset_of!(ngx_listening_s, previous) - 208usize];
    ["Offset of field: ngx_listening_s::connection"]
        [::std::mem::offset_of!(ngx_listening_s, connection) - 216usize];
    ["Offset of field: ngx_listening_s::rbtree"]
        [::std::mem::offset_of!(ngx_listening_s, rbtree) - 224usize];
    ["Offset of field: ngx_listening_s::sentinel"]
        [::std::mem::offset_of!(ngx_listening_s, sentinel) - 248usize];
    ["Offset of field: ngx_listening_s::worker"]
        [::std::mem::offset_of!(ngx_listening_s, worker) - 288usize];
    ["Offset of field: ngx_listening_s::fastopen"]
        [::std::mem::offset_of!(ngx_listening_s, fastopen) - 300usize];
};
impl ngx_listening_s {
    #[inline]
    pub fn open(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_open(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn open_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_open_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn remain(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_remain(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn remain_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_remain_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ignore(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ignore(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ignore_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ignore_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn bound(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bound(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bound_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_bound_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn inherited(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_inherited(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn inherited_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_inherited_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn nonblocking_accept(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nonblocking_accept(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn nonblocking_accept_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_nonblocking_accept_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn listen(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_listen(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn listen_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_listen_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn nonblocking(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nonblocking(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn nonblocking_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_nonblocking_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn shared(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_shared(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn shared_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_shared_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn addr_ntop(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_addr_ntop(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn addr_ntop_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_addr_ntop_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn wildcard(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_wildcard(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn wildcard_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_wildcard_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ipv6only(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ipv6only(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ipv6only_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ipv6only_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn reuseport(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reuseport(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn reuseport_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_reuseport_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn add_reuseport(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_add_reuseport(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn add_reuseport_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_add_reuseport_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn keepalive(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_keepalive(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn keepalive_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_keepalive_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn deferred_accept(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_deferred_accept(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn deferred_accept_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_deferred_accept_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn delete_deferred(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_delete_deferred(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn delete_deferred_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                17usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_delete_deferred_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn add_deferred(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_add_deferred(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn add_deferred_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                18usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_add_deferred_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                18usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        open: ::std::os::raw::c_uint,
        remain: ::std::os::raw::c_uint,
        ignore: ::std::os::raw::c_uint,
        bound: ::std::os::raw::c_uint,
        inherited: ::std::os::raw::c_uint,
        nonblocking_accept: ::std::os::raw::c_uint,
        listen: ::std::os::raw::c_uint,
        nonblocking: ::std::os::raw::c_uint,
        shared: ::std::os::raw::c_uint,
        addr_ntop: ::std::os::raw::c_uint,
        wildcard: ::std::os::raw::c_uint,
        ipv6only: ::std::os::raw::c_uint,
        reuseport: ::std::os::raw::c_uint,
        add_reuseport: ::std::os::raw::c_uint,
        keepalive: ::std::os::raw::c_uint,
        deferred_accept: ::std::os::raw::c_uint,
        delete_deferred: ::std::os::raw::c_uint,
